{
  "node:slc": "ජාතික ක්‍රිකට් මණ්ඩලය. LPL සහ ජාතික කණ්ඩායම් ජර්සි සඳහා නීති විරෝධී ඔට්ටු ඇල්ලීමේ අනුග්‍රාහකයින් අනුමත කරන ලදී. එක් අවස්ථාවකදී ICC ACU දූෂණ විමර්ශන සජීවීව 22ක්.",
  "node:sumathipala": "හිටපු ශ්‍රී ලංකා ක්‍රිකට් සභාපති සහ පාර්ලිමේන්තුවේ නියෝජ්‍ය කථානායක. පවුල සතුව ස්පෝර්ටිං ස්ටාර් පොත් තැබීමේ ව්‍යාපාරයක් ඇත (ඇස්ත. 1956, දැන් betss.com). ICC විසින් SLC කාර්යාලයෙන් තහනම් කර ඇත. තවමත් නියෝජිතයින් හරහා SLC වෙත බලපෑම් කරයි.",
  "node:shammi": "2019 පෙබරවාරි සිට ශ්‍රී ලංකා ක්‍රිකට් සභාපති, දැන් 4 වන වාරයේ. ක්‍රීඩා අමාත්‍ය රණසිංහ විසින් 'ඔට්ටු ඇල්ලීමේ ෂම්මි' ලෙස හඳුන්වනු ලැබේ. පියසේන ද සිල්වා මහතා සුමතිපාලගේ ක්‍රීඩා තරුවේ කළමනාකරු විය.",
  "node:ashley": "දශකයකට වැඩි කාලයක් ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ප්‍රධාන විධායක නිලධාරියා. LPL පාලක මණ්ඩලයේ සාමාජිකයෙකි. අනුග්‍රාහක අනුමැතිය ඇතුළුව තරඟාවලි මෙහෙයුම් අධීක්ෂණය කරයි.",
  "node:mohan": "ශ්‍රී ලංකා ක්‍රිකට් ලේකම්. 1xBat අනුග්‍රාහකත්වයට හිමිකම් කියනු ලැබුවේ ආසියානු ක්‍රිකට් කවුන්සිලය විසිනි. සුමතිපාල සමඟ ICC මණ්ඩල රැස්වීම්වලට සහභාගී විය.",
  "node:melbet": "1xBet උප-සන්නාමය. පෙලිකන් එන්ටර්ටේන්මන්ට් බී.වී., කුරකාඕ #134359. 1xBet හා සමාන IP, අවාසි සහ පසුබිම බෙදා ගනී. ThePapare/Dialog හි ප්‍රචාරය කර ඇත. ඉන්දියාව, එක්සත් රාජධානිය, ප්‍රංශය සහ වෙනත් රටවල තහනම් කර ඇත.",
  "node:1xbet": "රුසියාව විසින් ආරම්භ කරන ලද, සයිප්‍රස් මූලස්ථානය. ලොව පුරා කළු ලැයිස්තු වල අනුබද්ධ වෙබ් අඩවි ~1,800 ක්. 1xBat නිල ශ්‍රී ලංකා ආසියානු කුසලාන 2023 අනුග්‍රාහකයා විය. සෙමියෝකින්, කසොරින්, කර්ෂ්කොව් විසින් ආරම්භ කරන ලදී.",
  "node:wolf777": "හිමිකරු: රාකේෂ් රාජ්දේව් (ගුජරාට්/ඩුබායි). GIT මෙහෙයුම් NV, කුරකාඕ. අහමදාබාද් අපරාධ ශාඛාවේ සෝදිසි නිවේදනය. රුපියල් කෝටි 1,400 ක ඔට්ටු ඇල්ලීමේ ජාවාරම. 2022 ශ්‍රී ලංකා ඉන්දීය සංචාරය සඳහා ජර්සි අනුග්‍රාහකයා.",
  "node:kheloyar": "මහාදේව් පොත් ජාලය. සෞරබ් චන්ද්‍රකාර් + මුස්තාකිම් ඉබ්‍රාහිම් කස්කාර් (ඩාවුඩ් ඉබ්‍රාහිම්ගේ සහෝදරයා) විසින් මෙහෙයවනු ලැබේ. රුපියල් කෝටි 300-500 ක ආයෝජනයක්. යෙදුම් 60 ක් හරහා රුපියල් කෝටි 200 ක දෛනික පිරිවැටුමක්.",
  "node:crickex": "VB ඩිජිටල් එන්.වී., කුරකාඕ/සයිප්‍රස්. බහු වංචා පැමිණිලි. රොබින් උතප්පා සන්නාම තානාපතිවරයා වේ. ජයග්‍රාහී ගිණුම් කැටි කිරීමේ චෝදනාව.",
  "node:stbet": "ස්පෝර්ටිං ටයිම්ස් වේදිකාව (සංස්ථාගත කරන ලද්දේ 1956, නිර්මාතෘ ඩග් තොම්සන්). STBet.com 2020 දී දියත් කරන ලදී. කුරකාඕ බලපත්‍රය 8047/JAZ. සේවකයින් 1,000+. සුමතිපාලගේ ස්පෝර්ටිං ස්ටාර් සමඟ සාමාන්‍යයෙන් ව්‍යාකූල වේ - ඒවා වෙනම සමාගම් වේ.",
  "node:skyfair": "LPL 2023 ශූරතා අනුග්‍රාහකයා. ස්කයි ඉන්ෆොටෙක් එන්.වී., කුරකාඕ #152377. පාර්ලිමේන්තුවේදී අධිකරණ අමාත්‍යවරයා විසින් 'නීති විරෝධී අක්වෙරළ ඔට්ටු ඇල්ලීමේ වෙබ් අඩවිය' ලෙස නම් කරන ලදී.",
  "node:semiokhin": "1xBet සම-නිර්මාතෘ. 'බ්‍රයන්ස්ක් බිලියනපතියෙක්.' සයිප්‍රස් පුරවැසිභාවය. රුසියාවේ ජාත්‍යන්තර අවශ්‍යතා ලැයිස්තුවේ. නීති විරෝධී සූදුවෙන් රුබල් බිලියන 63ක්.",
  "node:karshkov": "1xBet සම-නිර්මාතෘ. බ්‍රයන්ස්ක් සයිබර් අපරාධ ඒකකයේ (රුසියානු MVD) හිටපු ප්‍රධානියා. 2023 ජුනි මාසයේදී මිය ගියේය - සාමාන්‍ය ස්විස් වෛද්‍ය පරීක්ෂණයකදී 'ඇනෆිලැක්ටික් කම්පනය'. වයස 42. රුසියාවේ අවශ්‍ය ලැයිස්තුවේ.",
  "node:dawood": "ඩී-සමාගම. ඛෙලෝයාර් මුස්තාකිම් ඉබ්‍රාහිම් කස්කාර් (ඩාවුඩ්ගේ සහෝදරයා) සමඟ හවුල්කාරිත්වයෙන් ක්‍රියාත්මක විය. ආරක්ෂක මුදල් ඩී-සමාගමට ගෙවන ලද අතර එය පකිස්ථානයේ අයිඑස්අයි වෙත ගෙවන ලද බව කියනු ලැබේ.",
  "node:rajdev": "වුල්ෆ්777 හිමිකරු. ගුජරාට්/ඩුබායි. අහමදාබාද් අපරාධ අංශයේ සෝදිසි නිලධාරියෙක්. නාග්පූර් පොලිසියට අවශ්‍ය විය (රුපියල් කෝටි 58 ක වංචාවක්). එක් වංචනික බැංකු ගිණුමක් හරහා ED රුපියල් කෝටි 170.70 ක් සොයා ගත්තේය.",
  "node:chandrakar": "ඛෙලෝයාර්/මහදේව් පොත් ක්‍රියාකරු. 2024 දී ඉන්ටර්පෝල් රතු කෝනර් නිවේදනය මත ඩුබායි හිදී අත්අඩංගුවට ගන්නා ලදී. ඩී-සමාගමට ආරක්ෂාව ගෙවන ලදී. යෙදුම් 60 ක් හරහා දිනකට රුපියල් කෝටි 200 ක්.",
  "node:wickremesinghe": "සභාපති (2022-2024). ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසුරුවා හැරීම නිසා ක්‍රීඩා අමාත්‍ය රණසිංහ මහතා ධුරයෙන් පහ කරන ලදී. ෂම්මි සිල්වාගේ පරිපාලනය ඵලදායී ලෙස ආරක්ෂා කළේය.",
  "node:ranasinghe": "සිල්වා 'ඔට්ටු ඇල්ලීමේ ෂම්මි' ලෙස හැඳින්වූ ක්‍රීඩා අමාත්‍ය. ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසුරුවා හරින ලදී. වික්‍රමසිංහ විසින් සියලුම අමාත්‍ය ධුරවලින් නෙරපා හරින ලදී.",
  "node:wijedasa": "අධිකරණ අමාත්‍ය. පාර්ලිමේන්තුවේදී (අගෝස්තු 2023) LPL සඳහා අනුග්‍රහය දක්වන නීති විරෝධී ඔට්ටු ඇල්ලීමේ අඩවි 15 ක් නම් කරන ලදී. ස්කයිෆෙයාර් 'නීති විරෝධී අක්වෙරළ ඔට්ටු ඇල්ලීමේ වෙබ් අඩවිය' ලෙස නම් කරන ලදී. කිසිවක් සිදු නොවීය.",
  "node:harin": "ක්‍රීඩා අමාත්‍ය (2018-19, 2023-24). සුමතිපාලට ශ්‍රී ලංකා ක්‍රිකට් ආයතනයෙන් තහනමක් පැනවීය. තරග පාවාදීමේ නීතිය සම්මත කරන ලදී. අල්ලස් ගැනීමේ උත්සාහයක් වාර්තා විය. නමුත් රණසිංහ ඉවත් කිරීමෙන් පසු සිල්වා මණ්ඩලය යථා තත්ත්වයට පත් කරන ලදී.",
  "node:dissanayake": "වත්මන් සභාපති (NPP). 2025 GRA පනත සම්මත කරන ලදී. ක්‍රීඩා බද්ද 45% දක්වා වැඩි කරන ලදී. GRA 2026 ජුනි මාසයේදී ක්‍රියාත්මක වේ. තහනම නොව නියාමනය කෙරෙහි අවධානය යොමු කරන්න.",
  "node:dialog": "ශ්‍රී ලංකාවේ විශාලතම ටෙලිකොම් ආයතනය. ThePapare සතුයි. 2028 දක්වා ICC විකාශන අයිතිය. ජාතික කණ්ඩායම් අනුග්‍රාහකයා (ඩොලර් මිලියන 4.8). ThePapare හි මෙල්බට් දැන්වීම් ප්‍රචාරය කරයි. අභියෝග කිරීමට තරම් බලවත්.",
  "node:ipg": "ඉන්දියානුවන්ට අයත් ඩුබායි සමාගමකි. 2020 සිට LPL අලෙවිකරණය, විකාශනය, ෆ්‍රැන්චයිස් සහ අනුග්‍රාහකත්ව අයිතිවාසිකම් දරයි. කණ්ඩායම්වලට අනුග්‍රහය දක්වන්නේ කවුරුන්ද යන්න පාලනය කරයි. ශ්‍රී ලංකාවේ අධිකරණ බලයෙන් ඔබ්බට.",
  "node:papare": "ශ්‍රී ලංකාවේ ප්‍රමුඛතම ක්‍රිකට් වෙබ් අඩවිය. ඩයලොග් ආසිආටා සතුය. මෙල්බට් වෙළඳ දැන්වීම් ප්‍රචාරය කරයි. නීති විරෝධී ඔට්ටු ඇල්ලීම ප්‍රවර්ධනය කරන අයිසීසී විකාශන හවුල්කරුගේ අන්තර්ගත අංශය.",
  "node:watson": "ඕස්ට්‍රේලියාව. මෙල්බට් ගෝලීය තානාපති (2021) සහ වුල්ෆ්777 තානාපති (2023). එකම වෙළඳපොළවල් එකවර ඉලක්ක කරගත් නීති විරෝධී වේදිකා දෙකක් අනුමත කරන ලදී.",
  "node:raina": "ඉන්දියාව. 1xBet අනුමත කරන්නා. ED විසින් අන්‍යෝන්‍ය අරමුදල් වලින් රුපියල් කෝටි 6.64 ක් අත්පත් කර ගන්නා ලදී. 1xBet විදේශීය ආයතන සමඟ 'දැනුවත්ව' ගිවිසුම් අත්සන් කළ බවට චෝදනා එල්ල වේ.",
  "node:dhawan": "ඉන්දියාව. 1xBet අනුමත කරන්නා. ED විසින් රුපියල් කෝටි 4.5 ක නිශ්චල දේපළක් අත්පත් කර ගන්නා ලදී.",
  "node:yuvraj": "ඉන්දියාව. 1xBet අනුමත කරන්නා. ED විසින් YWC Health and Wellness Pvt. Ltd හරහා රුපියල් කෝටි 2.5 ක් අනුයුක්ත කරන ලදී.",
  "node:uthappa": "ඉන්දියාව. Crickex සන්නාම තානාපති සහ 1xBet අනුමත කරන්නා. ED රුපියල් ලක්ෂ 8.26ක් අමුණා ඇත.",
  "node:pollard": "බටහිර ඉන්දීය කොදෙව්. 1xBet ඉන්දියානු තානාපති (අවුරුදු 2 ක ගිවිසුම). දිල්ලි දැන්වීම් පුවරු සහ ඔටෝ-රික්ෂෝ දැන්වීම් වල විශේෂාංග කර ඇත.",
  "node:bravo": "බටහිර ඉන්දීය කොදෙව්. ඉන්දියාවේ පළමු 1xBet සන්නාම තානාපති (සැප්තැම්බර් 2021). ටයිම්ස් ඔෆ් ඉන්ඩියා හි සම්පූර්ණ පිටුවක දැන්වීම්.",
  "node:iniesta": "ස්පාඤ්ඤය/බාසිලෝනා පුරාවෘත්තය. මෙල්බට් ගෝලීය තානාපති. 'ශ්‍රේෂ්ඨතම 8' ව්‍යාපාරය.",
  "node:babar": "පකිස්ථාන නායකයා. කලම්බු ස්ට්‍රයිකර්ස් ජර්සියේ ඔට්ටු ඇල්ලීමේ ලාංඡන පැළඳීමට ප්‍රතික්ෂේප කර ඇත. හිස් ජර්සියෙන් පෙනී සිටියේය. සියලුම කොන්ත්‍රාත්තු වලට 'ඔට්ටු ඇල්ලීම තහනම්' වගන්තියක් එක් කරන ලදී.",
  "node:rahman": "දඹුල්ල තන්ඩර්ස් හිමිකරු. 2026 ජනවාරි මාසයේදී වරද පිළිගත්තේය. වසර 4ක අත්හිටවූ සිර දඬුවමක් + රුපියල් මිලියන 24ක දඩයක්. පළමු LPL ෆ්‍රැන්චයිස් හිමිකරු වරදකරු විය.",
  "node:senanayake": "ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයා. 2025 ජුනි මාසයේදී අධිචෝදනා ගොනු කරන ලදී - පළමු අපරාධ නඩුව. 2020 LPL තරඟාවලියේදී ක්‍රීඩකයෙකු අඩු දස්කම් දැක්වීම සඳහා WhatsApp හරහා සම්බන්ධ කර ගත්තේය. අධිකරණයේ පෙනී සිටීමට අපොහොසත් විය.",
  "node:jayasuriya": "ශ්‍රී ලංකා පුරාවෘත්තය. ACU විමර්ශනයට සහයෝගය දැක්වීම ප්‍රතික්ෂේප කිරීම හේතුවෙන් ICC වසර 2ක තහනමක් (2019).",
  "node:jayasundara": "ශ්‍රී ලංකා ක්‍රිකට් විශ්ලේෂක. තරඟ ප්‍රතිඵලවලට බලපෑම් කිරීම සඳහා ක්‍රීඩා අමාත්‍ය හරින් ප්‍රනාන්දුට අල්ලස් දීමට උත්සාහ කිරීම සම්බන්ධයෙන් ICC විසින් චෝදනා එල්ල කර ඇත. තහනම් කර ඇත.",
  "node:curacao": "කැරිබියානු දූපත තොග වශයෙන් අක්වෙරළ සූදු බලපත්‍ර නිකුත් කරයි. වාසිදායක හිමිකරුවන් පිළිබඳ විනිවිදභාවය ශුන්‍යයට ආසන්නයි. මෙල්බෙට්, 1xBet අනුබද්ධ සමාගම්, වුල්ෆ්777, ක්‍රිකෙක්ස්, ස්කයිෆෙයාර්, STBet සහ ස්පෝර්ටිං ස්ටාර් (betss.com) සඳහා නිවාස අධිකරණ බලය.",
  "node:cyprus": "1xBet මූලස්ථානය (ලිමැසෝල්). මෙල්බට් (එඩ්රික් ලිමිටඩ්, ෆැරන් ලිමිටඩ්) සඳහා ගෙවීම් සැකසීම. සෙමියෝකින් සහ කසොරින් සයිප්‍රස් පුරවැසිභාවය දරති.",
  "node:dubai": "IPG මූලස්ථානය. චන්ද්‍රකාර් අත්අඩංගුවට ගත්තේ මෙතනින්. රාජ්දේව් ක්‍රියාත්මක වන්නේ මෙතන සිටයි. ශ්‍රී ලංකාවේ නීතිය ක්‍රියාත්මක කරන ආයතනයට එහා ගිය දෙයක්.",
  "node:icc": "රණසිංහ නිවස පිරිසිදු කිරීමට උත්සාහ කළ විට 'රජයේ ඇඟිලි ගැසීම්' හේතුවෙන් ශ්‍රී ලංකා ක්‍රිකට් ආයතනය අත්හිටුවන ලදී. දූෂණ විරෝධී නීති සංග්‍රහය සූදු සබඳතා තහනම් කරයි - ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට එරෙහිව කිසි විටෙකත් ක්‍රියාත්මක කර නැත. ACU සජීවී ශ්‍රී ලංකා පරීක්ෂණ 22 ක් පැවැත්වීය.",
  "node:marshall": "ICC ACU ප්‍රධානී (විශ්‍රාමික). ස්ටීව් රිචඩ්සන් කොළඹට පත් කරන ලදී. දූෂණ ගැඹුර පිළිබඳව ශ්‍රී ලංකා ජනාධිපතිවරයාට සහ අගමැතිට පැහැදිලි කළේය. ශ්‍රී ලංකාව 'ශුභ ආරංචියක්' ලෙස හැඳින්වීය - විවාදාත්මකයි.",
  "node:lpl": "ශ්‍රී ලංකා විස්සයි20 ෆ්‍රැන්චයිස් ලීගය - 2022–23 වාරවලදී කණ්ඩායම් 6ම නීති විරෝධී විදේශීය ඔට්ටු ඇල්ලීමේ ලාංඡන රැගෙන ගියහ.",
  "node:dambulla": "LPL ෆ්‍රැන්චයිස් එක හිමිකාරීත්වය දරන තමීම් රහ්මාන් සතු වන අතර, ඔහු තරග පාවාදීම් සහ ඔට්ටු ඇල්ලීම ආශ්‍රිත වැරදි සම්බන්ධයෙන් වරද පිළිගත්තේය.",
  "node:colombo_kings": "LPL ෆ්‍රැන්චයිස් - 2022 වාරය තුළ මෙල්බට් ප්‍රධාන කමිස අනුග්‍රාහකයා ලෙස කටයුතු කළේය.",
  "node:mahadev": "ඉන්දියාවේ වඩාත්ම විමර්ශනය කරන ලද නීති විරෝධී ඔට්ටු ඇල්ලීමේ ජාලය - ඛෙලෝයාර් සමඟ බෙදාගත් පසුපෙළ යටිතල පහසුකම් හරහා ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයින් සමඟ සම්බන්ධ වී ඇත.",
  "node:molfar": "දකුණු ආසියාවේ 1xBet අනුබද්ධ ක්‍රියාකරුවන් හරහා අතිච්ඡාදනය වන OSINT-තහවුරු කළ IP යටිතල පහසුකම් ස්ථරය.",
  "node:india_ed": "නීති විරෝධී අක්වෙරළ වේදිකාවලට අනුබල දුන් ශ්‍රී ලංකා සම්බන්ධ ක්‍රිකට් ක්‍රීඩකයින්ගේ රුපියල් කෝටි 19 කට වැඩි වත්කම් ඉන්දීය බලාත්මක කිරීමේ අධ්‍යක්ෂ මණ්ඩලය විසින් අත්පත් කර ගෙන තිබේ.",
  "node:zoysa": "හිටපු ශ්‍රී ලංකා වේග පන්දු යවන්නා - ICC ඉසව්වක් අතරතුර තරඟ පාවා දෙන්නෙකු වෙනුවෙන් ක්‍රියාකාරී ක්‍රීඩකයින් ඇමතීම හේතුවෙන් ICC වසර 6ක තහනමක් (2018).",
  "node:lokuhettige": "චැම්පියන්ස් ලීග් විස්සයි20 තරගාවලිය අතරතුරදී තරග පාවාදීම් ඇතුළු චෝදනා තුනක් සම්බන්ධයෙන් හිටපු ශ්‍රී ලංකා දඟ පන්දු යවන්නෙකුට ICC වසර 8ක තහනමක් (2019).",
  "node:tharanga": "නීතිවිරෝධී ඔට්ටුකරුවන් සමඟ ඇති වූ බවට එල්ල වූ චෝදනා සම්බන්ධයෙන් ICC ACU විමර්ශනය තෙක් ශ්‍රී ලංකා එක්දින කණ්ඩායමේ හිටපු නායකයාගේ වැඩ තහනම් කර ඇත.",
  "node:shanaka": "2026 T20 WC සුපර් 8 තරඟාවලියේදී ශ්‍රී ලංකා ජාතික කණ්ඩායමේ නායකයා - කම්පන සහගත ඉවත් කිරීමෙන් පසු තරඟයෙන් පසු අඛණ්ඩතාව පරීක්ෂාවට ලක් කෙරේ.",
  "node:mustaqim": "හඳුනාගත් D-සමාගමේ සහකරු - විමර්ශකයින් විසින් ඛෙලෝයාර්ගේ දකුණු ආසියානු මෙහෙයුම් සහ මූල්‍ය ප්‍රවාහයන්ට සම්බන්ධයි.",
  "node:jayarathne": "ශ්‍රී ලංකා ක්‍රිකට් විධායක කමිටු සාමාජික - ක්‍රියාකාරී දූෂණ නඩු 22+ ක් ආවරණය වන පරිදි මණ්ඩලය පුරා සිදු කරන ලද විමර්ශනවල කොටසක් ලෙස අත්හිටුවන ලදී.",
  "node:sporting_star": "සුමතිපාල පවුලේ සැබෑ පොත් තැබීමේ සමාගම (ඇස්ත. 1956, දැන් betss.com). ICC විමර්ශනය මෙම නිශ්චිත ව්‍යාපාරය උපුටා දැක්වීය. කලින් අශ්ව රේසිං, දැන් මාර්ගගත ක්‍රීඩා ඔට්ටු ඇල්ලීම.",
  "node:galle_fix": "2000 දශකයේ ගාල්ලේ පැවති තණතීරු පාවාදීමේ අපකීර්තිය - ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාව තුළ පද්ධතිමය අවදානම පිළිබඳ පැරණිතම නූතන සලකුණ.",
  "link:sumathipala→stbet": "සුමතිපාල පවුලට ස්පෝර්ටින් ස්ටාර් (ඇස්ත. 1956) හිමිකාරීත්වය ඇති අතර එය betss.com ක්‍රියාත්මක කරයි — STBet.com නොවේ. STBet මෙහෙයවනු ලබන්නේ ඩග් තොම්සන් විසින් ආරම්භ කරන ලද වෙනම සමාගමක් වන ස්පෝර්ටින් ටයිම්ස් විසිනි (ට්‍රැක්ස්න් වාර්තා අනුව). තෙවන පාර්ශවීය සමාලෝචන අඩවි සාමාන්‍යයෙන් මෙම ආයතන දෙක ඒකාබද්ධ කරයි. අයිසීසී තහනම විශේෂයෙන් සඳහන් කර ඇත්තේ ස්පෝර්ටින් ස්ටාර්, ස්පෝර්ටින් ටයිම්ස්/STBet නොවේ.",
  "link:sumathipala→shammi": "ෂම්මි සිල්වාගේ පියා පියසේන ද සිල්වා සුමතිපාලගේ ස්පෝර්ටිං ස්ටාර් පොත් තැබීමේ ව්‍යාපාරයේ කළමනාකරු විය. සිල්වා සුමතිපාලගේ සහාය ඇතිව ශ්‍රී ලංකා ක්‍රිකට් සභාපතිත්වයට පත්විය. ක්‍රීඩා අමාත්‍ය රණසිංහ පාර්ලිමේන්තුවේදී ප්‍රසිද්ධියේ සිල්වා 'ඔට්ටු ඇල්ලීමේ ෂම්මි' ලෙස හැඳින්වීය.",
  "link:sumathipala→slc": "ICC යේ තනතුරු දැරීම තහනම් කර තිබියදීත්, සුමතිපාල ස්ථාපිත නියෝජිතයින් හරහා ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට බලපෑම් කිරීම දිගටම කරගෙන යයි. ICC යේම විමර්ශනයෙන් මෙම අනුග්‍රාහක ජාලය තහවුරු විය.",
  "link:shammi→slc": "ශම්මි සිල්වා 2019 පෙබරවාරි මාසයේ සිට ශ්‍රී ලංකා ක්‍රිකට් සභාපති ධුරයේ කටයුතු කරන අතර, දැන් 4 වන වරටත් එහි සේවය කරයි. ඔහුගේ ධුර කාලය ශ්‍රී ලංකා ක්‍රිකට් ඉතිහාසයේ නීති විරෝධී ඔට්ටු ඇල්ලීමේ අනුග්‍රාහකයින්ගේ විශාලතම ව්‍යාප්තිය සමඟ සමපාත වේ.",
  "link:ashley→slc": "ඈෂ්ලි ද සිල්වා දශකයකට වැඩි කාලයක් ප්‍රධාන විධායක නිලධාරියා ලෙස සේවය කළේය. LPL පාලක මණ්ඩලයේ අසුන් ගනී. සියලුම අනුග්‍රාහක අනුමැතිය ඔහුගේ කාර්යාලය හරහා සිදු වේ.",
  "link:mohan→slc": "මොහාන් ද සිල්වා ශ්‍රී ලංකා ක්‍රිකට් ලේකම් ලෙස කටයුතු කරයි. '1xBat' ආසියානු කුසලාන අනුග්‍රාහකත්වය ආසියානු ක්‍රිකට් කවුන්සිලය විසින් අනුමත කරන ලද බව ඔහු ප්‍රසිද්ධියේ ප්‍රකාශ කළේය - එය ACC විසින් විවාද කරන ලද ප්‍රකාශයකි.",
  "link:mohan→sumathipala": "දෙදෙනාම ICC මණ්ඩල රැස්වීම්වලට එක්ව සහභාගී වූහ. සම්බන්ධීකරණයේ ස්වභාවය ශ්‍රී ලංකාවේ මාධ්‍ය වාර්තා කිහිපයකම ලේඛනගත කර ඇත.",
  "link:slc→1xbet": "'1xBat' (ගූගල් දැන්වීම් ප්‍රතිපත්ති වළක්වා ගැනීම සඳහා 1xBet හි නැවත සන්නාමයක්) ශ්‍රී ලංකාවේ 2023 ආසියානු කුසලාන ප්‍රචාරක ව්‍යාපාරයේ නිල අනුග්‍රාහකයා විය. ශ්‍රී ලංකා ක්‍රිකට් ලේකම් මොහාන් ද සිල්වා ගනුදෙනුව තහවුරු කළේය.",
  "link:slc→wolf777": "2022 ඉන්දීය සංචාරයේදී ශ්‍රී ලංකා ජාතික කණ්ඩායමේ ජර්සියේ පිටුපස Wolf777 දර්ශනය විය. ජර්සි ඡායාරූප පුළුල් ලෙස සංසරණය විය. Wolf777 හිමිකරු රාකේෂ් රාජ්දේව් ඉන්දීය පොලිසිය විසින් සොයමින් සිටී.",
  "link:slc→skyfair": "ස්කයිෆෙයාර් LPL 2023 ශූරතා අනුග්‍රාහකයා විය. අධිකරණ අමාත්‍ය විජේදාස රාජපක්ෂ 2023 අගෝස්තු මාසයේදී පාර්ලිමේන්තුවේදී එය 'නීති විරෝධී අක්වෙරළ ඔට්ටු ඇල්ලීමේ වෙබ් අඩවියක්' ලෙස නම් කළේය.",
  "link:slc→kheloyar": "ඛෙලෝයාර් LPL කණ්ඩායම් වලට අනුග්‍රහය දැක්වීය. ඛෙලෝයාර් පිටුපස ඇති මහාදේව් පොත් ජාලය ක්‍රියාත්මක වූයේ D-Company (ඩාවුඩ් ඉබ්‍රාහිම්ගේ අපරාධ ජාලය) සමඟ හවුල්කාරිත්වයෙනි.",
  "link:slc→crickex": "Crickex සමාගම LPL කණ්ඩායම් සඳහා අනුග්‍රහය දැක්වීය. කුරකාවෝ/සයිප්‍රසයේ VB ඩිජිටල් N.V. ලෙස ලියාපදිංචි කර ඇත. පාරිභෝගික වංචා පැමිණිලි කිහිපයක් ගොනු කර ඇත.",
  "link:slc→melbet": "මෙල්බට් ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ඩිජිටල් පරිසර පද්ධතිය හරහා ප්‍රචාරණය කළේය, ප්‍රධාන වශයෙන් ThePapare (ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ප්‍රධාන අනුග්‍රාහකයා වන ඩයලොග් සතු) හරහා. වක්‍ර නමුත් ප්‍රතික්ෂේප කළ නොහැකි වාණිජ සම්බන්ධතාවයක්.",
  "link:1xbet→melbet": "තාක්ෂණික විශ්ලේෂණයෙන් පෙනී යන්නේ මෙල්බට් 1xBet හා සමාන IP යටිතල පහසුකම්, අවාසි සංග්‍රහය, පසුපෙළ වේදිකාව සහ සමාන නියමයන් සහ කොන්දේසි බෙදා ගන්නා බවයි. මෙල්බට් කුරකාඕ හි පෙලිකන් එන්ටර්ටේන්මන්ට් බී.වී. ලෙස ලියාපදිංචි වී ඇත - එය ප්‍රසිද්ධ 1xBet ෂෙල් ආයතනයකි.",
  "link:1xbet→semiokhin": "රෝමන් සෙමියෝකින් 1xBet සම-නිර්මාතෘවරයෙකු බව තහවුරු කර ඇත. රුසියානු මාධ්‍ය සහ අධිකරණ ගොනු කිරීම් ඔහුව හඳුනා ගනී. ඔහු සයිප්‍රස් පුරවැසිභාවය හිමිකරගෙන ඇති අතර නීති විරෝධී සූදුව සඳහා රුසියාවේ ජාත්‍යන්තර අවශ්‍ය ලැයිස්තුවේ (රූබල් බිලියන 63) සිටී.",
  "link:1xbet→karshkov": "සර්ජි කාර්ෂ්කොව් 1xBet සම-නිර්මාතෘවරයෙකු සහ බ්‍රයන්ස්ක් සයිබර් අපරාධ ඒකකයේ හිටපු ප්‍රධානියා විය. 2023 ජුනි මාසයේදී වයස අවුරුදු 42 දී, සාමාන්‍ය ස්විට්සර්ලන්ත වෛද්‍ය පරීක්ෂණයකදී 'ඇනෆිලැක්ටික් කම්පනයෙන්' මිය ගියේය. සැක සහිත යැයි පුළුල් ලෙස සැලකෙන තත්වයන්.",
  "link:1xbet→curacao": "1xBet බහු ෂෙල් සමාගම් හරහා කුරකාඕ ඊ-ක්‍රීඩා බලපත්‍ර යටතේ ක්‍රියාත්මක වේ.",
  "link:1xbet→cyprus": "1xBet හි මෙහෙයුම් මූලස්ථානය සයිප්‍රසයේ ලිමසෝල් හි පිහිටා ඇත. ගෙවීම් සැකසුම් ආයතන (එඩ්රික් ලිමිටඩ්, ෆැරන් ලිමිටඩ්) සයිප්‍රසයේ ලියාපදිංචි වී ඇත.",
  "link:melbet→curacao": "මෙල්බට්, පෙලිකන් එන්ටර්ටේන්මන්ට් බී.වී. හරහා කුරකාවෝ බලපත්‍රය #134359 යටතේ ක්‍රියාත්මක වේ.",
  "link:melbet→cyprus": "මෙල්බට් හි ගෙවීම් සැකසීම 1xBet සමඟ බෙදාගත් සයිප්‍රසයේ ලියාපදිංචි ආයතන හරහා ක්‍රියාත්මක වේ.",
  "link:kheloyar→dawood": "ED (බලාත්මක කිරීමේ අධ්‍යක්ෂ මණ්ඩලය, ඉන්දියාව) විසින් සත්‍යාපනය කරන ලදී: ඛෙලෝයාර් ඩාවුඩ් ඉබ්‍රාහිම්ගේ සහෝදරයා වන මුස්තාකිම් ඉබ්‍රාහිම් කස්කාර් සමඟ කටයුතු කළේය. D-සමාගමට ආරක්ෂණ මුදල් ගෙවන ලදී. නිල ඉන්දියානු නීතිය ක්‍රියාත්මක කිරීමේ ගොනු කිරීම් වලින්.",
  "link:kheloyar→chandrakar": "ඉන්ටර්පෝල් රතු කෝනර් නිවේදනය (2024) මත ඩුබායි හිදී සෞරබ් චන්ද්‍රකාර් අත්අඩංගුවට ගන්නා ලදී. ඔහු ඔට්ටු ඇල්ලීමේ යෙදුම් 60+ හරහා දිනකට රුපියල් කෝටි 200 ක් සැකසීමේ මහාදේව් පොත් ජාලය ක්‍රියාත්මක කළ බව ED තහවුරු කළේය.",
  "link:chandrakar→dubai": "ඉන්දියාවේ ඉල්ලීම පරිදි නිකුත් කරන ලද ඉන්ටර්පෝල් රතු කෝනර් නිවේදනය මත පදනම්ව චන්ද්‍රකාර් ඩුබායිහිදී අත්අඩංගුවට ගන්නා ලදී.",
  "link:wolf777→rajdev": "අහමදාබාද් අපරාධ අංශය සහ නාග්පූර් පොලිසිය රාකේෂ් රාජ්දේව් සඳහා සෝදිසි නිවේදන නිකුත් කර ඇත. වුල්ෆ්777 හා සම්බන්ධ තනි වංචනික බැංකු ගිණුමක් හරහා ED රුපියල් කෝටි 170.70 ක් සොයා ගත්තේය.",
  "link:wolf777→curacao": "Wolf777 ක්‍රියාත්මක වන්නේ කුරකාවෝ හි ලියාපදිංචි GIT Operations N.V. හරහාය.",
  "link:rajdev→dubai": "රාජ්දේව් ඩුබායි සිට ක්‍රියාත්මක වන අතර, ඉන්දියානු පිටුවහල් කිරීමේ හැකියාවෙන් ඔබ්බට ය. ඉන්දියානු නීතිය ක්‍රියාත්මක කරන ආයතන රැසකට නඩු විභාග වෙමින් පවතී.",
  "link:stbet→curacao": "STBet ක්‍රියාත්මක වන්නේ කුරකාඕ බලපත්‍රය 8047/JAZ යටතේය. ස්පෝර්ටින් ටයිම්ස් සතුය — ස්පෝර්ටින් ස්ටාර් නොවේ/සුමතිපාල. මෙම ආයතන දෙක සාමාන්‍යයෙන් නමුත් වැරදි ලෙස ඒකාබද්ධ කර ඇත.",
  "link:dialog→papare": "ThePapare.com හි හිමිකාරිත්වය ඩයලොග් ආසිආටා සතුය. ආයතනික වාර්තා මගින් සම්පූර්ණ හිමිකාරිත්වය තහවුරු කරයි.",
  "link:dialog→slc": "ඩයලොග් සමාගම ශ්‍රී ලංකා ක්‍රිකට් ආයතනය සමඟ ඩොලර් මිලියන 4.8 ක අනුග්‍රාහක ගිවිසුමක් ඇති කරගෙන ඇති අතර 2028 දක්වා ශ්‍රී ලංකාවේ ICC විකාශන අයිතිය දරයි. ද්විත්ව වාණිජ සබඳතාව දැවැන්ත උනන්දුවක් ඇති කරන ගැටුමක් ඇති කරයි.",
  "link:dialog→icc": "2028 දක්වා ශ්‍රී ලංකාවේ ICC විකාශන අයිතිය ඩයලොග් සතුය.",
  "link:papare→melbet": "මෙල්බට් සංදර්ශක දැන්වීම් ThePapare.com හි ප්‍රචාරය විය. බහු නිරීක්ෂකයින් විසින් ලේඛනගත කරන ලද තිරපිටපත්. මේවා 'ක්‍රමලේඛනගත' (ස්වයංක්‍රීය) දැන්වීම් බව ඩයලොග් පවසයි.",
  "link:ipg→slc": "IPG (ඩුබායි) 2020 සිට LPL අලෙවිකරණය, විකාශනය, ෆ්‍රැන්චයිස් සහ අනුග්‍රාහකත්ව අයිතිවාසිකම් දරයි. කණ්ඩායම් ජර්සිවල දිස්වන්නේ කුමන අනුග්‍රාහකයන්ද යන්න ඔවුන් පාලනය කරයි.",
  "link:ipg→dubai": "IPG ආයතනය ඩුබායි හි පිහිටා ඇති අතර, එය වගවීම සම්බන්ධයෙන් ශ්‍රී ලංකාවේ අධිකරණ බලයෙන් ඔබ්බට යවයි.",
  "link:wickremesinghe→shammi": "ක්‍රීඩා අමාත්‍ය රණසිංහ ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසුරුවා හරින විට, ජනාධිපති වික්‍රමසිංහ මහතා රණසිංහ මහතා සියලු අමාත්‍යාංශවලින් නෙරපා හැර සිල්වා මහතාගේ නායකත්වයෙන් යුත් මණ්ඩලය නැවත ස්ථාපිත කළේය.",
  "link:wickremesinghe→ranasinghe": "ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසුරුවා හැර සිල්වා 'ෂම්මි ඔට්ටු ඇල්ලීම' ලෙස හැඳින්වීමෙන් පසු වික්‍රමසිංහ මහතා රණසිංහ මහතා සියලු අමාත්‍ය ධුරවලින් නෙරපා හැරියේය. ශ්‍රී ලංකාවේ සියලුම මාධ්‍යවල පුළුල් ලෙස වාර්තා විය.",
  "link:wickremesinghe→harin": "රණසිංහගේ ධුරයෙන් පහකිරීමෙන් පසු ආදේශක ක්‍රීඩා අමාත්‍යවරයා ලෙස හරීන් ප්‍රනාන්දු පත් කරන ලදී.",
  "link:ranasinghe→shammi": "රණසිංහ ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසුරුවා හැර, පාර්ලිමේන්තුවේදී සිල්වාව ප්‍රසිද්ධියේ 'බෙටිං ෂම්මි' ලෙස හැඳින්වීය. පාර්ලිමේන්තු හැන්සාඩ් වාර්තා පවතී.",
  "link:harin→sumathipala": "2018-19 ධුර කාලය තුළ, ප්‍රනාන්දු, ICC සමඟ එක්ව කටයුතු කරමින්, ශ්‍රී ලංකා ක්‍රිකට් කාර්යාලයෙන් සුමතිපාලට තහනමක් පැනවීමට සාර්ථකව කටයුතු කළේය.",
  "link:harin→shammi": "රණසිංහ ඉවත් කිරීමෙන් පසු සිල්වා මණ්ඩලය පත් කිරීමෙන් පසු ප්‍රනාන්දු මහතා නැවත පත් කළේය. මෙය ප්‍රායෝගිකද (ICC අත්හිටුවීම වළක්වා ගැනීම) නැතහොත් අනුගත වේද යන්න විවාදයට භාජනය වේ.",
  "link:harin→icc": "පාලන ප්‍රතිසංස්කරණ සඳහා වන කොන්දේසි සපුරාලමින් ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ අත්හිටුවීම ඉවත් කිරීම සඳහා ප්‍රනාන්දු මහතා ICC සමඟ සාකච්ඡා කළේය.",
  "link:harin→jayasundara": "ශ්‍රී ලංකා ක්‍රිකට් විශ්ලේෂක ජයසුන්දර විසින් අල්ලස් ලබා ගැනීමට තැත් කළ බවට ප්‍රනාන්දු මහතා ICC ACU වෙත වාර්තා කළේය. පසුව ජයසුන්දරට චෝදනා එල්ල වී තහනම් කරන ලදී.",
  "link:wijedasa→skyfair": "අධිකරණ අමාත්‍ය විජේදාස රාජපක්ෂ 2023 අගෝස්තු මාසයේ පාර්ලිමේන්තු කතාවකදී LPL සඳහා අනුග්‍රහය දක්වන ස්කයිෆෙයාර් සහ තවත් නීති විරෝධී ඔට්ටු ඇල්ලීමේ අඩවි 14 ක් නම් කළේය. හැන්සාඩ් වාර්තා පවතී. නීතිමය ක්‍රියාමාර්ග කිසිවක් අනුගමනය කර නොමැත.",
  "link:dissanayake→slc": "NPP රජය 2025 ක්‍රීඩා නියාමන අධිකාරියේ පනත සම්මත කර ක්‍රීඩා බද්ද 45% දක්වා ඉහළ නැංවීය. GRA 2026 ජුනි වන විට ක්‍රියාත්මක වනු ඇතැයි අපේක්ෂා කෙරේ.",
  "link:icc→slc": "රණසිංහ පිරිසිදු කිරීමට උත්සාහ කළ විට 'රජයේ ඇඟිලි ගැසීම්' හේතුවෙන් ICC ය SLC ආයතනය අත්හිටුවන ලදී. ශ්‍රී ලංකා ක්‍රිකට් දූෂණ සම්බන්ධයෙන් ACU ආයතනය සජීවී පරීක්ෂණ 22 ක් පැවැත්වීය.",
  "link:marshall→icc": "ඇලෙක්ස් මාෂල් විශ්‍රාම යාමට පෙර ICC ACU හි සාමාන්‍යාධිකාරී ලෙස සේවය කළේය. ඔහු පරීක්ෂණ සඳහා ස්ටීව් රිචඩ්සන් කොළඹට යැවීය.",
  "link:marshall→slc": "ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාවේ දූෂණයේ ගැඹුර පිළිබඳව මාෂල් ශ්‍රී ලංකා ජනාධිපතිවරයාට සහ අගමැතිවරයාට පැහැදිලි කළේය.",
  "link:watson→melbet": "ෂේන් වොට්සන් මෙල්බට් හි ගෝලීය සන්නාම තානාපති ලෙස (2021 ව්‍යාපාරය) සේවය කළේය. ප්‍රවර්ධන ද්‍රව්‍ය බහුලව තිබේ.",
  "link:watson→wolf777": "වොට්සන් ද Wolf777 (2023) අනුමත කළේය. එම පුද්ගලයාම අතිච්ඡාදනය වන වෙළඳපොළවල් ඉලක්ක කරගත් නීති විරෝධී ඔට්ටු ඇල්ලීමේ වේදිකා දෙකක් අනුමත කරයි.",
  "link:raina→1xbet": "ED (බලාත්මක කිරීමේ අධ්‍යක්ෂ මණ්ඩලය) රයිනාගේ අන්‍යෝන්‍ය අරමුදල් කොටස් වලින් රුපියල් කෝටි 6.64 ක් අත්පත් කර ගත්තේය. රයිනා 'දැනුවත්ව' 1xBet විදේශීය ආයතන සමඟ අනුමත කිරීමේ ගිවිසුම් අත්සන් කළ බවට චෝදනා එල්ල වේ.",
  "link:dhawan→1xbet": "1xBet අනුමත කිරීමේ ඉපැයීම්වලට සම්බන්ධ ධවාන්ගේ නිශ්චල දේපළෙන් රුපියල් කෝටි 4.5 ක් ED විසින් අත්පත් කර ගන්නා ලදී.",
  "link:yuvraj→1xbet": "යුවරාජ් සිංට සම්බන්ධ සමාගමක් වන YWC හෙල්ත් ඇන්ඩ් වෙල්නස් පුද්ගලික සමාගම හරහා ED විසින් රුපියල් කෝටි 2.5 ක් අත්පත් කර ගන්නා ලදී.",
  "link:uthappa→crickex": "රොබින් උතප්පා ක්‍රිකෙක්ස් හි සන්නාම තානාපතිවරයා ලෙස කටයුතු කර ඇත. ප්‍රවර්ධන වීඩියෝ සහ සමාජ මාධ්‍ය සටහන් මගින් තහවුරු වේ.",
  "link:uthappa→1xbet": "උතප්පා ද 1xBet අනුමත කළේය. ED ඔහුගේ වත්කම්වලින් රුපියල් ලක්ෂ 8.26 ක් ඇපයට තැබීය.",
  "link:pollard→1xbet": "කියෙරොන් පොලාර්ඩ් 1xBet ඉන්දියාවේ තානාපති ලෙස වසර 2ක ගිවිසුමක් අත්සන් කළේය. දිල්ලි දැන්වීම් පුවරු සහ ඔටෝ-රික්ෂෝ එතුම්වල ඉදිරිපත් කර ඇත.",
  "link:bravo→1xbet": "ඩ්වේන් බ්‍රාවෝ ඉන්දියාවේ පළමු 1xBet සන්නාම තානාපතිවරයා විය (සැප්තැම්බර් 2021). ටයිම්ස් ඔෆ් ඉන්ඩියා හි සම්පූර්ණ පිටුවක දැන්වීම් ලේඛනගත කර ඇත.",
  "link:iniesta→melbet": "ඇන්ඩ්‍රෙස් ඉනියෙස්ටා 'ද ග්‍රේටස්ට් 8' ව්‍යාපාරයේ මෙල්බට් ගෝලීය තානාපති ලෙස සේවය කළේය.",
  "link:babar→kheloyar": "LPL අතරතුර කලම්බු ස්ට්‍රයිකර්ස් ජර්සියේ ඛෙලෝයාර් ලාංඡනය පැළඳීම බාබර් අසාම් ප්‍රතික්ෂේප කළේය. හිස් ජර්සියකින් පෙනී සිටියේය. සියලුම කොන්ත්‍රාත්තු වලට 'ඔට්ටු ඇල්ලීමේ සමාගමක් නැත' යන වගන්තිය එක් කරන ලදී.",
  "link:rahman→slc": "දඹුල්ල තන්ඩර්ස් හිමිකරු තමීම් රහ්මාන් 2026 ජනවාරි මාසයේදී වරද පිළිගත්තේය. වසර 4 ක අත්හිටවූ සිර දඬුවමක් + රුපියල් මිලියන 24 ක දඩයක්. පළමු LPL ෆ්‍රැන්චයිස් හිමිකරු වරදකරු විය.",
  "link:senanayake→slc": "2025 ජුනි මාසයේදී සචිත්‍ර සේනානායකට අධිචෝදනා ගොනු කරන ලදී — ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩකයෙකුට තරඟ පාවාදීම සම්බන්ධයෙන් පළමු වරට අපරාධ නඩු පැවරීම. 2020 LPL තරඟාවලිය අතරතුර WhatsApp හරහා ක්‍රීඩකයෙකු සම්බන්ධ කර ගැනීමේ චෝදනාව.",
  "link:jayasuriya→slc": "ACU දූෂණ විරෝධී විමර්ශනයට සහයෝගය දැක්වීම ප්‍රතික්ෂේප කිරීම හේතුවෙන් සනත් ජයසූරියට වසර 2ක ICC තහනමක් (2019) හිමි විය.",
  "link:crickex→curacao": "ක්‍රිකෙක්ස් ක්‍රියාත්මක වන්නේ කුරකාවෝ හි ලියාපදිංචි වීබී ඩිජිටල් එන්.වී. හරහා ය.",
  "link:skyfair→curacao": "ස්කයිෆෙයාර් ක්‍රියාත්මක වන්නේ ස්කයි ඉන්ෆොටෙක් එන්.වී., කුරකාඕ #152377 හරහාය.",
  "link:lpl→slc": "ලංකා ප්‍රිමියර් ලීග් ෆ්‍රැන්චයිස් ක්‍රියාත්මක වන්නේ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ පාලන ව්‍යුහය යටතේය. ශ්‍රී ලංකා ක්‍රිකට් ආයතනය විකාශන අයිතිවාසිකම්, ෆ්‍රැන්චයිස් බලපත්‍ර සහ ක්‍රීඩකයින් ලබා ගැනීමේ කොන්ත්‍රාත්තු පාලනය කරයි.",
  "link:lpl→stbet": "2023 වාරය සඳහා LPL ශූරතා අනුග්‍රාහකයා ලෙස STBet නම් කරන ලදී. සටහන: STBet මෙහෙයවනු ලබන්නේ සුමතිපාල පවුලේ ස්පෝර්ටිං ස්ටාර් විසින් නොව ස්පෝර්ටිං ටයිම්ස් (ඩග් තොම්සන්) විසිනි. උනන්දුව පිළිබඳ ගැටුම පිළිබඳ කතාව තවදුරටත් සත්‍යාපනය කිරීම අවශ්‍ය වේ.",
  "link:lpl→melbet": "ශ්‍රී ලංකාවේ බලපත්‍ර රහිත අක්වෙරළ ක්‍රියාකරුවෙකු ලෙස වර්ගීකරණය කර තිබියදීත්, 2022–23 වාරවලදී මෙල්බට් විසින් LPL කණ්ඩායම් ජර්සි කිහිපයකට අනුග්‍රහය දැක්වීය.",
  "link:lpl→1xbet": "1xBat ලාංඡනය (1xBet උප-සන්නාමය) 2022 වාරය තුළ LPL ෆ්‍රැන්චයිස් කණ්ඩායම් ජර්සි 6 පුරාම දර්ශනය විය - තරඟාවලියේ වඩාත්ම පැතිරුණු තනි-ක්‍රියාකරු විනිවිද යාම.",
  "link:dambulla→lpl": "දඹුල්ල තන්ඩර්ස් යනු ලංකා ප්‍රිමියර් ලීග් තරගාවලියේ මුල් ෆ්‍රැන්චයිස් හයෙන් එකකි.",
  "link:dambulla→rahman": "දම්බුල්ලා තන්ඩර්ස් කණ්ඩායමේ හිමිකරු වූ තමීම් රහ්මාන්, තරග පාවාදීම් සහ නීති විරෝධී ඔට්ටු ඇල්ලීමේ වැරදි සම්බන්ධයෙන් වරද පිළිගත්තේය - වරදකරු වූ පළමු LPL කණ්ඩායමේ හිමිකරු ඔහු විය.",
  "link:colombo_kings→lpl": "කලම්බු කිංග්ස් යනු LPL ෆ්‍රැන්චයිස් කණ්ඩායම් හයෙන් එකකි.",
  "link:colombo_kings→melbet": "2022 LPL තරඟාවලියේදී කලම්බු කිංග්ස් කණ්ඩායමේ ප්‍රධාන කමිස අනුග්‍රාහකයා වූයේ මෙල්බට් ය.",
  "link:mahadev→kheloyar": "මහාදේව් බුක් සහ කෙලෝයාර්ගේ දකුණු ආසියානු මෙහෙයුම් අතර බෙදාගත් තාක්ෂණික යටිතල පහසුකම් පිළිබඳව ඉන්දීය බලාත්මක කිරීමේ අධ්‍යක්ෂ මණ්ඩලයේ විමර්ශන ලේඛනවල සඳහන් වේ.",
  "link:mahadev→india_ed": "ඉන්දියාවේ ED බහු-රාජ්‍ය මර්දනයේ ප්‍රධාන ඉලක්කය මහාදේව් පොත් ඔට්ටු ඇල්ලීමේ ජාලයයි. බහු ක්‍රියාකරුවන් අත්අඩංගුවට ගෙන වත්කම් රාජසන්තක කර ඇත.",
  "link:india_ed→yuvraj": "1xBet අනුබද්ධ වේදිකාවක් සමඟ අනුමත කිරීමේ කොන්ත්‍රාත්තුවලට සම්බන්ධ යුවරාජ් සිංගෙන් රුපියල් කෝටි 6.64 ක වත්කම් ඉන්දීය ED විසින් අත්පත් කර ගන්නා ලදී.",
  "link:india_ed→dhawan": "අනුබද්ධිත අක්වෙරළ ඔට්ටු ඇල්ලීමේ වේදිකාවකට සම්බන්ධ ශිකර් ධවාන්ගෙන් රුපියල් කෝටි 4.5 ක වත්කම් ඉන්දීය ED විසින් අත්පත් කර ගන්නා ලදී.",
  "link:india_ed→uthappa": "ඉන්දීය ED ආයතනය විසින් අක්වෙරළ සූදු ක්‍රියාකරුවෙකුගේ අනුමැතියට අදාළ රොබින් උතප්පාගේ රුපියල් කෝටි 2.5 ක වත්කම් අත්පත් කර ගන්නා ලදී.",
  "link:india_ed→1xbet": "1xBet සහ එහි අනුබද්ධ වේදිකා ක්‍රියාකාරී ඉන්දියානු ED අධිකරණ බලය යටතේ පවතින අතර, ප්‍රවර්ධන ජාල හරහා බහු වත්කම් අමුණා ඇත.",
  "link:molfar→1xbet": "මොල්ෆාර් විසින් කරන ලද OSINT විශ්ලේෂණය මගින් දකුණු ආසියාව පුරා 1xBet සන්නාමගත මෙහෙයුම් සහ අනුබද්ධ ක්‍රියාකරුවන් අතර IP ලිපිනය සහ යටිතල පහසුකම් අතිච්ඡාදනය වන බව තහවුරු කරන ලදී.",
  "link:mustaqim→dawood": "මුස්තාකිම් ඊබ්‍රාහිම් කස්කාර් යනු ඩාවුඩ් ඊබ්‍රාහිම් ඩී-සමාගම අපරාධ ජාලයේ හඳුනාගත් සහකරුවෙකු බව නීතිය ක්‍රියාත්මක කරන ලියකියවිලි මගින් සනාථ වේ.",
  "link:mustaqim→kheloyar": "ඛෙලෝයාර්ගේ දකුණු ආසියානු ඔට්ටු ඇල්ලීමේ මෙහෙයුම්වලට සම්බන්ධ මූල්‍ය ප්‍රවාහයන්ට මුස්තාකිම් කස්කාර් සම්බන්ධ බව විමර්ශකයින් විසින් සොයාගෙන ඇත.",
  "link:zoysa→icc": "2018 දී, රහසිගත ක්‍රියාකාරිකයෙකු වෙත ගොස් නම් කරන ලද පාවාදීමක් වෙනුවෙන් තරඟයක අංග නිවැරදි කිරීමට උත්සාහ කිරීම සම්බන්ධයෙන් ICC ය නුවන් සොයිසාට වසර 6 ක තහනමක් පනවන ලදී.",
  "link:zoysa→slc": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ කොන්ත්‍රාත්තුව ලැබූ හිටපු ක්‍රීඩකයෙකු ලෙස, සොයිසා තම ප්‍රවේශය භාවිතා කරමින් තරග පාවාදීම්කරුවන් වෙනුවෙන් ක්‍රියාකාරී ජාතික සංචිත සාමාජිකයින් වෙත ළඟා විය.",
  "link:lokuhettige→icc": "චැම්පියන්ස් ලීග් විස්සයි20 තරගාවලිය අතරතුර ප්‍රවේශයන් ඇතුළුව තරග පාවාදීමේ චෝදනා තුනක් ඔප්පු වීමෙන් පසුව, 2019 දී අයිසීසී විසින් දිල්හාර ලොකුහෙට්ටිගේට වසර 8 ක තහනමක් පැනවීය.",
  "link:lokuhettige→galle_fix": "ලොකුහෙට්ටිගේගේ සම්බන්ධතා, ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ පද්ධතිමය දුර්වලතා මුලින්ම හෙළි කළ පුළුල් ගාලු යුගයේ පාවාදීම් ජාලය දක්වා දිව යයි.",
  "link:tharanga→slc": "උපුල් තරංග ශ්‍රී ලංකා එක්දින නායකයා ලෙස කටයුතු කළ අතර, ICC ACU පරීක්ෂණයක් පැවැත්වෙන තෙක් ශ්‍රී ලංකා ක්‍රිකට් ආයතනය විසින් ඔහුට තාවකාලිකව අත්හිටුවන ලදී.",
  "link:tharanga→icc": "නීතිවිරෝධී ඔට්ටුකරුවන් සමඟ සම්බන්ධතා පැවැත්වූ බවට බුද්ධි තොරතුරු ලැබීමෙන් පසු, ICC ACU විසින් උපුල් තරංග සම්බන්ධයෙන් විධිමත් පරීක්ෂණයක් ආරම්භ කරන ලදී.",
  "link:shanaka→slc": "2022 සිට ශ්‍රී ලංකා ජාතික කණ්ඩායමේ නායකත්වය දසුන් ශානක විසින් දරනු ලැබූ අතර, 2026 T20 ලෝක කුසලාන තරගාවලියේදී සුපිරි 8 වටයෙන් ඉවත් වීමත් සමඟ එය සිදුවිය.",
  "link:jayarathne→slc": "ජෙරොම් ජයරත්න ශ්‍රී ලංකා ක්‍රිකට් විධායක කමිටුවේ සේවය කළ අතර දූෂණ නඩු 22+ ක් සම්බන්ධයෙන් මණ්ඩලය පුරා සිදු කරන ලද විමර්ශනවල කොටසක් ලෙස අත්හිටුවන ලද නිලධාරීන් අතර විය.",
  "link:sporting_star→sumathipala": "'යූ.ඩබ්ලිව්. සුමතිපාල සහ පුත්‍රයෝ' (දේශීය ආදායම් දෙපාර්තමේන්තුවේ ලියාපදිංචිය) හරහා ස්පෝර්ටිං ස්ටාර් සුමතිපාල පවුලට අයත් වේ. අයිසීසී ආචාර ධර්ම විමර්ශනය ස්පෝර්ටිං ස්ටාර් පොත් තැබීමේ ව්‍යාපාරය ලෙස පැහැදිලිව නම් කළේය. එක්සත් රාජධානියේ පොත් තබන්නෙකු වන ග්ලින් පාමර් එය ස්ථාපිත කිරීමට උදව් කිරීම පිළිබඳව අයිසීසී ඒසීයූ වෙත සාක්ෂි දුන්නේය. දැන් betss.com ලෙස මාර්ගගතව ක්‍රියාත්මක වේ.",
  "link:sporting_star→curacao": "betss.com (ස්පෝර්ටිං ස්ටාර්) අක්වෙරළ ක්‍රීඩා බලපත්‍රයක් සමඟ ලැයිස්තුගත කර ඇත. අධිකරණ බලය පිළිබඳ විස්තර කුරකාඕ උප බලපත්‍ර ව්‍යුහයට ගැලපේ.",
  "link:galle_fix→slc": "2000 දශකයේ මුල් භාගයේ ගාල්ලේ තණතීරු පාවාදීමේ වංචාව, ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාව තුළ පද්ධතිමය අඛණ්ඩතාව අසාර්ථකත්වය පිළිබඳ පළමු ප්‍රධාන ලේඛනගත සිද්ධිය වූ අතර, දශක දෙකක් පුරා පැවති රටාවන් ස්ථාපිත කළේය."
}