{
  "node:slc": "National cricket board. Approved illegal betting sponsors for LPL and national team jerseys. 22 live ICC ACU corruption investigations at one point.",
  "node:sumathipala": "Former SLC President & Deputy Speaker of Parliament. Family owns Sporting Star bookmaking business (est. 1956, now betss.com). Banned from SLC office by ICC. Still influences SLC through proxies.",
  "node:shammi": "SLC President since Feb 2019, now in 4th term. Called 'Betting Shammi' by Sports Minister Ranasinghe. Father Piyasena De Silva was manager of Sumathipala's Sporting Star.",
  "node:ashley": "SLC CEO for over a decade. Sits on LPL governing council. Oversees tournament operations including sponsor approvals.",
  "node:mohan": "SLC Secretary. Claimed 1xBat sponsorship was approved by Asia Cricket Council. Attended ICC Board meetings with Sumathipala.",
  "node:melbet": "1xBet sub-brand. Pelican Entertainment B.V., Curaçao #134359. Shares same IP, odds, and backend as 1xBet. Advertised on ThePapare/Dialog. Banned in India, UK, France, and others.",
  "node:1xbet": "Russian-founded, Cyprus HQ. ~1,800 affiliated sites on blacklists worldwide. 1xBat was official Sri Lanka Asia Cup 2023 sponsor. Founded by Semiokhin, Kazorin, Karshkov.",
  "node:wolf777": "Owner: Rakesh Rajdev (Gujarat/Dubai). GIT Operations NV, Curaçao. Ahmedabad Crime Branch lookout notice. ₹1,400 crore betting racket. Back-of-jersey sponsor for SL India Tour 2022.",
  "node:kheloyar": "Mahadev Book network. Operated by Saurabh Chandrakar + Mustaqim Ibrahim Kaskar (Dawood Ibrahim's brother). ₹300-500 crore investment. ₹200 crore daily turnover across 60 apps.",
  "node:crickex": "VB Digital N.V., Curaçao/Cyprus. Multiple fraud complaints. Robin Uthappa is brand ambassador. Accused of freezing winning accounts.",
  "node:stbet": "Sporting Times platform (est. 1956, founder Doug Thompson). STBet.com launched 2020. Curaçao licence 8047/JAZ. 1,000+ employees. Commonly confused with Sumathipala's Sporting Star — they are separate companies.",
  "node:skyfair": "LPL 2023 title sponsor. Sky Infotech N.V., Curaçao #152377. Named as 'illegal offshore betting website' by Justice Minister in Parliament.",
  "node:semiokhin": "1xBet co-founder. 'Bryansk billionaire.' Cypriot citizenship. On Russia's international wanted list. 63 billion rubles in illegal gambling.",
  "node:karshkov": "1xBet co-founder. Former head of Bryansk cybercrime unit (Russian MVD). Died June 2023 — 'anaphylactic shock' during routine Swiss medical exam. Age 42. On Russia's wanted list.",
  "node:dawood": "D-Company. Kheloyar operated in partnership with Mustaqim Ibrahim Kaskar (Dawood's brother). Protection money paid to D-Company and allegedly to Pakistan's ISI.",
  "node:rajdev": "Wolf777 owner. Gujarat/Dubai. Ahmedabad Crime Branch lookout. Nagpur police wanted (₹58 crore scam). ED found ₹170.70 crore through one fraudulent bank account.",
  "node:chandrakar": "Kheloyar/Mahadev Book operator. Arrested in Dubai on Interpol Red Corner Notice 2024. Paid protection to D-Company. ₹200 crore daily through 60 apps.",
  "node:wickremesinghe": "President (2022-2024). Fired Sports Minister Ranasinghe for dissolving SLC board. Effectively shielded Shammi Silva's administration.",
  "node:ranasinghe": "Sports Minister who called Silva 'Betting Shammi.' Dissolved SLC board. Was fired by Wickremesinghe from ALL ministerial positions.",
  "node:wijedasa": "Justice Minister. Named 15 illegal betting sites sponsoring LPL in Parliament (Aug 2023). Called Skyfair 'illegal offshore betting website.' Nothing happened.",
  "node:harin": "Sports Minister (2018-19, 2023-24). Banned Sumathipala from SLC. Passed match-fixing law. Reported bribery attempt. But also restored Silva board after Ranasinghe's removal.",
  "node:dissanayake": "Current President (NPP). Passed GRA Act 2025. Raised gaming tax to 45%. GRA operational June 2026. Focus on regulation, not prohibition.",
  "node:dialog": "Sri Lanka's largest telecom. Owns ThePapare. ICC broadcast rights until 2028. National team sponsor ($4.8M). Runs Melbet ads on ThePapare. Too powerful to challenge.",
  "node:ipg": "Indian-owned Dubai company. Holds LPL marketing, broadcast, franchise, and sponsorship rights since 2020. Controls who sponsors teams. Beyond Sri Lankan jurisdiction.",
  "node:papare": "Sri Lanka's leading cricket website. Owned by Dialog Axiata. Carries Melbet advertising. ICC broadcast partner's content arm promoting illegal betting.",
  "node:watson": "Australia. Melbet global ambassador (2021) AND Wolf777 ambassador (2023). Endorsed TWO illegal platforms targeting same markets simultaneously.",
  "node:raina": "India. 1xBet endorser. ED attached ₹6.64 crore in mutual funds. Alleged to have 'knowingly' signed deals with 1xBet foreign entities.",
  "node:dhawan": "India. 1xBet endorser. ED attached ₹4.5 crore in immovable property.",
  "node:yuvraj": "India. 1xBet endorser. ED attached ₹2.5 crore via YWC Health and Wellness Pvt. Ltd.",
  "node:uthappa": "India. Crickex brand ambassador AND 1xBet endorser. ED attached ₹8.26 lakh.",
  "node:pollard": "West Indies. 1xBet India ambassador (2-year deal). Featured on Delhi billboards and auto-rickshaw ads.",
  "node:bravo": "West Indies. FIRST 1xBet brand ambassador in India (Sep 2021). Full-page Times of India ads.",
  "node:iniesta": "Spain/Barcelona legend. Melbet global ambassador. 'The Greatest 8' campaign.",
  "node:babar": "Pakistan captain. REFUSED to wear betting logos on Colombo Strikers jersey. Appeared in blank jersey. Added 'no betting clause' to all contracts.",
  "node:rahman": "Dambulla Thunders owner. Pled guilty Jan 2026. 4-year suspended sentence + LKR 24M fine. First LPL franchise owner convicted.",
  "node:senanayake": "SL cricketer. Indicted June 2025 — first criminal prosecution. Approached player via WhatsApp during LPL 2020 to underperform. Failed to appear in court.",
  "node:jayasuriya": "SL legend. 2-year ICC ban (2019) for refusing to cooperate with ACU investigation.",
  "node:jayasundara": "SLC analyst. Charged by ICC for attempting to bribe Sports Minister Harin Fernando to influence match outcomes. Banned.",
  "node:curacao": "Caribbean island issuing bulk offshore gambling licences. Near-zero transparency on beneficial owners. Home jurisdiction for Melbet, 1xBet affiliates, Wolf777, Crickex, Skyfair, STBet, and Sporting Star (betss.com).",
  "node:cyprus": "1xBet HQ (Limassol). Payment processing for Melbet (Edric Ltd, Faren Ltd). Semiokhin and Kazorin hold Cypriot citizenship.",
  "node:dubai": "IPG headquarters. Chandrakar arrested here. Rajdev operates from here. Beyond Sri Lankan law enforcement reach.",
  "node:icc": "Suspended SLC for 'government interference' when Ranasinghe tried to clean house. Anti-Corruption Code prohibits gambling ties — never enforced against SLC. ACU had 22 live SL investigations.",
  "node:marshall": "ICC ACU head (retired). Deployed Steve Richardson to Colombo. Briefed SL President and PM on corruption depth. Called SL a 'good news story' — debatable.",
  "node:lpl": "Sri Lanka T20 franchise league — all 6 teams carried illegal offshore betting logos during 2022–23 seasons.",
  "node:dambulla": "LPL franchise owned by Tamim Rahman, who pleaded guilty to match-fixing and betting-related offences.",
  "node:colombo_kings": "LPL franchise — Melbet served as main shirt sponsor during the 2022 season.",
  "node:mahadev": "India's most-investigated illegal betting network — linked to SL cricketers via backend infrastructure shared with Kheloyar.",
  "node:molfar": "OSINT-confirmed IP infrastructure layer with overlap across 1xBet-affiliated operators in South Asia.",
  "node:india_ed": "India Enforcement Directorate — attached ₹19cr+ in assets from SL-linked cricketers endorsing illegal offshore platforms.",
  "node:zoysa": "Former SL fast bowler — ICC 6-year ban (2018) for approaching active players on behalf of a match-fixer during an ICC event.",
  "node:lokuhettige": "Former SL spinner — ICC 8-year ban (2019) for three counts of match-fixing including approaches during Champions League T20.",
  "node:tharanga": "Former SL ODI captain — suspended pending ICC ACU investigation into alleged contacts with illegal bookmakers.",
  "node:shanaka": "SL national team captain during T20 WC 2026 Super 8s — under post-match integrity scrutiny after shock elimination.",
  "node:mustaqim": "Identified D-Company associate — linked by investigators to Kheloyar's South Asia operations and financial flows.",
  "node:jayarathne": "SLC executive committee member — suspended as part of board-wide investigations covering 22+ active corruption cases.",
  "node:sporting_star": "Sumathipala family's actual bookmaking company (est. 1956, now betss.com). ICC investigation cited this specific business. Previously horse racing, now online sports betting.",
  "node:galle_fix": "2000s pitch-fixing scandal at Galle — the earliest modern marker of systemic vulnerability within Sri Lanka Cricket.",
  "link:sumathipala→stbet": "The Sumathipala family owns Sporting Star (est. 1956), which operates betss.com — NOT STBet.com. STBet is operated by Sporting Times, a separate company founded by Doug Thompson (per Tracxn records). Third-party review sites commonly conflate these two entities. The ICC ban cited Sporting Star specifically, not Sporting Times/STBet.",
  "link:sumathipala→shammi": "Shammi Silva's father Piyasena De Silva was manager at Sumathipala's Sporting Star bookmaking business. Silva rose to SLC presidency with Sumathipala's backing. Sports Minister Ranasinghe publicly called Silva 'Betting Shammi' in Parliament.",
  "link:sumathipala→slc": "Despite ICC ban from holding office, Sumathipala continues to influence SLC through installed proxies. ICC's own investigation confirmed this patronage network.",
  "link:shammi→slc": "Shammi Silva has been SLC President since Feb 2019, now serving 4th term. His tenure coincides with the largest proliferation of illegal betting sponsors in SLC history.",
  "link:ashley→slc": "Ashley de Silva served as CEO for over a decade. Sits on LPL governing council. All sponsor approvals go through his office.",
  "link:mohan→slc": "Mohan de Silva serves as SLC Secretary. He publicly claimed the '1xBat' Asia Cup sponsorship was approved by the Asian Cricket Council — a claim disputed by the ACC.",
  "link:mohan→sumathipala": "Both attended ICC Board meetings together. Nature of coordination documented in multiple Sri Lankan media reports.",
  "link:slc→1xbet": "'1xBat' (a rebrand of 1xBet to avoid Google ad policies) was the official sponsor of Sri Lanka's Asia Cup 2023 campaign. SLC Secretary Mohan de Silva confirmed the deal.",
  "link:slc→wolf777": "Wolf777 appeared on the back of Sri Lanka's national team jersey during the 2022 India tour. Jersey images widely circulated. Wolf777 owner Rakesh Rajdev is wanted by Indian police.",
  "link:slc→skyfair": "Skyfair was LPL 2023 title sponsor. Justice Minister Wijedasa Rajapaksa named it as an 'illegal offshore betting website' in Parliament in August 2023.",
  "link:slc→kheloyar": "Kheloyar sponsored LPL teams. The Mahadev Book network behind Kheloyar was operated in partnership with D-Company (Dawood Ibrahim's criminal network).",
  "link:slc→crickex": "Crickex sponsored LPL teams. Registered as VB Digital N.V. in Curaçao/Cyprus. Multiple consumer fraud complaints filed.",
  "link:slc→melbet": "Melbet advertised across SLC's digital ecosystem, primarily through ThePapare (owned by Dialog, SLC's main sponsor). Indirect but undeniable commercial relationship.",
  "link:1xbet→melbet": "Technical analysis shows Melbet shares the same IP infrastructure, odds feed, backend platform, and identical terms & conditions as 1xBet. Melbet is registered as Pelican Entertainment B.V. in Curaçao — a known 1xBet shell entity.",
  "link:1xbet→semiokhin": "Roman Semiokhin is a confirmed 1xBet co-founder. Russian media and court filings identify him. He holds Cypriot citizenship and is on Russia's international wanted list for illegal gambling (63 billion rubles).",
  "link:1xbet→karshkov": "Sergey Karshkov was a 1xBet co-founder and former head of Bryansk cybercrime unit. Died June 2023, age 42, from 'anaphylactic shock' during a routine Swiss medical exam. Circumstances widely considered suspicious.",
  "link:1xbet→curacao": "1xBet operates under Curaçao e-gaming licences through multiple shell companies.",
  "link:1xbet→cyprus": "1xBet's operational HQ is in Limassol, Cyprus. Payment processing entities (Edric Ltd, Faren Ltd) are Cyprus-registered.",
  "link:melbet→curacao": "Melbet operates under Curaçao licence #134359 through Pelican Entertainment B.V.",
  "link:melbet→cyprus": "Melbet's payment processing runs through Cyprus-registered entities shared with 1xBet.",
  "link:kheloyar→dawood": "VERIFIED by ED (Enforcement Directorate, India): Kheloyar was operated with Mustaqim Ibrahim Kaskar, brother of Dawood Ibrahim. Protection money was paid to D-Company. From official Indian law enforcement filings.",
  "link:kheloyar→chandrakar": "Saurabh Chandrakar arrested in Dubai on Interpol Red Corner Notice (2024). ED confirmed he operated the Mahadev Book network processing ₹200 crore daily through 60+ betting apps.",
  "link:chandrakar→dubai": "Chandrakar was arrested in Dubai based on Interpol Red Corner Notice issued at India's request.",
  "link:wolf777→rajdev": "Ahmedabad Crime Branch and Nagpur police have issued lookout notices for Rakesh Rajdev. ED traced ₹170.70 crore through a single fraudulent bank account linked to Wolf777.",
  "link:wolf777→curacao": "Wolf777 operates through GIT Operations N.V., registered in Curaçao.",
  "link:rajdev→dubai": "Rajdev operates from Dubai, beyond Indian extradition reach. Multiple Indian law enforcement agencies have pending cases.",
  "link:stbet→curacao": "STBet operates under Curaçao licence 8047/JAZ. Owned by Sporting Times — NOT Sporting Star/Sumathipala. The two entities are commonly but incorrectly conflated.",
  "link:dialog→papare": "Dialog Axiata owns ThePapare.com. Corporate records confirm full ownership.",
  "link:dialog→slc": "Dialog has a $4.8M sponsorship deal with SLC AND holds ICC broadcast rights in Sri Lanka until 2028. Dual commercial relationship creates massive conflict of interest.",
  "link:dialog→icc": "Dialog holds ICC broadcast rights in Sri Lanka until 2028.",
  "link:papare→melbet": "Melbet display ads ran on ThePapare.com. Screenshots documented by multiple observers. Dialog claims these are 'programmatic' (automated) ads.",
  "link:ipg→slc": "IPG (Dubai) holds LPL marketing, broadcast, franchise, and sponsorship rights since 2020. They control which sponsors appear on team jerseys.",
  "link:ipg→dubai": "IPG is Dubai-based, placing it beyond Sri Lankan jurisdiction for accountability.",
  "link:wickremesinghe→shammi": "When Sports Minister Ranasinghe dissolved the SLC board, President Wickremesinghe fired Ranasinghe from ALL ministries and effectively reinstated the Silva-led board.",
  "link:wickremesinghe→ranasinghe": "Wickremesinghe fired Ranasinghe from all ministerial positions after he dissolved SLC board and called Silva 'Betting Shammi.' Widely reported in all Sri Lankan media.",
  "link:wickremesinghe→harin": "Harin Fernando was appointed as replacement Sports Minister after Ranasinghe's firing.",
  "link:ranasinghe→shammi": "Ranasinghe dissolved the SLC board and publicly called Silva 'Betting Shammi' in Parliament. Parliamentary Hansard records exist.",
  "link:harin→sumathipala": "During his 2018-19 tenure, Fernando successfully pushed for Sumathipala's ban from SLC office, working with ICC.",
  "link:harin→shammi": "Fernando restored the Silva board after being appointed following Ranasinghe's removal. Whether this was pragmatic (avoiding ICC suspension) or accommodating is debated.",
  "link:harin→icc": "Fernando negotiated with ICC to lift SLC's suspension by meeting their conditions for governance reforms.",
  "link:harin→jayasundara": "Fernando reported a bribery attempt by SLC analyst Jayasundara to the ICC ACU. Jayasundara was subsequently charged and banned.",
  "link:wijedasa→skyfair": "Justice Minister Wijedasa Rajapaksa named Skyfair and 14 other illegal betting sites sponsoring LPL in a Parliamentary speech, August 2023. Hansard records exist. No legal action followed.",
  "link:dissanayake→slc": "The NPP government passed the Gaming Regulatory Authority Act 2025 and raised gaming tax to 45%. GRA expected operational by June 2026.",
  "link:icc→slc": "ICC suspended SLC for 'government interference' when Ranasinghe tried to clean up. ACU had 22 live investigations into Sri Lankan cricket corruption.",
  "link:marshall→icc": "Alex Marshall served as ICC ACU General Manager before retirement. He deployed Steve Richardson to Colombo for investigations.",
  "link:marshall→slc": "Marshall briefed the Sri Lankan President and PM on the depth of corruption in Sri Lankan cricket.",
  "link:watson→melbet": "Shane Watson served as Melbet's global brand ambassador (2021 campaign). Promotional materials widely available.",
  "link:watson→wolf777": "Watson also endorsed Wolf777 (2023). Same person endorsing TWO illegal betting platforms targeting overlapping markets.",
  "link:raina→1xbet": "ED (Enforcement Directorate) attached ₹6.64 crore of Raina's mutual fund holdings. Raina allegedly 'knowingly' signed endorsement deals with 1xBet foreign entities.",
  "link:dhawan→1xbet": "ED attached ₹4.5 crore in Dhawan's immovable property linked to 1xBet endorsement earnings.",
  "link:yuvraj→1xbet": "ED attached ₹2.5 crore via YWC Health and Wellness Pvt. Ltd., a company linked to Yuvraj Singh.",
  "link:uthappa→crickex": "Robin Uthappa has been Crickex's brand ambassador. Promotional videos and social media posts confirm.",
  "link:uthappa→1xbet": "Uthappa also endorsed 1xBet. ED attached ₹8.26 lakh in his assets.",
  "link:pollard→1xbet": "Kieron Pollard signed a 2-year deal as 1xBet India ambassador. Featured on Delhi billboards and auto-rickshaw wraps.",
  "link:bravo→1xbet": "Dwayne Bravo was the FIRST 1xBet brand ambassador in India (September 2021). Full-page Times of India advertisements documented.",
  "link:iniesta→melbet": "Andrés Iniesta served as Melbet global ambassador in 'The Greatest 8' campaign.",
  "link:babar→kheloyar": "Babar Azam refused to wear Kheloyar logo on Colombo Strikers jersey during LPL. Appeared in a blank jersey. Added 'no betting company' clause to all contracts.",
  "link:rahman→slc": "Tamim Rahman, Dambulla Thunders owner, pled guilty January 2026. 4-year suspended sentence + LKR 24M fine. First LPL franchise owner convicted.",
  "link:senanayake→slc": "Sachithra Senanayake indicted June 2025 — first criminal prosecution of a Sri Lankan cricketer for match-fixing. Accused of approaching a player via WhatsApp during LPL 2020.",
  "link:jayasuriya→slc": "Sanath Jayasuriya received a 2-year ICC ban (2019) for refusing to cooperate with ACU anti-corruption investigation.",
  "link:crickex→curacao": "Crickex operates through VB Digital N.V., registered in Curaçao.",
  "link:skyfair→curacao": "Skyfair operates through Sky Infotech N.V., Curaçao #152377.",
  "link:lpl→slc": "Lanka Premier League franchises operate under Sri Lanka Cricket's governance structure. SLC controls broadcasting rights, franchise licensing, and player availability contracts.",
  "link:lpl→stbet": "STBet was named LPL title sponsor for the 2023 season. NOTE: STBet is operated by Sporting Times (Doug Thompson), NOT by the Sumathipala family's Sporting Star. The conflict-of-interest narrative requires further verification.",
  "link:lpl→melbet": "Melbet sponsored multiple LPL team jerseys during 2022–23 seasons despite being classified as an unlicensed offshore operator in Sri Lanka.",
  "link:lpl→1xbet": "The 1xBat logo (1xBet sub-brand) appeared across all 6 LPL franchise team jerseys during the 2022 season — the most pervasive single-operator penetration in the tournament.",
  "link:dambulla→lpl": "Dambulla Thunders is one of the original six Lanka Premier League franchises.",
  "link:dambulla→rahman": "Tamim Rahman owned the Dambulla Thunders franchise and pleaded guilty to match-fixing and illegal betting offences — the first LPL franchise owner to be convicted.",
  "link:colombo_kings→lpl": "Colombo Kings is one of the six LPL franchise teams.",
  "link:colombo_kings→melbet": "Melbet was the main shirt sponsor of Colombo Kings during the LPL 2022 season.",
  "link:mahadev→kheloyar": "India Enforcement Directorate investigation documents note shared technical infrastructure between Mahadev Book and Kheloyar's South Asia operations.",
  "link:mahadev→india_ed": "The Mahadev Book betting network is the primary target of India's ED multi-state crackdown. Multiple operators have been arrested and assets attached.",
  "link:india_ed→yuvraj": "India ED attached ₹6.64 crore in assets from Yuvraj Singh linked to endorsement contracts with a 1xBet-affiliated platform.",
  "link:india_ed→dhawan": "India ED attached ₹4.5 crore in assets from Shikhar Dhawan linked to an affiliated offshore betting platform.",
  "link:india_ed→uthappa": "India ED attached ₹2.5 crore in assets from Robin Uthappa linked to endorsement of an offshore gambling operator.",
  "link:india_ed→1xbet": "1xBet and its affiliate platforms are under active India ED jurisdiction, with multiple assets attached across promotional networks.",
  "link:molfar→1xbet": "OSINT analysis by Molfar confirmed IP address and infrastructure overlaps between 1xBet-branded operations and affiliated operators across South Asia.",
  "link:mustaqim→dawood": "Mustaqim Ibrahim Kaskar is an identified associate of the Dawood Ibrahim D-Company criminal network, confirmed in law enforcement documentation.",
  "link:mustaqim→kheloyar": "Investigators have linked Mustaqim Kaskar to financial flows connected to Kheloyar's South Asia betting operations.",
  "link:zoysa→icc": "ICC handed Nuwan Zoysa a 6-year ban in 2018 for approaching an undercover operative and attempting to fix aspects of a match on behalf of a named fixer.",
  "link:zoysa→slc": "Zoysa used his access as a former SLC-contracted player to approach active national squad members on behalf of match-fixers.",
  "link:lokuhettige→icc": "ICC banned Dilhara Lokuhettige for 8 years in 2019 following three proven counts of match-fixing including approaches during the Champions League T20.",
  "link:lokuhettige→galle_fix": "Lokuhettige's connections trace back to the broader Galle-era fixing network that first exposed systemic vulnerabilities in SLC.",
  "link:tharanga→slc": "Upul Tharanga served as Sri Lanka ODI captain and was suspended by Sri Lanka Cricket pending an ICC ACU investigation.",
  "link:tharanga→icc": "ICC ACU opened formal investigation into Upul Tharanga following intelligence about alleged contacts with illegal bookmakers.",
  "link:shanaka→slc": "Dasun Shanaka captained the Sri Lanka national team from 2022, including the T20 World Cup 2026 campaign that ended in Super 8s elimination.",
  "link:jayarathne→slc": "Jerome Jayarathne served on the SLC executive committee and was among officials suspended as part of board-wide investigations into 22+ corruption cases.",
  "link:sporting_star→sumathipala": "Sporting Star is owned by the Sumathipala family via 'U.W. Sumathipala and Sons' (Inland Revenue Dept registration). ICC Ethics investigation explicitly named Sporting Star as the bookmaking business. UK bookmaker Glyn Palmer testified to ICC ACU about helping establish it. Now operates online as betss.com.",
  "link:sporting_star→curacao": "betss.com (Sporting Star) is listed with an offshore gaming licence. Jurisdiction details match Curaçao sub-licence structure.",
  "link:galle_fix→slc": "The Galle pitch-fixing scandal of the early 2000s was the first major documented case of systemic integrity failure within Sri Lanka Cricket, establishing patterns that persisted for two decades."
}