{
  "Political Research Dossier": "දේශපාලන පර්යේෂණ ලේඛනය",
  "The Death of Sri Lankan Cricket": "ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාවේ මළගම",
  "How political patronage, a &quot;cricket mafia&quot;, toxic fan culture, and systemic institutional rot destroyed a once-proud cricketing nation — and why the new government appears powerless to fix it.": "දේශපාලන අනුග්‍රහය, \"ක්‍රිකට් මාෆියාවක්\", විෂ සහිත රසික සංස්කෘතිය සහ පද්ධතිමය ආයතනික කුණුවීම, වරක් ආඩම්බර ක්‍රිකට් ජාතියක් විනාශ කළ ආකාරය - සහ නව රජය එය නිවැරදි කිරීමට බල රහිත බව පෙනෙන්නේ මන්ද යන්නයි.",
  "February 27, 2026": "2026 පෙබරවාරි 27",
  "T20 World Cup 2026 — Super 8s Elimination": "2026 T20 ලෝක කුසලානය — සුපිරි 8 වටයේ පරාජය",
  "Deep Analysis": "ගැඹුරු විශ්ලේෂණය",
  "Visitors today": "අද අමුත්තන්",
  "Total visits": "මුළු පැමිණීම්",
  "Comments": "අදහස්",
  "Status": "තත්ත්වය",
  "The Match": "තරගය",
  "The Mafia": "මාෆියාව",
  "Conspiracy Board": "කුමන්ත්‍රණ මණ්ඩලය",
  "Power Network": "බල ජාලය",
  "Elitism Paradox": "ප්‍රභූවාදයේ විරුද්ධාභාසය",
  "Fan Toxicity": "විදුලි පංකා විෂ වීම",
  "Player Crisis": "ක්‍රීඩක අර්බුදය",
  "NPP & Reform": "NPP සහ ප්‍රතිසංස්කරණ",
  "Restructuring": "ප්‍රතිව්‍යුහගත කිරීම",
  "Game Theory": "ක්‍රීඩා න්‍යාය",
  "Skills Gap": "කුසලතා පරතරය",
  "BCCI/IPL Axis": "BCCI/IPL අක්ෂය",
  "Calendar Crisis": "දින දර්ශන අර්බුදය",
  "Hidden Insights": "සැඟවුණු තීක්ෂ්ණ බුද්ධිය",
  "01 — The Catalyst": "01 — උත්ප්‍රේරකය",
  "A Familiar Collapse on Home Soil": "ගෙදර බිමක හුරුපුරුදු කඩා වැටීමක්",
  "Sri Lanka's elimination from their own World Cup wasn't just a bad day — it was the logical conclusion of a decade of institutional decay.": "ශ්‍රී ලංකාව තමන්ගේම ලෝක කුසලානයෙන් ඉවත් වීම නරක දවසක් පමණක් නොවේ - එය දශකයක ආයතනික පරිහානියේ තාර්කික අවසානය ද විය.",
  "SL Score (20 ov)": "ශ්‍රී ලංකා ලකුණු (ඕවර 20)",
  "NZ Score (20 ov)": "නවසීලන්ත ලකුණු (ඕවර 20)",
  "Ravindra's Figures": "රවීන්ද්‍රගේ චරිත",
  "Nissanka — First Ball": "නිශ්ශංක — පළමු පන්දුව",
  "What Actually Happened": "ඇත්තටම සිදුවූ දේ",
  "Sri Lanka won the toss and did well to reduce New Zealand to 84/6 — then inexplicably lost control. Mitchell Santner (47 off 26 balls, 4 sixes) and Cole McConchie (31* off 23) added 84 for the 7th wicket, a partnership that exposed Sri Lanka's inability to close out innings. This isn't bad luck — it's a structural inability to think under pressure, to adapt bowling plans, and to maintain intensity when the game shifts.": "කාසියේ වාසිය දිනාගත් ශ්‍රී ලංකාව නවසීලන්තය ලකුණු 84/6 දක්වා අඩු කිරීමට හොඳින් කටයුතු කළ අතර පසුව ඔවුන්ට පාලනය අහිමි විය. මිචෙල් සැන්ට්නර් (පන්දු 26 කින් ලකුණු 47 ක්, හයේ පහර 4 ක්) සහ කෝල් මැකොන්චි (පන්දු 23 කින් ලකුණු 31 *) 7 වන කඩුල්ලට ලකුණු 84 ක් එක් කළ අතර, එය ශ්‍රී ලංකාවේ ඉනිම අවසන් කිරීමට ඇති නොහැකියාව හෙළි කළ හවුල්කාරිත්වයකි. මෙය අවාසනාවක් නොවේ - පීඩනය යටතේ සිතීමට, පන්දු යැවීමේ සැලසුම් අනුවර්තනය කිරීමට සහ ක්‍රීඩාව මාරු වන විට තීව්‍රතාවය පවත්වා ගැනීමට ඇති ව්‍යුහාත්මක නොහැකියාවකි.",
  "In reply, Pathum Nissanka was bowled off the first ball by Matt Henry. The psychological collapse that followed — 107/8 in 20 overs — was not the disease but the symptom. Rachin Ravindra, a part-time left-arm spinner, took 4/27. A side that once produced Murali, Vaas, and Malinga was dismantled by a bowler who isn't even New Zealand's primary spinner.": "පිළිතුරු වශයෙන්, පැතුම් නිශ්ශංක පළමු පන්දුවෙන්ම මැට් හෙන්රි විසින් දැවී ගියේය. ඉන් පසුව ඇති වූ මානසික බිඳවැටීම - ඕවර 20 කදී 107/8 - රෝගය නොව රෝග ලක්ෂණයයි. අර්ධකාලීන වමත් දඟ පන්දු යවන්නෙකු වන රචින් රවීන්ද්‍ර, 4/27 ලබා ගත්තේය. මුරලි, වාස් සහ මාලිංග බිහි කළ කණ්ඩායමක් නවසීලන්තයේ ප්‍රධාන දඟ පන්දු යවන්නා නොවන පන්දු යවන්නෙකු විසින් බිඳ දමන ලදී.",
  "Disappointing home fans is truly shameful. T20 thrives on boldness — safe cricket doesn't win, and we lacked that fire.": "අපේ රටේ රසිකයන් කලකිරීමට පත් කිරීම ඇත්තෙන්ම ලැජ්ජාවට කරුණක්. විස්සයි20 ක්‍රීඩාව දියුණු වෙන්නේ නිර්භීතකම මතයි - ආරක්ෂිත ක්‍රිකට් දිනන්නේ නැහැ, ඒ වගේම අපිට ඒ ගින්න තිබුණේ නැහැ.",
  "— Dasun Shanaka, Captain, post-match": "- දසුන් ශානක, නායක, තරගයෙන් පසු",
  "Beyond the Lonthayas Logic": "ලොන්තයාස් තර්කයෙන් ඔබ්බට",
  "The easy narrative is that these players simply aren't good enough — the \\\"Lonthayas\\\" accusation. But the truth is more uncomfortable: many of these players perform brilliantly in franchise leagues (IPL, LPL). The problem isn't raw talent — it's the ecosystem they return to. A corrupt administration, zero analytical support, chaotic selection, and a fan culture that destroys confidence rather than building it. The rot isn't on the pitch. It's everything around it.": "පහසු කතාව නම් මෙම ක්‍රීඩකයින් ප්‍රමාණවත් තරම් දක්ෂ නොවන බවයි - \"ලොන්තයාස්\" චෝදනාව. නමුත් සත්‍යය වඩාත් අපහසුයි: මෙම ක්‍රීඩකයින්ගෙන් බොහෝ දෙනෙක් ෆ්‍රැන්චයිස් ලීගවල (IPL, LPL) විශිෂ්ට ලෙස දස්කම් දක්වයි. ගැටලුව අමු දක්ෂතා නොවේ - එය ඔවුන් නැවත පැමිණෙන පරිසර පද්ධතියයි. දූෂිත පරිපාලනයක්, ශුන්‍ය විශ්ලේෂණාත්මක සහාය, අවුල් සහගත තේරීමක් සහ විශ්වාසය ගොඩනැගීමට වඩා එය විනාශ කරන රසික සංස්කෘතියක්. කුණුවීම තණතීරුවේ නොවේ. එය වටා ඇති සියල්ලයි.",
  "02 — The Cricket Mafia": "02 — ක්‍රිකට් මාෆියාව",
  "How SLC Became the Most Corrupt Board in World Cricket": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනය ලෝක ක්‍රිකට් ඉතිහාසයේ දූෂිතම මණ්ඩලය බවට පත් වූ ආකාරය",
  "The ICC's own anti-corruption chief stated that Sri Lanka has &quot;more corruption investigations than anywhere else.&quot; A permanent ICC Anti-Corruption Unit office was established in Colombo — the only country to receive this level of scrutiny.": "ICC දූෂණ විරෝධී ප්‍රධානියාම ප්‍රකාශ කළේ ශ්‍රී ලංකාවේ \"වෙනත් ඕනෑම තැනකට වඩා දූෂණ විමර්ශන වැඩි\" බවයි. මෙම මට්ටමේ පරීක්ෂාවට ලක් වූ එකම රට වන කොළඹ දී ස්ථිර ICC දූෂණ විරෝධී ඒකක කාර්යාලයක් ස්ථාපිත කරන ලදී.",
  "Shammi Silva's Consecutive Terms": "ෂම්මි සිල්වාගේ අඛණ්ඩ කොන්දේසි",
  "Times Elected Uncontested": "නිතරගයෙන් තේරී පත් වූ වාර ගණන",
  "Permanent ICC Anti-Corruption Office (Only in SL)": "ICC දූෂණ විරෝධී ස්ථිර කාර්යාලය (ශ්‍රී ලංකාවේ පමණි)",
  "Renowned Cricketers on Current Board": "වත්මන් ක්‍රිකට් මණ්ඩලයේ සිටින ප්‍රසිද්ධ ක්‍රිකට් ක්‍රීඩකයින්",
  "The Patronage Machine": "අනුග්‍රාහක යන්ත්‍රය",
  "Sri Lanka Cricket doesn't function as a sports governing body — it functions as a political patronage network. The SLC presidency is a stepping stone to political power and a distribution mechanism for TV rights money, sponsorship deals, and touring contracts. The current president, Shammi Silva, has held office since 2019 and was re-elected uncontested for his fourth term in March 2025. He simultaneously serves as Asian Cricket Council (ACC) President.": "ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩා පාලක මණ්ඩලයක් ලෙස ක්‍රියා නොකරයි - එය දේශපාලන අනුග්‍රාහක ජාලයක් ලෙස ක්‍රියා කරයි. ශ්‍රී ලංකා ක්‍රිකට් සභාපතිත්වය දේශපාලන බලයට පියවරක් වන අතර රූපවාහිනී අයිතිවාසිකම් මුදල්, අනුග්‍රාහක ගනුදෙනු සහ සංචාරක කොන්ත්‍රාත්තු සඳහා බෙදා හැරීමේ යාන්ත්‍රණයකි. වත්මන් සභාපති ෂම්මි සිල්වා 2019 සිට ධුරය හෙබවූ අතර 2025 මාර්තු මාසයේදී ඔහුගේ සිව්වන වාරය සඳහා නිතරගයෙන් නැවත තේරී පත් විය. ඔහු ඒ සමඟම ආසියානු ක්‍රිකට් කවුන්සිලයේ (ACC) සභාපතිවරයා ලෙසද කටයුතු කරයි.",
  "The mechanism is straightforward: SLC affiliates (cricket clubs) have voting rights in elections. These clubs are often paper entities controlled by politicians or business interests. By controlling enough clubs, a candidate can guarantee re-election without genuine competition. This is why Silva has been elected uncontested three times — not because he's universally popular, but because the voting structure is captured.": "යාන්ත්‍රණය සරලයි: ශ්‍රී ලංකා ක්‍රිකට් අනුබද්ධිත ආයතන (ක්‍රිකට් සමාජ) මැතිවරණවලදී ඡන්ද අයිතිය ලබා ගනී. මෙම සමාජ බොහෝ විට දේශපාලනඥයින් හෝ ව්‍යාපාරික අවශ්‍යතා විසින් පාලනය කරනු ලබන කඩදාසි ආයතන වේ. ප්‍රමාණවත් සමාජ පාලනය කිරීමෙන්, අපේක්ෂකයෙකුට සැබෑ තරඟයකින් තොරව නැවත තේරී පත්වීම සහතික කළ හැකිය. සිල්වා තුන් වතාවක් නිතරගයෙන් තේරී පත් වී ඇත්තේ මේ නිසාය - ඔහු විශ්වීය වශයෙන් ජනප්‍රිය නිසා නොව, ඡන්ද ව්‍යුහය අල්ලාගෙන ඇති නිසා.",
  "The board is stacked with political loyalists rather than cricket experts. Public commentators have noted that &quot;not a single renowned Sri Lankan cricketer is on the new board.&quot; Former cricketers who could reform the system &quot;are reluctant to come forward due to corruption in this institution.&quot;": "ක්‍රිකට් විශේෂඥයින්ගෙන් නොව දේශපාලන පක්ෂපාතීත්වයෙන් මණ්ඩලය පිරී ඇත. \"නව මණ්ඩලයේ එක ප්‍රසිද්ධ ශ්‍රී ලාංකික ක්‍රිකට් ක්‍රීඩකයෙකුවත් නොමැති\" බව මහජන විචාරකයින් සඳහන් කර ඇත. පද්ධතිය ප්‍රතිසංස්කරණය කළ හැකි හිටපු ක්‍රිකට් ක්‍රීඩකයින් \"මෙම ආයතනයේ දූෂණය හේතුවෙන් ඉදිරියට පැමිණීමට මැලි වෙති.\"",
  "Critical Finding": "තීරණාත්මක සොයා ගැනීම්",
  "The ICC Auditor General found serious irregularities in SLC's accounts between 2016 and 2022. Money from TV rights could not be traced. SLC issued statements about a $2 million transfer from its accounts, claiming &quot;operational expenses,&quot; but no detailed accounting was provided.": "2016 සහ 2022 අතර කාලය තුළ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ගිණුම්වල බරපතල අක්‍රමිකතා සිදුවී ඇති බව ICC විගණකාධිපතිවරයා සොයා ගත්තේය. රූපවාහිනී අයිතිවාසිකම්වලින් ලැබුණු මුදල් සොයා ගැනීමට නොහැකි විය. \"මෙහෙයුම් වියදම්\" යනුවෙන් පවසමින් ශ්‍රී ලංකා ක්‍රිකට් ආයතනය තම ගිණුම්වලින් ඩොලර් මිලියන 2 ක හුවමාරුවක් පිළිබඳ ප්‍රකාශ නිකුත් කළ නමුත් සවිස්තරාත්මක ගිණුම්කරණයක් ලබා දී නොමැත.",
  "The Corruption Timeline": "දූෂණ කාලරේඛාව",
  "Galle Pitch-Fixing Scandal": "ගාල්ලේ තණතීරු පාවාදීමේ අපකීර්තිය",
  "Al Jazeera released hidden-camera footage of Galle stadium staff agreeing to fix pitches for Test matches involving India and England.": "ඉන්දියාව සහ එංගලන්තය අතර ටෙස්ට් තරඟ සඳහා තණතීරු සකස් කිරීමට එකඟ වූ ගාල්ල ක්‍රීඩාංගණ කාර්ය මණ්ඩලයේ සැඟවුණු කැමරා දර්ශන අල් ජසීරා නාලිකාව නිකුත් කළේය.",
  "Sanath Jayasuriya Banned": "සනත් ජයසූරියට තහනමක්",
  "The cricket legend was banned by the ICC for refusing to cooperate with an anti-corruption investigation — the same person who is now the head coach.": "දූෂණ විරෝධී පරීක්ෂණයකට සහයෝගය දැක්වීම ප්‍රතික්ෂේප කිරීම හේතුවෙන් ක්‍රිකට් පුරාවෘත්තයට ICC විසින් තහනමක් පනවන ලදී - දැන් ප්‍රධාන පුහුණුකරු ලෙස කටයුතු කරන පුද්ගලයාම ඔහුය.",
  "Zoysa & Lokuhettige Bans": "සොයිසා සහ ලොකුහෙට්ටිගේ තහනම්",
  "Nuwan Zoysa (6 years) and Dilhara Lokuhettige (8 years) banned for match-fixing in T10 League.": "T10 ලීග් තරගාවලියේදී තරග පාවාදීම සම්බන්ධයෙන් නුවන් සොයිසා (අවුරුදු 6) සහ දිල්හාර ලොකුහෙට්ටිගේ (අවුරුදු 8) තහනම් කරන ලදී.",
  "Government Intervenes, ICC Suspends": "රජය මැදිහත් වෙයි, ICC අත්හිටුවයි",
  "Sports Minister Ranasinghe removes entire SLC board, calls them &quot;traitorous and corrupt.&quot; ICC immediately suspends Sri Lanka for government interference — becoming the first full member suspended for this reason.": "ක්‍රීඩා අමාත්‍ය රණසිංහ සමස්ත ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලයම ඉවත් කරමින් ඔවුන්ව \"ද්‍රෝහී සහ දූෂිත\" ලෙස හඳුන්වයි. රජයේ මැදිහත්වීම් හේතුවෙන් ICC වහාම ශ්‍රී ලංකාව අත්හිටුවයි - මේ හේතුව නිසා අත්හිටුවන ලද පළමු පූර්ණ සාමාජිකයා බවට පත්වෙමින්.",
  "Court Restores Board": "අධිකරණය මණ්ඩලය ප්‍රතිෂ්ඨාපනය කරයි",
  "Courts overturn the government's removal. ICC lifts suspension. The &quot;mafia&quot; survives intact.": "රජයේ ඉවත් කිරීම අධිකරණ විසින් අවලංගු කරන ලදී. ICC අත්හිටුවීම ඉවත් කරයි. \"මාෆියාව\" නොවෙනස්ව පවතී.",
  "Jayawickrama Charged": "ජයවික්‍රමට චෝදනා එල්ල වේ",
  "Spinner Praveen Jayawickrama (25) charged by ICC for failing to report approaches from bookies to fix LPL games.": "LPL තරඟ පාවාදීම සඳහා බුකීකරුවන්ගේ ප්‍රවේශයන් වාර්තා නොකිරීම සම්බන්ධයෙන් දඟ පන්දු යවන ක්‍රීඩක ප්‍රවීන් ජයවික්‍රම (25) ICC ය විසින් චෝදනා එල්ල කර ඇත.",
  "Silva Returns — Again": "සිල්වා නැවත පැමිණේ - නැවතත්",
  "Shammi Silva re-elected uncontested for 4th term. Critics call it &quot;Shammi and Team Mafia.&quot; Allegations surface of board members &quot;backed by the underworld and drug dealers.&quot;": "ෂම්මි සිල්වා 4 වන වරටත් නිතරගයෙන් තේරී පත් විය. විචාරකයින් එය \"ෂම්මි සහ කණ්ඩායම් මාෆියාව\" ලෙස හඳුන්වයි. \"පාතාල ලෝකය සහ මත්ද්‍රව්‍ය ජාවාරම්කරුවන්ගේ සහාය ඇතිව\" අධ්‍යක්ෂ මණ්ඩල සාමාජිකයින්ගේ චෝදනා මතුපිට.",
  "The Sumathipala-Ranatunga War": "සුමතිපාල-රණතුංග යුද්ධය",
  "The original power struggle that defined SLC's modern corruption era was between four-time president Thilanga Sumathipala and 1996 World Cup-winning captain Arjuna Ranatunga. Sumathipala accused Ranatunga and Aravinda de Silva of being &quot;the first Sri Lankans to take bribes from bookies.&quot; Ranatunga countered by accusing Sumathipala of violating ICC regulations due to his family's connections to the gambling industry.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ නූතන දූෂණ යුගය නිර්වචනය කළ මුල් බල අරගලය වූයේ සිව් වතාවක් සභාපති තිලංග සුමතිපාල සහ 1996 ලෝක කුසලානය දිනූ නායක අර්ජුන රණතුංග අතර ය. රණතුංග සහ අරවින්ද ද සිල්වා \"බුකීකරුවන්ගෙන් අල්ලස් ගත් පළමු ශ්‍රී ලාංකිකයන්\" බවට සුමතිපාල චෝදනා කළේය. සූදු කර්මාන්තයට තම පවුලේ සම්බන්ධතා හේතුවෙන් සුමතිපාල ICC රෙගුලාසි උල්ලංඝනය කළ බවට රණතුංග චෝදනා කළේය.",
  "This war wasn't about cleaning up cricket — it was about who controls the patronage. Both sides used cricket governance as a vehicle for political influence and financial gain. The lesson the system learned was that cricket boards are too valuable as political instruments to be reformed — they must be captured.": "මෙම යුද්ධය ක්‍රිකට් පිරිසිදු කිරීම ගැන නොවේ - එය අනුග්‍රහය පාලනය කරන්නේ කවුද යන්න ගැන ය. දෙපාර්ශ්වයම ක්‍රිකට් පාලනය දේශපාලන බලපෑම් සහ මූල්‍ය වාසි සඳහා වාහනයක් ලෙස භාවිතා කළහ. පද්ධතිය ඉගෙන ගත් පාඩම නම් ක්‍රිකට් මණ්ඩල ප්‍රතිසංස්කරණය කළ නොහැකි දේශපාලන මෙවලම් ලෙස ඉතා වටිනා බවයි - ඒවා අල්ලා ගත යුතුය.",
  "The Self-Protecting System": "ස්වයං ආරක්ෂක පද්ධතිය",
  "The ICC's rules against government interference create a paradox: the one entity powerful enough to reform a corrupt board (the government) is prohibited from doing so. This means a captured board can perpetuate itself indefinitely, as long as it maintains formal compliance with ICC governance rules. The &quot;mafia&quot; doesn't just benefit from this rule — it weaponises it. When the 2023 government tried to intervene, Silva immediately petitioned the courts and the ICC stepped in. The corrupt board was restored within days, using the very governance rules designed to protect cricket.": "රජයේ මැදිහත්වීම් වලට එරෙහිව ICC හි නීති රීති මගින් විරුද්ධාභාසයක් නිර්මාණය වේ: දූෂිත මණ්ඩලයක් (රජය) ප්‍රතිසංස්කරණය කිරීමට තරම් බලවත් එකම ආයතනයට එසේ කිරීම තහනම්ය. මෙයින් අදහස් කරන්නේ අල්ලා ගන්නා ලද මණ්ඩලයකට ICC පාලන නීතිවලට විධිමත් අනුකූලතාවයක් පවත්වා ගන්නා තාක් කල්, දින නියමයක් නොමැතිව එය පවත්වාගෙන යා හැකි බවයි. \"මාෆියාව\" මෙම රීතියෙන් ප්‍රතිලාභ ලබනවා පමණක් නොව - එය එය ආයුධයක් බවට පත් කරයි. 2023 රජය මැදිහත් වීමට උත්සාහ කළ විට, සිල්වා වහාම අධිකරණයට පෙත්සමක් ඉදිරිපත් කළ අතර ICC මැදිහත් විය. ක්‍රිකට් ආරක්ෂා කිරීම සඳහා නිර්මාණය කර ඇති පාලන නීති භාවිතා කරමින් දූෂිත මණ්ඩලය දින කිහිපයක් ඇතුළත ප්‍රතිසංස්කරණය කරන ලදී.",
  "03 — The Power Map": "03 — බල සිතියම",
  "Stakeholder Conspiracy Board": "කොටස්කරුවන්ගේ කුමන්ත්‍රණ මණ්ඩලය",
  "A mapping of the key players, power dynamics, and interconnections that define Sri Lanka Cricket&apos;s governance crisis. The board below summarises the primary stakeholders — for the full": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ පාලන අර්බුදය නිර්වචනය කරන ප්‍රධාන ක්‍රීඩකයින්, බල ගතිකය සහ අන්තර් සම්බන්ධතා සිතියම්ගත කිරීම. පහත මණ්ඩලය ප්‍රාථමික කොටස්කරුවන් සාරාංශ කරයි - සම්පූර්ණයෙන්",
  "including financial flows and cross-institutional links, see the standalone analysis.": "මූල්‍ය ප්‍රවාහ සහ ආයතන අතර සම්බන්ධතා ඇතුළුව, ස්වාධීන විශ්ලේෂණය බලන්න.",
  "Full Power Network — Section 04 ↓": "සම්පූර්ණ බල ජාලය — කොටස 04 ↓",
  "Interactive diagram — SLC patronage flows, political entanglements, financial linkages, and cross-institutional capture": "අන්තර්ක්‍රියාකාරී රූප සටහන — ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ අනුග්‍රහක ප්‍රවාහ, දේශපාලනික පැටලීම්, මූල්‍ය සම්බන්ධතා සහ ආයතන අතර ග්‍රහණය",
  "SLC Power Dynamics &amp; Stakeholder Map — Feb 2026": "SLC බල ගතිකය සහ කොටස්කරුවන්ගේ සිතියම — 2026 පෙබරවාරි",
  "Tier 1 — The Power Center": "1 වන ස්ථරය - බල මධ්‍යස්ථානය",
  "SLC President (4th Term)": "ශ්‍රී ලංකා ක්‍රිකට් සභාපති (4 වන වාරය)",
  "Elected uncontested 3 times. Also ACC President. Controls club voting structure. Called &quot;godfather of cricket mafia.&quot;": "තුන් වතාවක් නිතරගයෙන් තේරී පත් විය. ACC සභාපති ද වේ. සමාජ ඡන්ද ව්‍යුහය පාලනය කරයි. \"ක්‍රිකට් මාෆියාවේ ගෝඩ් ෆාදර්\" ලෙස හැඳින්වේ.",
  "Board of Directors": "අධ්යක්ෂක මණ්ඩලය",
  "Bandula Dissanayake (Secretary), Sujeewa Godaliyadda (Treasurer). Zero renowned cricketers. Political appointees.": "බන්දුල දිසානායක (ලේකම්), සුජීව ගොඩලියද්ද (භාණ්ඩාගාරික). කීර්තිමත් ක්‍රිකට් ක්‍රීඩකයින් ශුන්‍යයි. දේශපාලන පත්වීම් ලැබූවන්.",
  "Voting Bloc": "ඡන්ද කොට්ඨාශය",
  "~150 clubs with voting rights. Many are paper entities controlled by political interests. The mechanism of perpetual re-election.": "ඡන්ද අයිතිය සහිත සමාජ ශාලා ~150ක්. බොහෝ ඒවා දේශපාලන අවශ්‍යතා මගින් පාලනය වන කඩදාසි ආයතන වේ. සදාකාලික නැවත තේරී පත්වීමේ යාන්ත්‍රණය.",
  "Revenue Stream": "ආදායම් ප්‍රවාහය",
  "Multi-million $ TV rights deals. Auditor General found unaccounted funds 2016-2022. $2M transfer questioned.": "ඩොලර් මිලියන ගණනක රූපවාහිනී අයිතිවාසිකම් ගනුදෙනු. 2016-2022 කාලය තුළ ගිණුම්ගත නොකළ අරමුදල් විගණකාධිපතිවරයා විසින් සොයා ගන්නා ලදී. ඩොලර් මිලියන 2 ක හුවමාරුවක් ප්‍රශ්න කෙරේ.",
  "Tier 2 — Political &amp; Historical Actors": "2 වන ස්ථරය — දේශපාලනික සහ ඓතිහාසික නළුවන්",
  "Former SLC President (4x)": "හිටපු ශ්‍රී ලංකා ක්‍රිකට් සභාපති (4x)",
  "Family gambling industry links. Accused players of bribery. Power broker even out of office. MP and businessman.": "පවුල් සූදු කර්මාන්තයේ සම්බන්ධතා. අල්ලස් චෝදනා එල්ල වූ ක්‍රීඩකයින්. ධුරයෙන් පවා ඉවත්ව සිටින බල තැරැව්කරු. මන්ත්‍රීවරයෙකු සහ ව්‍යාපාරිකයෙකු.",
  "1996 WC Captain / Politician": "1996 කාන්තා කපිතාන් / දේශපාලනඥයා",
  "Led 2023 interim committee. Counter-accused Sumathipala. Used cricket for political career. Reform attempts failed via ICC rules.": "2023 අතුරු කමිටුවට නායකත්වය දුන්නේය. ප්‍රති-චූදිත සුමතිපාල. දේශපාලන ජීවිතය සඳහා ක්‍රිකට් භාවිතා කළේය. ICC නීති හරහා ප්‍රතිසංස්කරණ උත්සාහයන් අසාර්ථක විය.",
  "Current Ruling Party": "වත්මන් පාලක පක්ෂය",
  "159 seats. Anti-corruption mandate. Sports review initiated Aug 2025. Deputy Minister Sugath Thilakarathne. No cricket-specific reform visible.": "ආසන 159ක්. දූෂණ විරෝධී ජනවරම. 2025 අගෝස්තු මාසයේදී ක්‍රීඩා සමාලෝචනය ආරම්භ කරන ලදී. නියෝජ්‍ය අමාත්‍ය සුගත් තිලකරත්න. ක්‍රිකට් විශේෂිත ප්‍රතිසංස්කරණයක් නොපෙනේ.",
  "Global Governing Body": "ගෝලීය පාලක මණ්ඩලය",
  "Suspended SL in Nov 2023. Anti-corruption office in Colombo. Rules prohibit govt interference — inadvertently protects corrupt boards.": "2023 නොවැම්බර් මාසයේදී ශ්‍රී ලංකාව අත්හිටුවන ලදී. කොළඹ දූෂණ විරෝධී කාර්යාලය. නීති මගින් රජයේ ඇඟිලි ගැසීම් තහනම් කරයි - අහම්බෙන් දූෂිත මණ්ඩල ආරක්ෂා කරයි.",
  "Tier 3 — On-Field Stakeholders": "3 වන ස්ථරය — පිටියේ කොටස්කරුවන්",
  "Head Coach (Oct 2024-)": "ප්‍රධාන පුහුණුකරු (ඔක්තෝබර් 2024-)",
  "Previously ICC-banned for non-cooperation with anti-corruption probe. Appointed coach despite this history. Legend but controversial choice.": "දූෂණ විරෝධී විමර්ශනයට සහයෝගය නොදැක්වීම හේතුවෙන් මීට පෙර ICC තහනමට ලක් විය. මෙම ඉතිහාසය තිබියදීත් පුහුණුකරු ලෙස පත් කරන ලදී. පුරාවෘත්තයක් නමුත් මතභේදාත්මක තේරීමක්.",
  "T20I Captain (Dec 2025-)": "විස්සයි20 නායකයා (දෙසැම්බර් 2025-)",
  "Replaced Asalanka as captain. Experienced but leading a demoralized squad. &quot;Truly shameful&quot; admission post NZ loss.": "අසලංක නායකත්වයෙන් ඉවත් කළා. පළපුරුදු නමුත් අධෛර්යයට පත් කණ්ඩායමකට නායකත්වය දුන්නා. නවසීලන්ත පරාජයෙන් පසු \"ඇත්තටම ලැජ්ජා සහගත\" ඇතුළත් කිරීමක්.",
  "13/15 from 2024 WC": "2024 WC සිට 13/15",
  "Hasaranga, Kusal Mendis, Nissanka, Theekshana, Pathirana. Talent exists but fragile confidence and inconsistency.": "හසරංග, කුසල් මෙන්ඩිස්, නිශ්ශංක, තීක්ෂණ, පතිරණ. දක්ෂතා පවතින නමුත් බිඳෙනසුලු විශ්වාසය සහ නොගැලපීම.",
  "Opaque Process": "පාරාන්ධ ක්‍රියාවලිය",
  "Selection decisions often influenced by board politics rather than merit. Frequent changes. Players uncertain of their place.": "තේරීම් තීරණ බොහෝ විට කුසලතාවයට වඩා මණ්ඩල දේශපාලනයට බලපෑම් කරයි. නිතර සිදුවන වෙනස්කම්. ක්‍රීඩකයින්ට ඔවුන්ගේ ස්ථානය පිළිබඳ අවිනිශ්චිතතාවයක්.",
  "Tier 4 — External &amp; Systemic Forces": "ස්ථරය 4 — බාහිර සහ පද්ධතිමය බලවේග",
  "Pressure Amplifier": "පීඩන ඇම්ප්ලිෆයර්",
  "#unfollowcricketers campaigns. Cyberbullying. Death threats. Meme culture. Destroys player confidence. No institutional buffer.": "#unfollowcricketers ව්‍යාපාර. සයිබර් හිරිහැර කිරීම. මරණ තර්ජන. Meme සංස්කෘතිය. ක්‍රීඩක විශ්වාසය විනාශ කරයි. ආයතනික බෆරයක් නැත.",
  "Traditional Talent Pipeline": "සාම්ප්‍රදායික කුසලතා නල මාර්ගය",
  "Royal, Trinity, St Thomas&apos;. Produced Sanga, Mahela, Murali. Declining influence as cricket democratises but no replacement system.": "රෝයල්, ත්‍රිත්ව, ශාන්ත තෝමස්. සංගා, මහේල, මුරලි බිහි කළා. ක්‍රිකට් ප්‍රජාතන්ත්‍රවාදයට පත්වන විට බලපෑම අඩු වෙමින් පවතින නමුත් ආදේශක ක්‍රමයක් නොමැත.",
  "Competing Interests": "තරඟකාරී උනන්දුව",
  "Players perform well in IPL/LPL but not for SL. Split loyalty, workload management issues. LPL itself corruption-plagued.": "ක්‍රීඩකයින් IPL/LPL තරඟ වලදී හොඳින් දස්කම් දක්වන නමුත් SL තරඟ වලදී එසේ නොවේ. පක්ෂපාතිත්වය බෙදීම, වැඩ බර කළමනාකරණ ගැටළු. LPL තරඟාවලියම දූෂණයෙන් පිරී ඇත.",
  "Nascent, Underfunded": "අලුතින් පැමිණි, අරමුදල් නොමැති",
  "Recently relocated to High Performance Centre. Still far behind Australia, India, England in data analytics capability.": "මෑතකදී ඉහළ කාර්ය සාධන මධ්‍යස්ථානයකට මාරු කරන ලදී. දත්ත විශ්ලේෂණ හැකියාවෙන් තවමත් ඕස්ට්‍රේලියාව, ඉන්දියාව, එංගලන්තයට වඩා බොහෝ පසුපසින්.",
  "Controls / Direct Power": "පාලන / සෘජු බලය",
  "Financial Flow": "මූල්‍ය ප්‍රවාහය",
  "Political Influence": "දේශපාලන බලපෑම",
  "Conflict / Tension": "ගැටුම / ආතතිය",
  "Reform Pressure": "ප්‍රතිසංස්කරණ පීඩනය",
  "↓ Continue to Section 04 — Full Power Network": "↓ 04 වන කොටසට ඉදිරියට යන්න — සම්පූර්ණ බල ජාලය",
  "Interactive diagram: financial flows, cross-institutional capture, political family trees, and the SLC voting mechanism": "අන්තර්ක්‍රියාකාරී රූප සටහන: මූල්‍ය ප්‍රවාහ, ආයතන අතර ග්‍රහණය, දේශපාලන පවුල් ගස් සහ ශ්‍රී ලංකා ක්‍රිකට් ඡන්ද යාන්ත්‍රණය",
  "04 — The Power Network": "04 — විදුලිබල ජාලය",
  "SLC Political & Financial Network Map": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ දේශපාලන සහ මූල්‍ය ජාල සිතියම",
  "An interactive diagram of the patronage flows, political family trees, financial linkages, and cross-institutional capture that has kept the same network in control of Sri Lankan cricket since the 1990s. Use the full-page view for maximum detail.": "1990 ගණන්වල සිට ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාව පාලනය කිරීමේ එකම ජාලයක් පවත්වා ගෙන යන අනුග්‍රාහක ප්‍රවාහයන්, දේශපාලන පවුල් ගස්, මූල්‍ය සම්බන්ධතා සහ අන්තර් ආයතනික ග්‍රහණයන් පිළිබඳ අන්තර්ක්‍රියාකාරී රූප සටහනක්. උපරිම විස්තර සඳහා සම්පූර්ණ පිටු දර්ශනය භාවිතා කරන්න.",
  "↗ Open full-page view": "↗ සම්පූර්ණ පිටු දසුන විවෘත කරන්න",
  "05 — The Elitism Paradox": "05 — එලිටිස්ම් විරුද්ධාභාසය",
  "When Democratisation Killed the &quot;Cricketing Brain&quot;": "ප්‍රජාතන්ත්‍රීකරණය \"ක්‍රිකට් මොළය\" මරා දැමූ විට",
  "The uncomfortable argument: Sri Lanka's golden era was produced by an elite school system that bred not just cricketers, but thinkers. The democratisation of cricket widened access but may have eroded the intellectual infrastructure that produced legends.": "අපහසු තර්කය: ශ්‍රී ලංකාවේ ස්වර්ණමය යුගය බිහි වූයේ ක්‍රිකට් ක්‍රීඩකයින් පමණක් නොව චින්තකයින් ද බිහි කළ ප්‍රභූ පාසල් පද්ධතියකිනි. ක්‍රිකට් ප්‍රජාතන්ත්‍රීයකරණය ප්‍රවේශය පුළුල් කළ නමුත් පුරාවෘත්තයන් බිහි කළ බුද්ධිමය යටිතල පහසුකම් ඛාදනය වන්නට ඇත.",
  "The Elite School Pipeline": "එලයිට් පාසල් නල මාර්ගය",
  "Almost every Sri Lankan cricket legend came through the elite school system — Royal College, Trinity College Kandy, St. Thomas' College, S. Thomas' Prep, Wesley, St. Peter's, St. Joseph's. The Royal-Thomian cricket match has been played annually since 1879 — over 147 years uninterrupted, even during World War II.": "ශ්‍රී ලංකාවේ ක්‍රිකට් පුරාවෘත්තයන් සියල්ලම පාහේ රාජකීය විද්‍යාලය, මහනුවර ත්‍රිත්ව විද්‍යාලය, ශාන්ත තෝමස් විද්‍යාලය, ශාන්ත තෝමස් ප්‍රෙප්, වෙස්ලි, ශාන්ත පීතර, ශාන්ත ජෝසප් යන උසස් පාසල් පද්ධතිය හරහා පැමිණියේය. රාජකීය-තෝමස් ක්‍රිකට් තරගය 1879 සිට වාර්ෂිකව වසර 147 ක් පුරා අඛණ්ඩව පවත්වා ඇත, දෙවන ලෝක යුද්ධ සමයේදී පවා.",
  "These institutions didn't just teach cricket technique — they embedded a culture of strategic thinking, pressure management, English-language fluency (critical for interacting with international cricket culture), and a gentleman's code. Kumar Sangakkara (Trinity), Mahela Jayawardene (Nalanda/elite Colombo), Arjuna Ranatunga (Ananda), Marvan Atapattu (Ananda) — these weren't just talented batsmen. They were cricket intellectuals who could read a game five overs ahead.": "මෙම ආයතන ක්‍රිකට් තාක්ෂණය ඉගැන්නුවා පමණක් නොව - උපායමාර්ගික චින්තනය, පීඩන කළමනාකරණය, ඉංග්‍රීසි භාෂා චතුරතාව (ජාත්‍යන්තර ක්‍රිකට් සංස්කෘතිය සමඟ අන්තර් ක්‍රියා කිරීම සඳහා අත්‍යවශ්‍ය) සහ මහත්වරුන්ගේ සංග්‍රහයක් ඔවුන් තුළ අන්තර්ගත විය. කුමාර් සංගක්කාර (ත්‍රිත්ව), මහේල ජයවර්ධන (නාලන්දා/කොළඹ ප්‍රභූ), අර්ජුන රණතුංග (ආනන්ද), මාවන් අතපත්තු (ආනන්ද) - මොවුන් දක්ෂ පිතිකරුවන් පමණක් නොවේ. ඔවුන් පන්දුවාර පහක් ඉදිරියෙන් තරගයක් කියවිය හැකි ක්‍රිකට් බුද්ධිමතුන් විය.",
  "What Was Lost": "නැති වූ දේ",
  "As cricket expanded beyond the elite schools to rural clubs and provincial systems — an inherently positive development — the infrastructure that cultivated &quot;cricketing intelligence&quot; was not replicated. Rural and non-elite school systems produce athletes, but without the coaching depth, competitive school cricket culture, and intellectual framework that the elite schools provided.": "ක්‍රිකට් ක්‍රීඩාව ප්‍රභූ පාසල්වලින් ඔබ්බට ග්‍රාමීය සමාජ ශාලා සහ පළාත් පද්ධති දක්වා ව්‍යාප්ත වීමත් සමඟ - සහජයෙන්ම ධනාත්මක වර්ධනයක් - \"ක්‍රිකට් බුද්ධිය\" වගා කළ යටිතල පහසුකම් ප්‍රතිනිර්මාණය නොවීය. ග්‍රාමීය සහ ප්‍රභූ නොවන පාසල් පද්ධති ක්‍රීඩක ක්‍රීඩිකාවන් බිහි කරයි, නමුත් ප්‍රභූ පාසල් විසින් සපයන ලද පුහුණු ගැඹුර, තරඟකාරී පාසල් ක්‍රිකට් සංස්කෘතිය සහ බුද්ධිමය රාමුව නොමැතිව.",
  "The result: Sri Lanka now produces explosive talent (Pathirana's death bowling, Hasaranga's wrist spin) but lacks the strategic captains, the calm accumulators, the players who can adjust a game plan mid-innings. The &quot;cricketing brain&quot; deficit isn't about intelligence — it's about an institutional gap in how cricket thinking is taught and mentored.": "ප්‍රතිඵලය: ශ්‍රී ලංකාව දැන් පුපුරන සුලු දක්ෂතා (පතිරණගේ මරණ පන්දු යැවීම, හසරංගගේ මැණික් කටුව දඟ පන්දු) බිහි කරයි, නමුත් උපායමාර්ගික නායකයින්, සන්සුන් සමුච්චකයින්, ඉනිම මැද ක්‍රීඩා සැලැස්මක් සකස් කළ හැකි ක්‍රීඩකයින් නොමැත. \"ක්‍රිකට් මොළය\" හිඟය බුද්ධිය ගැන නොවේ - එය ක්‍රිකට් චින්තනය උගන්වන සහ මඟ පෙන්වන ආකාරයේ ආයතනික පරතරයක් ගැන ය.",
  "The Murali Exception — And What It Teaches": "මුරලි ව්‍යතිරේකය - සහ එයින් උගන්වන දේ",
  "Muttiah Muralitharan came from a Tamil background outside the Sinhalese elite school system, yet became the greatest match-winner in cricket history. But Murali thrived because he was absorbed into an elite system (St. Anthony's Kandy) and then into a team led by elite-school captains (Ranatunga, then Jayawardene/Sangakkara) who knew how to utilise him strategically. The lesson: raw talent needs an intellectual framework around it to flourish. Today's Sri Lanka has the raw talent but not the framework — neither from the old elite schools (whose influence has waned) nor from any new system that replaced it.": "මුත්තයියා මුරලිදරන් සිංහල ප්‍රභූ පාසල් පද්ධතියෙන් පිටත දෙමළ පසුබිමකින් පැමිණියද, ක්‍රිකට් ඉතිහාසයේ ශ්‍රේෂ්ඨතම තරග ජයග්‍රාහකයා බවට පත්විය. නමුත් මුරලි සමෘද්ධිමත් වූයේ ඔහු ප්‍රභූ පද්ධතියකට (මහනුවර ශාන්ත අන්තෝනි) අවශෝෂණය වී පසුව උපායමාර්ගිකව ඔහුව භාවිතා කරන්නේ කෙසේදැයි දැන සිටි ප්‍රභූ පාසල් නායකයින් (රණතුංග, එවකට ජයවර්ධන/සංගක්කාර) විසින් මෙහෙයවන ලද කණ්ඩායමකට ඇතුළත් වූ බැවිනි. පාඩම: අමු දක්ෂතා වර්ධනය වීමට එය වටා බුද්ධිමය රාමුවක් අවශ්‍ය වේ. අද ශ්‍රී ලංකාවේ අමු දක්ෂතා ඇත, නමුත් රාමුව නොවේ - පැරණි ප්‍රභූ පාසල්වලින් (එහි බලපෑම අඩු වී ඇති) හෝ එය ප්‍රතිස්ථාපනය කළ කිසිදු නව පද්ධතියකින් නොවේ.",
  "The Uncomfortable Truth": "අපහසු සත්‍යය",
  "This isn't an argument for elitism per se — it's an argument that when you dismantle an old system, you must build a new one. India managed this: the BCCI created sophisticated state-level academies (NCA in Bangalore), invested in coaching education, and used the IPL as a finishing school. Australia has the AIS and state-based cricket centres of excellence. England has the ECB pathway system.": "මෙය තනිකරම ප්‍රභූත්වය සඳහා තර්කයක් නොවේ - එය පැරණි ක්‍රමයක් විසුරුවා හරින විට, ඔබ නව එකක් ගොඩනගා ගත යුතු බවට තර්කයකි. ඉන්දියාව මෙය කළමනාකරණය කළේය: BCCI විසින් නවීන රාජ්‍ය මට්ටමේ ඇකඩමි (බැංගලෝරයේ NCA) නිර්මාණය කරන ලදී, පුහුණු අධ්‍යාපනය සඳහා ආයෝජනය කරන ලදී, සහ IPL නිම කිරීමේ පාසලක් ලෙස භාවිතා කරන ලදී. ඕස්ට්‍රේලියාවට AIS සහ රාජ්‍ය පාදක විශිෂ්ටතා ක්‍රිකට් මධ්‍යස්ථාන ඇත. එංගලන්තයට ECB මාර්ග පද්ධතිය ඇත.",
  "Sri Lanka demolished the old elite pathway through democratisation (good) but built nothing comparable in its place (disastrous). The SLC was too busy enriching itself to invest in player development infrastructure. The result is a generation of cricketers with IPL-grade talent but club-level game management.": "ශ්‍රී ලංකාව ප්‍රජාතන්ත්‍රවාදය (හොඳ) හරහා පැරණි ප්‍රභූ මාවත කඩා බිඳ දැමූ නමුත් ඒ වෙනුවට සමාන කිසිවක් (විනාශකාරී) ගොඩනඟා ගත්තේ නැත. ක්‍රීඩක සංවර්ධන යටිතල පහසුකම් සඳහා ආයෝජනය කිරීමට ශ්‍රී ලංකා ක්‍රිකට් ආයතනය ඕනෑවට වඩා කාර්යබහුල විය. එහි ප්‍රතිඵලය වූයේ IPL මට්ටමේ දක්ෂතා ඇති නමුත් සමාජ මට්ටමේ ක්‍රීඩා කළමනාකරණයක් සහිත ක්‍රිකට් ක්‍රීඩකයින්ගේ පරම්පරාවක් බිහි වීමයි.",
  "06 — The Social Media Vortex": "06 — සමාජ මාධ්‍ය සුළි සුළඟ",
  "The Hype-Pressure-Disappointment Death Spiral": "අතිශයෝක්තිය-පීඩනය-බලාපොරොත්තු සුන්වීම මරණ සර්පිලාකාරය",
  "Sri Lankan cricket fans don't just watch cricket — they weaponise it. Social media has turned every match into a referendum on national pride, and every loss into a trigger for collective abuse.": "ශ්‍රී ලංකාවේ ක්‍රිකට් ලෝලීන් ක්‍රිකට් නැරඹීම පමණක් නොවේ - ඔවුන් එය ආයුධයක් ලෙස භාවිතා කරයි. සමාජ මාධ්‍ය සෑම තරඟයක්ම ජාතික අභිමානය පිළිබඳ ජනමත විචාරණයක් බවටත්, සෑම පරාජයක්ම සාමූහික අපයෝජනය සඳහා ප්‍රේරකයක් බවටත් පත් කර තිබේ.",
  "Hype": "අතිශයෝක්තිය",
  "Pre-match nationalism, &quot;Lions&quot; rhetoric, memories of '96": "තරඟයට පෙර ජාතිකවාදය, \"සිංහයන්\" වාචාලකම, '96 මතකයන්",
  "Pressure": "පීඩනය",
  "Unrealistic expectations, social media storms, &quot;win or else&quot;": "යථාර්ථවාදී නොවන අපේක්ෂාවන්, සමාජ මාධ්‍ය කුණාටු, \"ජයග්‍රහණය නැතිනම්\"",
  "Disappointment": "කලකිරීම",
  "Inevitable loss, collective rage, player abuse": "නොවැළැක්විය හැකි පරාජය, සාමූහික කෝපය, ක්‍රීඩක අපයෝජනය",
  "Amnesia": "සිහිසුන් බව",
  "Brief hope after any small win, cycle restarts": "ඕනෑම කුඩා ජයග්‍රහණයකින් පසු කෙටි බලාපොරොත්තුවක්, චක්‍රය නැවත ආරම්භ වේ",
  "Repeat": "නැවත කරන්න",
  "The #UnfollowCricketers Campaign": "#UnfollowCricketers ව්‍යාපාරය",
  "After Sri Lanka's 0-3 T20 drubbing by England, fans launched a coordinated social media campaign under the hashtag #unfollowcricketers. Thousands boycotted the Facebook pages of vice-captain Kusal Mendis and opener Dhanushka Gunathilaka — himself the subject of a separate conduct investigation. The campaign wasn't just negative — it was organised, sustained, and specifically targeted at individual players rather than the administration.": "එංගලන්තය හමුවේ ශ්‍රී ලංකාව ලැබූ විස්සයි20 පරාජයෙන් පසු, රසිකයන් #unfollowcricketers යන හැෂ් ටැගය යටතේ සම්බන්ධීකරණ සමාජ මාධ්‍ය ව්‍යාපාරයක් දියත් කළහ. උප නායක කුසල් මෙන්ඩිස් සහ ආරම්භක පිතිකරු ධනුෂ්ක ගුණතිලකගේ ෆේස්බුක් පිටු දහස් ගණනක් වර්ජනය කළහ - ඔහු වෙනම හැසිරීම් විමර්ශනයකට භාජනය වූවෙකි. මෙම ව්‍යාපාරය ඍණාත්මක පමණක් නොව - එය සංවිධානාත්මක, තිරසාර වූ අතර විශේෂයෙන් පරිපාලනයට වඩා තනි ක්‍රීඩකයින් ඉලක්ක කර ගත් එකක් විය.",
  "Kusal Mendis later spoke publicly about the abuse: &quot;When we're doing badly is when we need the most support.&quot; But the culture of targeted personal attacks continued. Some fan posts even threatened violence, with warnings about &quot;fans attacking cricketers' houses and burning cricketers' dummies like in India.&quot;": "කුසල් මෙන්ඩිස් පසුව අපයෝජනය ගැන ප්‍රසිද්ධියේ කතා කළේය: \"අපි නරක ලෙස කටයුතු කරන විට අපට වඩාත්ම සහාය අවශ්‍ය වේ.\" නමුත් ඉලක්ක කරගත් පුද්ගලික ප්‍රහාර සංස්කෘතිය දිගටම පැවතුනි. සමහර රසික සටහන් ප්‍රචණ්ඩත්වයට පවා තර්ජනය කළ අතර, \"රසිකයන් ක්‍රිකට් ක්‍රීඩකයින්ගේ නිවාසවලට පහර දෙන අතර ඉන්දියාවේ මෙන් ක්‍රිකට් ක්‍රීඩකයින්ගේ ඩමි පුළුස්සා දමයි\" යන අනතුරු ඇඟවීම් ද ඇතුළත් විය.",
  "Why It's Uniquely Destructive": "එය අද්විතීය ලෙස විනාශකාරී වන්නේ ඇයි?",
  "Sri Lanka is a small country (~22M people) where cricket is the dominant national sport. Unlike India, where 1.4 billion fans distribute their intensity across many players, or Australia, where multiple sports compete for attention — in Sri Lanka, the pressure is concentrated on a tiny squad with nowhere to hide.": "ශ්‍රී ලංකාව කුඩා රටක් (ජනගහනය මිලියන 22ක් පමණ) වන අතර එහි ක්‍රිකට් ප්‍රමුඛ ජාතික ක්‍රීඩාව වේ. බිලියන 1.4ක් රසිකයන් තම තීව්‍රතාවය බොහෝ ක්‍රීඩකයින් අතර බෙදා හරින ඉන්දියාව මෙන් නොව, ක්‍රීඩා කිහිපයක් අවධානය සඳහා තරඟ කරන ඕස්ට්‍රේලියාව මෙන් නොව - ශ්‍රී ලංකාවේ පීඩනය සංකේන්ද්‍රණය වී ඇත්තේ සැඟවීමට තැනක් නොමැති කුඩා කණ්ඩායමක් මත ය.",
  "The player pool is small enough that fans know players personally — their families, their schools, their neighbourhoods. Social media abuse isn't anonymous abstract criticism; it's your neighbour's son calling you a &quot;Lonthaya&quot; (loser/worthless person) on Facebook. Former captain Marvan Atapattu called for a complete social media ban for national cricketers in November 2025.": "ක්‍රීඩක සංචිතය ප්‍රමාණවත් තරම් කුඩා බැවින් රසිකයින්ට ක්‍රීඩකයින් පෞද්ගලිකව දැනගත හැකිය - ඔවුන්ගේ පවුල්, ඔවුන්ගේ පාසල්, ඔවුන්ගේ අසල්වැසි ප්‍රදේශ. සමාජ මාධ්‍ය අපයෝජනය යනු නිර්නාමික වියුක්ත විවේචනයක් නොවේ; එය ඔබේ අසල්වැසියාගේ පුතා ඔබව ෆේස්බුක් හි \"ලොන්තයා\" (පරාජිතයා / වැදගැම්මකට නැති පුද්ගලයා) ලෙස හැඳින්වීමයි. හිටපු නායක මාවන් අතපත්තු 2025 නොවැම්බර් මාසයේදී ජාතික ක්‍රිකට් ක්‍රීඩකයින් සඳහා සම්පූර්ණ සමාජ මාධ්‍ය තහනමක් ඉල්ලා සිටියේය.",
  "Practical Corrections": "ප්‍රායෝගික නිවැරදි කිරීම්",
  "You can't force people to behave — but you can change the information architecture:": "ඔබට මිනිසුන්ට හැසිරීමට බල කළ නොහැක - නමුත් ඔබට තොරතුරු ගෘහ නිර්මාණ ශිල්පය වෙනස් කළ හැකිය:",
  "1. Institutional Buffer: Create a dedicated SLC communications team that absorbs and redirects public anger toward governance reform rather than players. Use official channels to frame losses in analytical terms, not emotional ones.": "1. ආයතනික බෆරය: ක්‍රීඩකයින්ට වඩා පාලන ප්‍රතිසංස්කරණ කෙරෙහි මහජන කෝපය අවශෝෂණය කර හරවා යැවීමට කැපවූ ශ්‍රී ලංකා ක්‍රිකට් සන්නිවේදන කණ්ඩායමක් නිර්මාණය කරන්න. චිත්තවේගීය වශයෙන් නොව විශ්ලේෂණාත්මකව පාඩු සැලසුම් කිරීමට නිල නාලිකා භාවිතා කරන්න.",
  "2. Player Social Media Management: Professional social media managers for all national players (as IPL teams provide). Players should not manage their own accounts during tournaments.": "2. ක්‍රීඩක සමාජ මාධ්‍ය කළමනාකරණය: සියලුම ජාතික ක්‍රීඩකයින් සඳහා වෘත්තීය සමාජ මාධ්‍ය කළමනාකරුවන් (IPL කණ්ඩායම් සපයන පරිදි). තරඟාවලි අතරතුර ක්‍රීඩකයින් තමන්ගේම ගිණුම් කළමනාකරණය නොකළ යුතුය.",
  "3. Fan Education Campaigns: Partner with ICC's social media moderation program. Run campaigns showing how abuse affects performance — make it about winning, not morality.": "3. රසික අධ්‍යාපන ව්‍යාපාර: ICC හි සමාජ මාධ්‍ය මධ්‍යස්ථකරණ වැඩසටහන සමඟ හවුල් වන්න. අපයෝජනය කාර්ය සාධනයට බලපාන ආකාරය පෙන්වන ව්‍යාපාර ක්‍රියාත්මක කරන්න - එය සදාචාරය නොව ජයග්‍රහණය පිළිබඳ කාරණයක් බවට පත් කරන්න.",
  "4. Redirect the Narrative: Create public &quot;accountability dashboards&quot; for the SLC board — viewable stats on money spent, development programs, coaching hires. Give fans a productive target for their energy.": "4. කතාව නැවත හරවා යැවීම: SLC මණ්ඩලය සඳහා පොදු \"වගවීමේ උපකරණ පුවරු\" සාදන්න - වියදම් කළ මුදල්, සංවර්ධන වැඩසටහන්, පුහුණුකරුවන් බඳවා ගැනීම් පිළිබඳ නැරඹිය හැකි සංඛ්‍යාලේඛන. රසිකයින්ට ඔවුන්ගේ ශක්තිය සඳහා ඵලදායී ඉලක්කයක් ලබා දෙන්න.",
  "5. Legal Framework: Strengthen cyberbullying enforcement (only ~2,000 cases reported in 2024, half involving sexual harassment). Make credible threats to players actionable.": "5. නීතිමය රාමුව: සයිබර් හිරිහැර කිරීම් බලාත්මක කිරීම ශක්තිමත් කිරීම (2024 දී වාර්තා වූ නඩු ~2,000 ක් පමණි, අඩක් ලිංගික හිරිහැර සම්බන්ධ වේ). ක්‍රීඩකයින්ට විශ්වාසදායක තර්ජන ක්‍රියාමාර්ග ගත හැකි බවට පත් කරන්න.",
  "The venomous, hate-filled disparagement conveyed targeting the cricketers via social media is testament to the toxic nature of cricket fans in this country and the decay of our society in terms of values and attitudes.": "සමාජ මාධ්‍ය හරහා ක්‍රිකට් ක්‍රීඩකයින් ඉලක්ක කර ගනිමින් ප්‍රකාශයට පත් කරන ලද විෂ සහිත, වෛරයෙන් පිරුණු අපහාසය, මේ රටේ ක්‍රිකට් ලෝලීන්ගේ විෂ සහිත ස්වභාවය සහ වටිනාකම් සහ ආකල්ප අතින් අපේ සමාජයේ පිරිහීම පෙන්නුම් කරයි.",
  "— Daily FT Editorial, Asia Cup Analysis": "— ඩේලි එෆ්ටී කතුවැකිය, ආසියානු කුසලාන විශ්ලේෂණය",
  "Case File: The Conduct Files →": "නඩු ගොනුව: හැසිරීම් ගොනු →",
  "Documented allegations of player misconduct, the KalathmaGate incident, and the SLC's pattern of institutional silence — restricted access": "ක්‍රීඩක විෂමාචාරය, කලත්මාගේට් සිද්ධිය සහ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ආයතනික නිහඬතාවයේ රටාව පිළිබඳ ලේඛනගත චෝදනා - සීමිත ප්‍රවේශය",
  "07 — The Player Crisis": "07 — ක්‍රීඩක අර්බුදය",
  "Form, Dedication & The Hollowing Out": "ස්වරූපය, කැපවීම සහ හිස්බව",
  "Looking beyond the surface: why a squad with IPL-level talent collapses in national colours. Off-field conduct and institutional cover-up add another dimension — documented in the ": "මතුපිටින් ඔබ්බට බැලීම: IPL මට්ටමේ දක්ෂතා ඇති කණ්ඩායමක් ජාතික වර්ණවලින් බිඳ වැටෙන්නේ ඇයි. පිටියෙන් පිටත හැසිරීම සහ ආයතනික ආවරණය තවත් මානයක් එක් කරයි - ලේඛනගත කර ඇත",
  "Conduct Files case dossier": "හැසිරීම් ගොනු නඩු ලේඛනය",
  ".": ".",
  "The Captaincy Carousel": "කැප්ටන්සි කැරොසල්",
  "Charith Asalanka was removed as T20I captain in December 2025 after 18 months — record: 10 wins, 11 losses, 2 ties. His batting collapsed under the weight of leadership: 156 runs in 12 innings at a strike rate of just 122 in 2025. Rather than developing captaincy skills over time, SLC's instinct was to replace him with Dasun Shanaka just before the World Cup — a decision that created uncertainty rather than stability.": "චරිත් අසලංක මාස 18 කට පසු 2025 දෙසැම්බර් මාසයේදී T20I නායකත්වයෙන් ඉවත් කරන ලදී - වාර්තාව: ජයග්‍රහණ 10ක්, පරාජයන් 11ක්, සම ලකුණු 2ක්. නායකත්වයේ බර යටතේ ඔහුගේ පිතිකරණය බිඳ වැටුණි: 2025 දී ඉනිම 12 කදී ලකුණු 156ක් ලබා ගත්තේ ලකුණු 122ක ප්‍රහාරක අනුපාතයක් සමඟිනි. කාලයත් සමඟ නායකත්ව කුසලතා වර්ධනය කර ගැනීමට වඩා, ලෝක කුසලානයට පෙර ඔහු වෙනුවට දසුන් ශානක පත් කිරීමට ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ සහජ බුද්ධිය විය - ස්ථාවරත්වයට වඩා අවිනිශ්චිතතාවයක් ඇති කළ තීරණයක්.",
  "This pattern repeats across eras: captains are appointed, unsupported, blamed, and replaced. No captain since Angelo Mathews has been given genuine long-term backing with institutional support. The result is a squad where no one feels ownership of the team's direction.": "මෙම රටාව යුග පුරා පුනරාවර්තනය වේ: නායකයන් පත් කිරීම, සහාය නොදක්වීම, දොස් පැවරීම සහ ප්‍රතිස්ථාපනය කිරීම. ඇන්ජලෝ මැතිව්ස්ගෙන් පසු කිසිදු නායකයෙකුට ආයතනික සහාය ඇතිව සැබෑ දිගුකාලීන සහාය ලබා දී නොමැත. ප්‍රතිඵලය වන්නේ කණ්ඩායමේ දිශාවේ හිමිකාරිත්වය කිසිවෙකුට දැනෙන්නේ නැති කණ්ඩායමකි.",
  "Deep Issues": "ගැඹුරු ගැටළු",
  "&quot;Franchise vs. National Loyalty:&quot; Players perform brilliantly in the IPL and LPL, where they have dedicated analysts, mental conditioning coaches, and clear roles. They return to the national setup, which offers none of this, and regress. The gap isn't talent — it's support infrastructure.": "\"ෆ්‍රැන්චයිස් එදිරිව ජාතික පක්ෂපාතිත්වය:\" ක්‍රීඩකයින් IPL සහ LPL තරඟාවලි වලදී විශිෂ්ට ලෙස දස්කම් දක්වයි, එහිදී ඔවුන්ට කැපවූ විශ්ලේෂකයින්, මානසික පුහුණුකරුවන් සහ පැහැදිලි භූමිකාවන් ඇත. ඔවුන් මේ කිසිවක් ලබා නොදෙන ජාතික සැකසුම වෙත නැවත පැමිණ පසුබසිති. පරතරය දක්ෂතාව නොවේ - එය සහාය යටිතල පහසුකම් වේ.",
  "Fitness &amp; Conditioning: SLC's High Performance Centre has improved, but still lags behind the NCA (India) or AIS (Australia). Workload management between franchise and international cricket is poorly coordinated. Players arrive for national duty either over-bowled or under-prepared.": "යෝග්‍යතාවය සහ කන්ඩිෂනින්: ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ ඉහළ කාර්ය සාධන මධ්‍යස්ථානය දියුණු වී ඇත, නමුත් තවමත් NCA (ඉන්දියාව) හෝ AIS (ඕස්ට්‍රේලියාව) ට වඩා පසුගාමී ය. ෆ්‍රැන්චයිස් සහ ජාත්‍යන්තර ක්‍රිකට් අතර වැඩ බර කළමනාකරණය දුර්වල ලෙස සම්බන්ධීකරණය කර ඇත. ක්‍රීඩකයින් ජාතික රාජකාරි සඳහා පැමිණෙන්නේ අධික ලෙස පන්දු යවමින් හෝ අඩු සූදානමකින් ය.",
  "Mental Fragility: The 84/6 to 168/7 collapse against NZ isn&apos;t a technical failure — it&apos;s a mental one. When pressure mounts, this team doesn&apos;t have the psychological resilience to adapt. This isn&apos;t innate — it&apos;s a direct consequence of zero mental conditioning investment and a toxic external environment.": "මානසික දුර්වලතාවය: නවසීලන්තයට එරෙහිව 84/6 සිට 168/7 දක්වා බිඳ වැටීම තාක්ෂණික අසාර්ථකත්වයක් නොවේ - එය මානසික එකකි. පීඩනය වැඩි වන විට, මෙම කණ්ඩායමට අනුවර්තනය වීමට මානසික ඔරොත්තු දීමේ හැකියාවක් නොමැත. මෙය සහජ නොවේ - එය ශුන්‍ය මානසික සමීකරණ ආයෝජනයේ සහ විෂ සහිත බාහිර පරිසරයේ සෘජු ප්‍රතිවිපාකයකි.",
  "The T20 WC 2026 Squad": "2026 T20 ලෝක කුසලාන සංචිතය",
  "SLC retained 13 of 15 players from the 2024 T20 World Cup squad — which had also failed (group stage elimination). This raises a fundamental question: if the personnel didn&apos;t change, why would the outcome?": "2024 T20 ලෝක කුසලාන සංචිතයේ ක්‍රීඩකයින් 15 දෙනාගෙන් 13 දෙනෙකු ශ්‍රී ලංකා ක්‍රිකට් ආයතනය විසින් රඳවා ගන්නා ලදී - ඔවුන් ද අසාර්ථක විය (කණ්ඩායම් අදියර ඉවත් කිරීම). මෙය මූලික ප්‍රශ්නයක් මතු කරයි: කාර්ය මණ්ඩලය වෙනස් නොවූයේ නම්, ප්‍රතිඵලය කුමක් වනු ඇත්ද?",
  "Key players and their issues:": "ප්‍රධාන ක්‍රීඩකයින් සහ ඔවුන්ගේ ගැටළු:",
  "Wanindu Hasaranga: World-class leg-spinner but increasingly read by top teams. Needs analytical support to evolve variations.": "වනිඳු හසරංග: ලෝක මට්ටමේ පා දඟ පන්දු යවන්නෙකු වන නමුත් ඉහළ කණ්ඩායම් විසින් වැඩි වැඩියෙන් කියවනු ලැබේ. වෙනස්කම් පරිණාමය කිරීමට විශ්ලේෂණාත්මක සහාය අවශ්‍ය වේ.",
  "Pathum Nissanka: Talented opener but fragile confidence — bowled first ball in the elimination match. The pressure of opening in a home World Cup with zero institutional support.": "පැතුම් නිශ්ශංක: දක්ෂ ආරම්භක පිතිකරුවෙක් නමුත් බිඳෙන සුළු විශ්වාසයක් - ඉවත් කිරීමේ තරගයේ පළමු පන්දුව යැව්වා. ආයතනික සහයෝගයක් නොමැතිව ගෘහස්ථ ලෝක කුසලානයක ආරම්භක පිතිකරුවෙකු වීමේ පීඩනය.",
  "Kusal Mendis: Perhaps the most talented batter in the squad but the primary target of social media abuse. Performance peaks and troughs correlate with public pressure cycles.": "කුසල් මෙන්ඩිස්: සමහරවිට කණ්ඩායමේ සිටින දක්ෂතම පිතිකරුවා විය හැකි නමුත් සමාජ මාධ්‍ය අපයෝජනයේ ප්‍රධාන ඉලක්කය විය හැකිය. කාර්ය සාධන උච්චතම අවස්ථා මහජන පීඩන චක්‍ර සමඟ සහසම්බන්ධ වේ.",
  "Matheesha Pathirana: A genuine match-winner with his unique bowling action but workload management concerns. His absence from key moments tells a scheduling story.": "මතීෂ පතිරණ: ඔහුගේ අද්විතීය පන්දු යැවීමේ ඉරියව්ව සමඟ සැබෑ තරග ජයග්‍රාහකයෙකි, නමුත් වැඩ බර කළමනාකරණය පිළිබඳ ගැටළු තිබේ. ප්‍රධාන අවස්ථාවන්හිදී ඔහු නොපැමිණීම කාලසටහන්ගත කිරීමේ කතාවක් කියයි.",
  "08 — The NPP Paradox": "08 — NPP විරුද්ධාභාසය",
  "Why the &quot;Anti-Corruption&quot; Government Can't Fix Cricket": "\"දූෂණ විරෝධී\" රජයට ක්‍රිකට් නිවැරදි කළ නොහැක්කේ ඇයි?",
  "The NPP (Anura Kumara Dissanayake) came to power on a wave of anti-corruption sentiment. They were vocal critics of the SLC system — from opposition benches. In power, they&apos;ve done nothing.": "ජාතික ජන බලවේගය (අනුර කුමාර දිසානායක) බලයට පත් වූයේ දූෂණ විරෝධී හැඟීම් රැල්ලක් මත ය. ඔවුන් විපක්ෂයේ සිට ශ්‍රී ලංකා ක්‍රිකට් ක්‍රමයේ වාචික විවේචකයින් විය. බලයේ සිටියදී ඔවුන් කිසිවක් කර නැත.",
  "The Promise vs. Reality": "පොරොන්දුව එදිරිව යථාර්ථය",
  "Before taking office, the NPP was perhaps the most vocal critic of institutional corruption in Sri Lanka, including SLC. JVP/NPP parliamentarians raised SLC governance issues in parliament, demanded accountability for TV rights money, and called for structural reform. This was central to their populist anti-establishment appeal.": "බලයට පත්වීමට පෙර, ශ්‍රී ලංකා ක්‍රිකට් ආයතනය ඇතුළුව ශ්‍රී ලංකාවේ ආයතනික දූෂණය පිළිබඳ වඩාත්ම වාචික විවේචකයා ජාතික ජන බලවේගය විය හැකිය. ජනතා විමුක්ති පෙරමුණ/ජාතික ජනතා විමුක්ති පෙරමුණේ පාර්ලිමේන්තු මන්ත්‍රීවරු පාර්ලිමේන්තුවේදී ශ්‍රී ලංකා ක්‍රිකට් පාලන ගැටළු මතු කළහ, රූපවාහිනී අයිතිවාසිකම් සඳහා මුදල් සඳහා වගවීම ඉල්ලා සිටියහ, සහ ව්‍යුහාත්මක ප්‍රතිසංස්කරණ ඉල්ලා සිටියහ. මෙය ඔවුන්ගේ ජනතාවාදී ආයතන විරෝධී ආයාචනයේ කේන්ද්‍රීය විය.",
  "Since winning 159 seats (a supermajority) and forming government in 2024, the NPP&apos;s concrete cricket reform actions amount to: a budget review meeting in August 2025, the appointment of a Deputy Sports Minister (Sugath Thilakarathne), and a general instruction to &quot;prepare a sports development plan.&quot; That&apos;s it.": "2024 දී ආසන 159ක් (සුපිරි බහුතරයක්) දිනා රජයක් පිහිටුවීමෙන් පසු, ජාතික ක්‍රීඩා පක්ෂයේ සංයුක්ත ක්‍රිකට් ප්‍රතිසංස්කරණ ක්‍රියාමාර්ගවලට සමාන වන්නේ: 2025 අගෝස්තු මාසයේදී අයවැය සමාලෝචන රැස්වීමක්, නියෝජ්‍ය ක්‍රීඩා අමාත්‍යවරයෙකු (සුගත් තිලකරත්න) පත් කිරීම සහ \"ක්‍රීඩා සංවර්ධන සැලැස්මක් සකස් කිරීම\" සඳහා සාමාන්‍ය උපදෙස්. එපමණයි.",
  "Meanwhile, Shammi Silva was re-elected uncontested in March 2025 — under the NPP&apos;s watch. The &quot;anti-corruption&quot; government stood by while the same board they called corrupt consolidated power.": "මේ අතර, ෂම්මි සිල්වා 2025 මාර්තු මාසයේදී නිතරගයෙන් නැවත තේරී පත් විය - NPP හි අධීක්ෂණය යටතේ. දූෂිත ඒකාබද්ධ බලය ලෙස ඔවුන් හැඳින්වූ එම මණ්ඩලයම සිටියදී \"දූෂණ විරෝධී\" රජය රැඳී සිටියේය.",
  "Is it rhetorical capture?": "ඒක වාචාල ග්‍රහණයක්ද?",
  "The assessment that the NPP &quot;used emotional rhetoric to attain power&quot; is partially correct but incomplete. The NPP&apos;s inaction on cricket stems from three structural constraints: (1) the ICC suspension precedent of 2023 made any government directly aware that interference triggers international isolation, (2) the NPP&apos;s economic reform agenda consumes all political capital — cricket reform yields no immediate economic return, and (3) the SLC &quot;mafia&quot; has legal protections that make reform litigation-heavy and politically costly. It&apos;s less cynical manipulation and more structural powerlessness masked by rhetorical boldness.": "NPP \"බලය ලබා ගැනීම සඳහා චිත්තවේගීය වාචාලකම භාවිතා කළ\" බවට කරන ලද තක්සේරුව අර්ධ වශයෙන් නිවැරදි නමුත් අසම්පූර්ණයි. ක්‍රිකට් සම්බන්ධයෙන් NPP හි අක්‍රියතාව ව්‍යුහාත්මක සීමාවන් තුනකින් පැන නගී: (1) 2023 ICC අත්හිටුවීමේ පූර්වාදර්ශය ඕනෑම රජයකට මැදිහත්වීම ජාත්‍යන්තර හුදකලාව ඇති කරන බව සෘජුවම දැනුවත් කළේය, (2) NPP හි ආර්ථික ප්‍රතිසංස්කරණ න්‍යාය පත්‍රය සියලු දේශපාලන ප්‍රාග්ධනය පරිභෝජනය කරයි - ක්‍රිකට් ප්‍රතිසංස්කරණ ක්ෂණික ආර්ථික ප්‍රතිලාභයක් ලබා නොදේ, සහ (3) SLC \"මාෆියාව\" ප්‍රතිසංස්කරණ නඩු කටයුතු බර සහ දේශපාලනික වශයෙන් මිල අධික කරන නීතිමය ආරක්ෂාවන් ඇත. එය අඩු නරුම උපාමාරු සහ වාචාල නිර්භීතකමෙන් ආවරණය කරන ලද ව්‍යුහාත්මක බල රහිතභාවය අඩුය.",
  "Why They Look Powerless": "ඔවුන් බල රහිත ලෙස පෙනෙන්නේ ඇයි?",
  "The ICC Trap: The 2023 suspension taught every Sri Lankan politician the same lesson: touch SLC, get suspended by ICC, lose cricket, face public backlash. The ICC&apos;s &quot;no government interference&quot; rule was designed to protect boards from authoritarian governments — but in practice, it protects corrupt boards from democratic accountability.": "ICC උගුල: 2023 අත්හිටුවීම සෑම ශ්‍රී ලාංකික දේශපාලනඥයෙකුටම එකම පාඩමක් ඉගැන්වීය: SLC ස්පර්ශ කරන්න, ICC විසින් අත්හිටුවන්න, ක්‍රිකට් පරාජය කරන්න, මහජන ප්‍රතිචාරවලට මුහුණ දෙන්න. ICC හි \"රජයේ ඇඟිලි ගැසීම් නැත\" රීතිය නිර්මාණය කර ඇත්තේ ඒකාධිපති ආණ්ඩු වලින් මණ්ඩල ආරක්ෂා කිරීම සඳහා ය - නමුත් ප්‍රායෝගිකව, එය දූෂිත මණ්ඩල ප්‍රජාතන්ත්‍රවාදී වගවීමෙන් ආරක්ෂා කරයි.",
  "Legal Fortification: SLC operates under a specific act of parliament (Sri Lanka Cricket Act) and its elections are conducted under defined rules. Changing these rules requires legislative action, which is slow, contested, and gives SLC time to mobilise legal challenges.": "නීතිමය ශක්තිමත් කිරීම: ශ්‍රී ලංකා ක්‍රිකට් ආයතනය ක්‍රියාත්මක වන්නේ නිශ්චිත පාර්ලිමේන්තු පනතක් (ශ්‍රී ලංකා ක්‍රිකට් පනත) යටතේ වන අතර එහි මැතිවරණ පවත්වනු ලබන්නේ නිශ්චිත නීති යටතේ ය. මෙම නීති වෙනස් කිරීම සඳහා නීතිමය ක්‍රියාමාර්ග අවශ්‍ය වන අතර එය මන්දගාමී, විවාදාත්මක වන අතර නීතිමය අභියෝග බලමුලු ගැන්වීමට ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට කාලය ලබා දෙයි.",
  "Political Prioritisation: The NPP inherited an economy in crisis — IMF program compliance, debt restructuring, public service reform. Cricket reform is politically symbolic but economically irrelevant. With limited political capital, it gets deprioritised.": "දේශපාලන ප්‍රමුඛතාවය: ජාතික මහජන බැංකුවට අර්බුදයක ආර්ථිකයක් උරුම විය - IMF වැඩසටහන් අනුකූලතාව, ණය ප්‍රතිව්‍යුහගත කිරීම, රාජ්‍ය සේවා ප්‍රතිසංස්කරණ. ක්‍රිකට් ප්‍රතිසංස්කරණය දේශපාලනික වශයෙන් සංකේතාත්මක නමුත් ආර්ථික වශයෙන් අදාළ නොවේ. සීමිත දේශපාලන ප්‍රාග්ධනයක් සමඟ, එය ප්‍රමුඛතාවය අහිමි වේ.",
  "The Ironic Precedent: Former Sports Minister Mahindananda Aluthgamage was sentenced to 20 years in prison in May 2025 — but for corruption unrelated to cricket reform. The NPP&apos;s anti-corruption drive is real but hasn&apos;t been directed at SLC specifically.": "උත්ප්‍රාසාත්මක පූර්වාදර්ශය: හිටපු ක්‍රීඩා අමාත්‍ය මහින්දානන්ද අලුත්ගමගේට 2025 මැයි මාසයේදී වසර 20 ක සිර දඬුවමක් නියම විය - නමුත් ක්‍රිකට් ප්‍රතිසංස්කරණයට සම්බන්ධ නොවන දූෂණ චෝදනා මත. NPP හි දූෂණ විරෝධී මෙහෙයුම සැබෑ නමුත් විශේෂයෙන් ශ්‍රී ලංකා ක්‍රිකට් ආයතනය වෙත යොමු කර නොමැත.",
  "09 — Breaking the Deadlock": "09 — අවහිරතා බිඳ දැමීම",
  "Restructuring Options & How to Navigate the ICC": "ප්‍රතිව්‍යුහගත කිරීමේ විකල්ප සහ ICC හි සැරිසැරීම කරන්නේ කෙසේද",
  "If the NPP government had the political will, how could they &quot;defeat&quot; the mafia hold without triggering ICC sanctions? A strategic playbook.": "NPP රජයට දේශපාලනික කැමැත්තක් තිබුණා නම්, ICC සම්බාධක පැනවීමකින් තොරව මාෆියා පාලනය \"පරාජය\" කරන්නේ කෙසේද? උපායමාර්ගික ක්‍රීඩා පොතක්.",
  "Australia Model": "ඕස්ට්‍රේලියානු ආකෘතිය",
  "6 state associations with autonomy": "ස්වයං පාලනයක් සහිත රාජ්‍ය සංගම් 6ක්",
  "CA Board: 4 independent + 6 state directors": "CA මණ්ඩලය: ස්වාධීන 4ක් + රාජ්‍ය අධ්‍යක්ෂවරුන් 6ක්",
  "Sheffield Shield as elite first-class competition": "ෂෙෆීල්ඩ් පලිහ ප්‍රභූ පළමු පෙළ තරඟයක් ලෙස",
  "Decentralised grassroots-to-national pathway": "විමධ්‍යගත බිම් මට්ටමේ සිට ජාතික දක්වා මාර්ගය",
  "BBL as commercial driver and finishing school": "වාණිජ රියදුරු සහ නිම කිරීමේ පාසල ලෙස BBL",
  "India (BCCI) Model": "ඉන්දියානු (BCCI) ආකෘතිය",
  "State cricket associations elect BCCI president": "රාජ්‍ය ක්‍රිකට් සංගම් BCCI සභාපතිවරයා තෝරා පත් කර ගනී",
  "5 geographic zones, 38 regional teams": "භූගෝලීය කලාප 5ක්, කලාපීය කණ්ඩායම් 38ක්",
  "Ranji Trophy as elite domestic competition": "රංජි කුසලානය ප්‍රභූ දේශීය තරඟයක් ලෙස",
  "NCA in Bangalore — world-class academy": "බැංගලෝරයේ NCA — ලෝක මට්ටමේ ඇකඩමිය",
  "IPL as financial engine and player development": "ක්‍රීඩක සංවර්ධනය සහ මූල්‍ය එන්ජිම ලෙස IPL",
  "England (ECB) Model": "එංගලන්ත (ECB) ආකෘතිය",
  "18 first-class counties with deep tradition": "ගැඹුරු සම්ප්‍රදායන් සහිත පළමු පන්තියේ ප්‍රාන්ත 18ක්",
  "Multi-division County Championship": "බහු අංශ ප්‍රාන්ත ශූරතාවලිය",
  "The Hundred as commercial format": "වාණිජ ආකෘතියක් ලෙස ද හන්ඩ්රඩ්",
  "Professional women's tier system (Project Darwin)": "වෘත්තීය කාන්තා ස්ථර පද්ධතිය (ඩාවින් ව්‍යාපෘතිය)",
  "Strong regional club infrastructure": "ශක්තිමත් කලාපීය සමාජ යටිතල පහසුකම්",
  "Sri Lanka (Current)": "ශ්‍රී ලංකාව (වර්තමානය)",
  "Centralized board with captured club voting": "අල්ලා ගත් සමාජ ශාලා ඡන්දය සහිත මධ්‍යගත පුවරුව",
  "Weak provincial system, urban-centric": "දුර්වල පළාත් පද්ධතිය, නාගරික කේන්ද්‍රීය",
  "LPL plagued by corruption allegations": "LPL දූෂණ චෝදනාවලින් පීඩා විඳිති",
  "Brain Centre recently relocated (nascent analytics)": "මොළ මධ්‍යස්ථානය මෑතකදී නැවත ස්ථානගත කරන ලදී (නව විශ්ලේෂණ)",
  "No genuine regional development pathway": "සැබෑ ප්‍රාදේශීය සංවර්ධන මාවතක් නොමැත.",
  "The Strategic Playbook: How a Savvy Politician Navigates This": "උපායමාර්ගික ක්‍රීඩා පොත: දක්ෂ දේශපාලනඥයෙක් මෙය හසුරුවන ආකාරය",
  "The key insight is that the ICC prohibits government interference in board governance — but it does not prohibit governments from changing the legal framework under which boards operate. This is the critical distinction.": "ප්‍රධාන අවබෝධය නම්, ICC මණ්ඩලය මණ්ඩල පාලනයට රජයේ මැදිහත්වීම තහනම් කරන බවයි - නමුත් මණ්ඩල ක්‍රියාත්මක වන නීතිමය රාමුව වෙනස් කිරීම රජයන්ට තහනම් නොකරයි. මෙය තීරණාත්මක වෙනසයි.",
  "Phase 1: Legislative Reform (Months 1-6)": "අදියර 1: ව්‍යවස්ථාදායක ප්‍රතිසංස්කරණ (මාස 1-6)",
  "Amend the Sri Lanka Cricket Act in parliament to mandate: (a) a provincial-based membership structure replacing the current club-based voting system, (b) mandatory inclusion of former international cricketers on the board, (c) independent financial auditing by a designated body, and (d) term limits for the presidency (max 2 terms). Frame this as &quot;modernising the governance framework&quot; — not removing the board. The ICC has explicitly supported governance reform in other contexts (BCCI's Lodha Committee reforms were mandated by India's Supreme Court and the ICC did not intervene).": "ශ්‍රී ලංකා ක්‍රිකට් පනත පාර්ලිමේන්තුවේදී සංශෝධනය කිරීම සඳහා පහත සඳහන් දෑ ඇතුළත් කරන්න: (අ) වත්මන් සමාජ පාදක ඡන්ද ක්‍රමය වෙනුවට පළාත් පාදක සාමාජික ව්‍යුහයක්, (ආ) හිටපු ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩකයින් මණ්ඩලයට අනිවාර්යයෙන් ඇතුළත් කිරීම, (ඇ) නම් කරන ලද ආයතනයක් විසින් ස්වාධීන මූල්‍ය විගණනය කිරීම සහ (ඈ) ජනාධිපති ධුරය සඳහා කාල සීමාවන් (උපරිම වාර 2). මෙය \"පාලන රාමුව නවීකරණය කිරීම\" ලෙස සකසන්න - මණ්ඩලය ඉවත් කිරීම නොවේ. ICC වෙනත් සන්දර්භයන්හිදී පාලන ප්‍රතිසංස්කරණ සඳහා පැහැදිලිවම සහාය දක්වා ඇත (BCCI හි ලෝඩා කමිටු ප්‍රතිසංස්කරණ ඉන්දියාවේ ශ්‍රේෂ්ඨාධිකරණය විසින් නියම කරන ලද අතර ICC මැදිහත් නොවීය).",
  "Phase 2: Provincial Cricket Boards (Months 6-18)": "අදියර 2: පළාත් ක්‍රිකට් මණ්ඩල (මාස 6-18)",
  "Establish 9 Provincial Cricket Associations (matching Sri Lanka's 9 provinces) as the new member bodies of SLC. Each PCA runs its own domestic competitions, academies, and coaching programs. These PCAs — not captured cricket clubs — elect the SLC president and board. This structurally dismantles the club-based patronage network.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ නව සාමාජික ආයතන ලෙස පළාත් ක්‍රිකට් සංගම් 9ක් (ශ්‍රී ලංකාවේ පළාත් 9ට ගැලපෙන) ස්ථාපිත කරන්න. සෑම PCA එකක්ම තමන්ගේම දේශීය තරඟ, ඇකඩමි සහ පුහුණු වැඩසටහන් පවත්වාගෙන යයි. අල්ලා ගන්නා ලද ක්‍රිකට් සමාජ නොව මෙම PCA විසින් SLC සභාපතිවරයා සහ මණ්ඩලය තෝරා පත් කර ගනී. මෙය සමාජ පාදක අනුග්‍රාහක ජාලය ව්‍යුහාත්මකව බිඳ දමයි.",
  "Phase 3: ICC Engagement (Concurrent)": "අදියර 3: ICC සහභාගීත්වය (සමගාමී)",
  "Before any legislative action, engage the ICC proactively. Present the reforms as &quot;anti-corruption measures aligned with ICC governance best practices.&quot; Invite ICC governance advisors to consult on the legislation. Make the ICC a partner in reform rather than an adversary. The ICC's preference is always for good governance — they suspended Sri Lanka reluctantly in 2023 and would welcome structural improvements.": "ඕනෑම ව්‍යවස්ථාදායක ක්‍රියාමාර්ගයකට පෙර, ICC සමඟ කල්තියා සම්බන්ධ වන්න. ප්‍රතිසංස්කරණ \"ICC පාලන හොඳම භාවිතයන් සමඟ සමපාත වන දූෂණ විරෝධී පියවර\" ලෙස ඉදිරිපත් කරන්න. නීති සම්පාදනය පිළිබඳව උපදෙස් ලබා ගැනීමට ICC පාලන උපදේශකයින්ට ආරාධනා කරන්න. ICC ප්‍රතිවාදියෙකු නොව ප්‍රතිසංස්කරණයේ හවුල්කරුවෙකු කරන්න. ICC හි මනාපය සැමවිටම යහපාලනයයි - ඔවුන් 2023 දී ශ්‍රී ලංකාව අකමැත්තෙන් වුවද අත්හිටුවන ලද අතර ව්‍යුහාත්මක වැඩිදියුණු කිරීම් සාදරයෙන් පිළිගනු ඇත.",
  "Phase 4: Financial Transparency (Months 12-24)": "අදියර 4: මූල්‍ය විනිවිදභාවය (මාස 12-24)",
  "Mandate that all SLC financial transactions above a threshold are published publicly. Create an independent Cricket Ombudsman with investigative powers. This doesn't &quot;interfere&quot; with cricket governance — it creates accountability infrastructure.": "සීමාවකට වඩා වැඩි සියලුම ශ්‍රී ලංකා ක්‍රිකට් මූල්‍ය ගනුදෙනු ප්‍රසිද්ධියේ ප්‍රකාශයට පත් කිරීමට නියෝග කරන්න. විමර්ශන බලතල සහිත ස්වාධීන ක්‍රිකට් ඔම්බුඩ්ස්මන්වරයෙකු නිර්මාණය කරන්න. මෙය ක්‍රිකට් පාලනයට \"බාධා\" නොකරයි - එය වගවීමේ යටිතල පහසුකම් නිර්මාණය කරයි.",
  "The BCCI Precedent — Why This Can Work": "BCCI පූර්වාදර්ශය - මෙය ක්‍රියාත්මක විය හැක්කේ ඇයි?",
  "In 2016, India's Supreme Court appointed the Lodha Committee which mandated sweeping reforms to the BCCI: age limits, term limits, cooling-off periods, one-state-one-vote. The ICC did NOT suspend India, despite this being government (judicial) intervention. Why? Because the reforms were transparently aimed at better governance, not political capture. If Sri Lanka frames its reforms correctly — and engages the ICC early — the same logic applies. The ICC's real concern is governments installing puppet boards, not governments improving governance.": "2016 දී, ඉන්දියාවේ ශ්‍රේෂ්ඨාධිකරණය ලෝධා කමිටුව පත් කළ අතර එය BCCI හි පුළුල් ප්‍රතිසංස්කරණ සඳහා නියෝග කළේය: වයස් සීමාවන්, වාර සීමාවන්, සිසිලන කාල සීමාවන්, එක්-රාජ්‍ය-එක්-ඡන්දය. මෙය රජයේ (අධිකරණ) මැදිහත්වීමක් වුවද, ICC ඉන්දියාව අත්හිටුවුවේ නැත. ඇයි? ප්‍රතිසංස්කරණ විනිවිදභාවයෙන් යුතුව දේශපාලනික අල්ලා ගැනීම නොව වඩා හොඳ පාලනයක් අරමුණු කරගත් බැවිනි. ශ්‍රී ලංකාව එහි ප්‍රතිසංස්කරණ නිවැරදිව සකස් කරන්නේ නම් - සහ ICC සමඟ කලින් සම්බන්ධ වන්නේ නම් - එම තර්කයම අදාළ වේ. ICC හි සැබෑ කනස්සල්ල වන්නේ ආණ්ඩු පාලනය වැඩිදියුණු කිරීම නොව රූකඩ පුවරු ස්ථාපනය කිරීමයි.",
  "10 — Game Theory Analysis": "10 — ක්‍රීඩා න්‍යාය විශ්ලේෂණය",
  "Strategic Scenario Modelling": "උපායමාර්ගික අවස්ථා ආකෘති නිර්මාණය",
  "Analysing the reform options through a game theory lens: payoffs, risks, and Nash equilibria for key stakeholders.": "ක්‍රීඩා න්‍යාය කාචයක් හරහා ප්‍රතිසංස්කරණ විකල්ප විශ්ලේෂණය කිරීම: ප්‍රධාන කොටස්කරුවන් සඳහා ප්‍රතිලාභ, අවදානම් සහ නැෂ් සමතුලිතතාවය.",
  "The Players in the Game": "ක්‍රීඩාවේ ක්‍රීඩකයින්",
  "Player A: NPP Government (wants anti-corruption credentials, fears ICC suspension backlash)": "ක්‍රීඩකයා A: NPP රජය (දූෂණ විරෝධී සහතික අවශ්‍යයි, ICC අත්හිටුවීමේ ප්‍රතිවිරෝධතාවලට බිය වේ)",
  "Player B: SLC Board / &quot;Mafia&quot; (wants to retain power and financial flows)": "ක්‍රීඩකයා B: SLC මණ්ඩලය / \"මාෆියාව\" (බලය සහ මූල්‍ය ප්‍රවාහ රඳවා ගැනීමට අවශ්‍යයි)",
  "Player C: ICC (wants stable, autonomous governance; fears government capture)": "ක්‍රීඩකයා C: ICC (ස්ථාවර, ස්වාධීන පාලනයක් අවශ්‍යයි; රජය අල්ලා ගැනීමට බිය වේ)",
  "Player D: Fans/Public (wants winning cricket; short-term emotional, long-term disengaged)": "ක්‍රීඩකයා D: රසිකයන්/මහජනතාව (ක්‍රිකට් ජයග්‍රහණය කිරීමට අවශ්‍යයි; කෙටි කාලීන චිත්තවේගීය, දිගු කාලීනව විසන්ධි වී ඇත)",
  "Scenario": "දර්ශනය",
  "NPP Action": "NPP ක්‍රියාව",
  "SLC Response": "ශ්‍රී ලංකා ක්‍රිකට් ප්‍රතිචාරය",
  "ICC Response": "ICC ප්‍රතිචාරය",
  "Outcome": "ප්රතිඵලය",
  "Payoff": "ගෙවා දැමුවා",
  "1. Status Quo": "1. පවතින තත්ත්වය",
  "Do nothing": "කිසිවක් නොකරන්න",
  "Continues as-is": "එලෙසම පවතී",
  "No action": "ක්‍රියාමාර්ගයක් නැත",
  "Continued decline, fan disillusionment, NPP loses reform credibility": "අඛණ්ඩ පරිහානිය, රසික කලකිරීම, NPP ප්‍රතිසංස්කරණ විශ්වසනීයත්වය නැති කරයි",
  "Low for all except SLC Board": "ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය හැර අන් සියල්ලටම අඩුයි.",
  "2. Direct Intervention (2023 repeat)": "2. සෘජු මැදිහත්වීම (2023 පුනරාවර්තනය)",
  "Remove board by executive order": "විධායක නියෝගයක් මගින් මණ්ඩලය ඉවත් කරන්න",
  "Court challenge + ICC appeal": "අධිකරණ අභියෝගය + ICC අභියාචනය",
  "Suspension (immediate)": "අත්හිටුවීම (ක්ෂණික)",
  "ICC ban, international isolation, public backlash against government": "ICC තහනම, ජාත්‍යන්තර හුදකලාව, රජයට එරෙහි මහජන ප්‍රතිචාරය",
  "Catastrophic for all": "සැමට විනාශකාරීයි",
  "3. Legislative Reform (recommended)": "3. ව්‍යවස්ථාදායක ප්‍රතිසංස්කරණ (නිර්දේශිත)",
  "Amend SLC Act for provincial structure + term limits": "පළාත් ව්‍යුහය + කාල සීමාවන් සඳහා SLC පනත සංශෝධනය කරන්න.",
  "Legal challenges, lobbying": "නීතිමය අභියෝග, බලපෑම්",
  "Neutral to positive (if consulted early)": "මධ්‍යස්ථ සිට ධනාත්මක දක්වා (කලින් උපදෙස් ලබා ගත්තේ නම්)",
  "Structural dismantling of patronage; 12-18 month transition; SLC board fights but loses legal basis": "අනුග්‍රාහකත්වය ව්‍යුහාත්මකව බිඳ දැමීම; මාස 12-18 සංක්‍රාන්තිය; ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය සටන් කරයි, නමුත් නීතිමය පදනම අහිමි වේ.",
  "High for Govt, Public, Cricket. Low for SLC Mafia": "රජයට, මහජනතාවට, ක්‍රිකට් වලට ඉහළයි. ශ්‍රී ලංකා ක්‍රිකට් මාෆියාවට පහළයි.",
  "4. ICC-Partnered Reform": "4. ICC-හවුල්කාර ප්‍රතිසංස්කරණය",
  "Invite ICC governance review; implement recommendations": "ICC පාලන සමාලෝචනයට ආරාධනා කරන්න; නිර්දේශ ක්‍රියාත්මක කරන්න.",
  "Cannot resist ICC-endorsed reforms": "ICC අනුමත කළ ප්‍රතිසංස්කරණවලට විරුද්ධ විය නොහැක.",
  "Actively supports": "ක්‍රියාකාරීව සහාය දක්වයි",
  "Reform with ICC legitimacy shield. Slower but politically safe.": "ICC නීත්‍යානුකූලභාවය පලිහක් සහිත ප්‍රතිසංස්කරණය. මන්දගාමී නමුත් දේශපාලනික වශයෙන් ආරක්ෂිතයි.",
  "High for all except SLC incumbents": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ වත්මන් නිලධාරීන් හැර අන් සියල්ලන්ටම ඉහළයි.",
  "5. Financial Transparency Only": "5. මූල්‍ය විනිවිදභාවය පමණි",
  "Mandate public auditing of SLC finances": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ මූල්‍ය කටයුතු පිළිබඳ මහජන විගණනය අනිවාර්ය කිරීම.",
  "Compliance (difficult to resist transparency)": "අනුකූලතාව (විනිවිදභාවයට එරෙහි වීම දුෂ්කර)",
  "Neutral (not governance interference)": "මධ්‍යස්ථ (පාලන මැදිහත්වීම නොවේ)",
  "Exposes financial irregularities; creates pressure for board change; board may still survive": "මූල්‍ය අක්‍රමිකතා හෙළිදරව් කරයි; අධ්‍යක්ෂ මණ්ඩලය වෙනස් කිරීම සඳහා පීඩනයක් ඇති කරයි; මණ්ඩලය තවමත් පැවතිය හැකිය",
  "Medium — exposes but doesn't replace": "මධ්‍යම — නිරාවරණය කරයි නමුත් ප්‍රතිස්ථාපනය නොකරයි",
  "6. Hybrid: 3+4+5": "6. දෙමුහුන්: 3+4+5",
  "Legislative reform + ICC partnership + mandatory auditing": "නීති ප්‍රතිසංස්කරණ + ICC හවුල්කාරිත්වය + අනිවාර්ය විගණනය",
  "Multi-front resistance but weakened legal position": "බහු-පෙරමුණු ප්‍රතිරෝධය නමුත් දුර්වල වූ නීතිමය තත්ත්වය",
  "Supportive (comprehensive approach)": "සහායක (විස්තීර්ණ ප්‍රවේශය)",
  "Most robust: legal basis for restructuring, ICC cover, financial accountability. Takes 18-24 months.": "වඩාත්ම ශක්තිමත්: ප්‍රතිව්‍යුහගත කිරීම සඳහා නීතිමය පදනම, ICC ආවරණය, මූල්‍ය වගවීම. මාස 18-24ක් ගතවේ.",
  "Optimal Nash Equilibrium": "ප්‍රශස්ත නැෂ් සමතුලිතතාවය",
  "Nash Equilibrium": "නැෂ් සමතුලිතතාවය",
  "Scenario 6 (Hybrid) represents the Nash Equilibrium — the point where no single player can improve their position by unilaterally changing strategy. The government gets reform credentials, the ICC gets better governance, the public gets accountability, and the SLC &quot;mafia&quot; loses its structural advantages without triggering international sanctions. The only loser is the corrupt status quo.": "6 වන අවස්ථාව (දෙමුහුන්) නැෂ් සමතුලිතතාවය නියෝජනය කරයි - ඒකපාර්ශ්විකව උපාය මාර්ග වෙනස් කිරීමෙන් කිසිදු තනි ක්‍රීඩකයෙකුට තම ස්ථානය වැඩිදියුණු කළ නොහැකි ස්ථානය. රජයට ප්‍රතිසංස්කරණ අක්තපත්‍ර ලැබේ, ICC ය වඩා හොඳ පාලනයක් ලබා ගනී, මහජනතාවට වගවීම ලැබේ, සහ SLC \"මාෆියාව\" ජාත්‍යන්තර සම්බාධක පැනවීමකින් තොරව එහි ව්‍යුහාත්මක වාසි අහිමි කරයි. එකම පරාජිතයා වන්නේ දූෂිත තත්ත්වයයි.",
  "The SLC Board's Best Response": "ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලයේ හොඳම ප්‍රතිචාරය",
  "The rational move for the SLC &quot;mafia&quot; under Scenario 6 is to co-opt the reform process — appear to cooperate while lobbying to water down the legislation. They would likely (a) challenge term limits in court as unconstitutional, (b) argue provincial boards are &quot;too expensive&quot; to establish, (c) use their ACC/ICC relationships to frame government action as interference, and (d) mobilise their club network to protest reforms as &quot;destroying grassroots cricket.&quot;": "6 වන අවස්ථාව යටතේ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ \"මාෆියාව\" සඳහා තාර්කික පියවර වන්නේ ප්‍රතිසංස්කරණ ක්‍රියාවලියට සහයෝගය දැක්වීමයි - නීති සම්පාදනය දුර්වල කිරීමට බලපෑම් කරන අතරතුර සහයෝගය දක්වන බව පෙනේ. ඔවුන් (අ) ව්‍යවස්ථා විරෝධී ලෙස උසාවියේදී කාල සීමාවන්ට අභියෝග කරනු ඇත, (ආ) පළාත් මණ්ඩල ස්ථාපිත කිරීමට \"ඉතා මිල අධික\" බව තර්ක කරනු ඇත, (ඇ) රජයේ ක්‍රියාමාර්ග මැදිහත්වීමක් ලෙස සැකසීමට ඔවුන්ගේ ACC/ICC සබඳතා භාවිතා කරනු ඇත, සහ (ඈ) \"බිම් මට්ටමේ ක්‍රිකට් විනාශ කිරීම\" ලෙස ප්‍රතිසංස්කරණවලට විරෝධය දැක්වීමට ඔවුන්ගේ සමාජ ජාලය බලමුලු ගන්වනු ඇත.",
  "The government's counter-strategy must be: speed and comprehensiveness. Pass the legislative package before legal challenges can crystallise. Use the NPP's 159-seat supermajority to move quickly. Have ICC consultation documented before the bill is tabled. Make the reform irreversible within one parliamentary session.": "රජයේ ප්‍රති-උපායමාර්ගය විය යුත්තේ: වේගය සහ පුළුල් බව. නීතිමය අභියෝග ස්ඵටිකීකරණය වීමට පෙර ව්‍යවස්ථාදායක පැකේජය සම්මත කරන්න. ඉක්මනින් පියවර ගැනීමට NPP හි ආසන 159 කින් යුත් සුපිරි බහුතරය භාවිතා කරන්න. පනත් කෙටුම්පත සභාගත කිරීමට පෙර ICC උපදේශනය ලේඛනගත කරන්න. එක් පාර්ලිමේන්තු සැසියක් තුළ ප්‍රතිසංස්කරණ ආපසු හැරවිය නොහැකි බවට පත් කරන්න.",
  "11 — The Skills Gap & Analytics Deficit": "11 — කුසලතා පරතරය සහ විශ්ලේෂණ හිඟය",
  "Fielding, Patience, Game-Reading & The Data Desert": "පන්දු රැකීම, ඉවසීම, ක්‍රීඩා කියවීම සහ දත්ත කාන්තාරය",
  "Sri Lanka recently hired India's former fielding coach R. Sridhar for a 10-day program. Australia has permanent analytics departments with real-time data. That gap tells the entire story.": "ශ්‍රී ලංකාව මෑතකදී ඉන්දියාවේ හිටපු පන්දු රැකීමේ පුහුණුකරු ආර්. ශ්‍රීධර් මහතා දින 10 ක වැඩසටහනක් සඳහා බඳවා ගත්තා. ඕස්ට්‍රේලියාවේ තත්‍ය කාලීන දත්ත සහිත ස්ථිර විශ්ලේෂණ දෙපාර්තමේන්තු තිබෙනවා. ඒ පරතරය මුළු කතාවම කියනවා.",
  "🎯 Fielding": "🎯 පන්දු රැකීම",
  "SLC hired R. Sridhar (India's former fielding coach) for a 10-day program in May 2025. India had Sridhar embedded for 7 years across 300+ international matches. The comparison: Sri Lanka gets a masterclass; India gets a system. SLC also hired Anton Roux as permanent fielding coach, but institutional depth remains lacking.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනය 2025 මැයි මාසයේදී දින 10ක වැඩසටහනක් සඳහා ආර්. ශ්‍රීධර් (ඉන්දියාවේ හිටපු පන්දු රැකීමේ පුහුණුකරු) බඳවා ගත්තේය. ඉන්දියාව ජාත්‍යන්තර තරඟ 300කට අධික සංඛ්‍යාවක් හරහා වසර 7ක් ශ්‍රීධර්ව ඇතුළත් කළේය. සංසන්දනය: ශ්‍රී ලංකාවට මාස්ටර් පන්තියක් ලැබේ; ඉන්දියාවට පද්ධතියක් ලැබේ. ශ්‍රී ලංකා ක්‍රිකට් ආයතනය ස්ථිර පන්දු රැකීමේ පුහුණුකරු ලෙස ඇන්ටන් රූක්ස් ද බඳවා ගත් නමුත් ආයතනික ගැඹුර තවමත් අඩුය.",
  "📊 Analytics": "📊 විශ්ලේෂණ",
  "SLC's &quot;Brain Centre&quot; was recently relocated to the High Performance Centre in Colombo — a positive step. But compare this to Australia's dedicated data science teams, England's CricViz partnership, or India's multi-million dollar analytics infrastructure. Sri Lanka is at least 5-7 years behind in data-driven decision-making for team selection, match strategy, and player development.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ \"මොළ මධ්‍යස්ථානය\" මෑතකදී කොළඹ ඉහළ කාර්ය සාධන මධ්‍යස්ථානයට ගෙන යන ලදී - එය ධනාත්මක පියවරකි. නමුත් මෙය ඕස්ට්‍රේලියාවේ කැපවූ දත්ත විද්‍යා කණ්ඩායම්, එංගලන්තයේ CricViz හවුල්කාරිත්වය හෝ ඉන්දියාවේ ඩොලර් මිලියන ගණනක විශ්ලේෂණ යටිතල පහසුකම් සමඟ සසඳන්න. කණ්ඩායම් තේරීම, තරඟ උපාය මාර්ග සහ ක්‍රීඩක සංවර්ධනය සඳහා දත්ත මත පදනම් වූ තීරණ ගැනීමේදී ශ්‍රී ලංකාව අවම වශයෙන් වසර 5-7ක් පසුපසින් සිටී.",
  "🕐 Patience & Game Management": "🕐 ඉවසීම සහ ක්‍රීඩා කළමනාකරණය",
  "The collapse from 84/6 to 168/7 against NZ, and the inability to construct a chase of 169, reveal a fundamental game management deficit. T20 cricket rewards boldness but also requires situational awareness — when to attack, when to rotate. Sri Lanka's batters either block or blast, with no intermediate gears. This is a coaching and mentoring gap, not a talent gap.": "නවසීලන්තයට එරෙහිව 84/6 සිට 168/7 දක්වා බිඳ වැටීම සහ 169 ක හඹා යාමක් ගොඩනඟා ගැනීමට නොහැකි වීම, මූලික ක්‍රීඩා කළමනාකරණ හිඟයක් හෙළි කරයි. විස්සයි20 ක්‍රිකට් ක්‍රීඩාව නිර්භීතකමට විපාක දෙන නමුත් තත්ත්‍ව දැනුවත්භාවය ද අවශ්‍ය වේ - පහර දිය යුත්තේ කවදාද, කවදා භ්‍රමණය විය යුතුද යන්න. ශ්‍රී ලංකාවේ පිතිකරුවන් අතරමැදි ආම්පන්න නොමැතිව අවහිර කිරීම හෝ පිපිරවීම සිදු කරයි. මෙය පුහුණුකරු සහ උපදේශක පරතරයක් මිස දක්ෂතා පරතරයක් නොවේ.",
  "🔄 Playing Spin": "🔄 ක්‍රීඩා භ්‍රමණය",
  "Ironic for a nation that produced Muralitharan: Rachin Ravindra's part-time left-arm spin took 4/27 to destroy Sri Lanka's batting. Playing spin requires footwork, reading variations, and shot selection under pressure — skills that require specific practice against quality spinners. The domestic cricket system doesn't provide enough high-quality spin exposure because domestic pitches increasingly favour pace.": "මුරලිදරන් බිහි කළ ජාතියකට උත්ප්‍රාසාත්මකයි: රචින් රවීන්ද්‍රගේ අර්ධකාලීන වමත් දඟ පන්දු යැවීම ශ්‍රී ලංකාවේ පිතිකරණය විනාශ කිරීමට 4/27ක් ලබා ගත්තේය. දඟ පන්දු යැවීමේදී පාද චලනය, කියවීමේ වෙනස්කම් සහ පීඩනය යටතේ පහර තේරීම අවශ්‍ය වේ - ගුණාත්මක දඟ පන්දු යවන්නන්ට එරෙහිව නිශ්චිත පුහුණුවක් අවශ්‍ය කුසලතා. දේශීය ක්‍රිකට් ක්‍රමය ප්‍රමාණවත් තරම් උසස් තත්ත්වයේ දඟ පන්දු නිරාවරණයක් ලබා නොදෙන්නේ දේශීය තණතීරු වැඩි වැඩියෙන් වේගයට හිතකර වන බැවිනි.",
  "🧠 Mental Conditioning": "🧠 මානසික තත්ත්වය",
  "Perhaps the single biggest gap. Australia employs full-time sports psychologists embedded with every team. India's NCA has a dedicated mental conditioning program. Sri Lanka has no publicly known permanent sports psychology infrastructure for the national team. In a country where social media abuse is pervasive, this is an existential gap.": "සමහරවිට විශාලතම තනි පරතරය විය හැකිය. ඕස්ට්‍රේලියාව සෑම කණ්ඩායමකම පූර්ණ කාලීන ක්‍රීඩා මනෝවිද්‍යාඥයින් යොදවයි. ඉන්දියාවේ NCA සතුව කැපවූ මානසික සමීකරණ වැඩසටහනක් ඇත. ශ්‍රී ලංකාවේ ජාතික කණ්ඩායම සඳහා ප්‍රසිද්ධියේ දන්නා ස්ථිර ක්‍රීඩා මනෝවිද්‍යා යටිතල පහසුකම් නොමැත. සමාජ මාධ්‍ය අපයෝජනය බහුලව පවතින රටක, මෙය පැවැත්මේ පරතරයකි.",
  "📈 Holistic Game Vision": "📈 හොලිස්ටික් ක්‍රීඩා දැක්ම",
  "The golden-era players could &quot;see&quot; a game as a unified whole — batting, bowling, and fielding as interconnected strategies. Today's players are specialists in silos. This stems from T20-focused development where &quot;one skill&quot; is rewarded by franchise leagues. Correcting this requires deliberate multi-format exposure and coaching that teaches game scenarios, not just skills.": "ස්වර්ණමය යුගයේ ක්‍රීඩකයින්ට ක්‍රීඩාවක් ඒකාබද්ධ සමස්තයක් ලෙස \"දැකිය\" හැකිය - පිතිකරණය, පන්දු යැවීම සහ පන්දු රැකීම අන්තර් සම්බන්ධිත උපාය මාර්ග ලෙස. අද ක්‍රීඩකයින් සිලෝස් පිළිබඳ විශේෂඥයින් වේ. මෙය ෆ්‍රැන්චයිස් ලීග මගින් \"එක් කුසලතාවයකට\" විපාක දෙන T20 කේන්ද්‍ර කරගත් සංවර්ධනයෙන් පැන නගී. මෙය නිවැරදි කිරීම සඳහා කුසලතා පමණක් නොව, ක්‍රීඩා අවස්ථා උගන්වන හිතාමතා බහු-ආකෘති නිරාවරණය සහ පුහුණු කිරීම අවශ්‍ය වේ.",
  "Are Sri Lankans Using Analytics Properly?": "ශ්‍රී ලාංකිකයන් විශ්ලේෂණ නිවැරදිව භාවිතා කරනවාද?",
  "Short answer: No. The Brain Centre relocation is a start, but analytics in cricket is not about having a room with computers — it's about having data scientists embedded in coaching decisions, real-time match analysis fed to the captain, predictive modelling for player selection, and biomechanical analysis for injury prevention.": "කෙටි පිළිතුර: නැහැ. මොළ මධ්‍යස්ථාන ස්ථාන මාරුව ආරම්භයක්, නමුත් ක්‍රිකට් ක්‍රීඩාවේ විශ්ලේෂණ යනු පරිගණක සහිත කාමරයක් තිබීම ගැන නොවේ - එය පුහුණු තීරණවලට දත්ත විද්‍යාඥයින් ඇතුළත් කිරීම, නායකයාට තත්‍ය කාලීන තරඟ විශ්ලේෂණය, ක්‍රීඩකයින් තෝරා ගැනීම සඳහා පුරෝකථන ආකෘති නිර්මාණය සහ තුවාල වැළැක්වීම සඳහා ජෛව යාන්ත්‍රික විශ්ලේෂණය ගැන ය.",
  "Short answer: No.": "කෙටි පිළිතුර: නැත.",
  "The Brain Centre relocation is a start, but analytics in cricket is not about having a room with computers — it's about having data scientists embedded in coaching decisions, real-time match analysis fed to the captain, predictive modelling for player selection, and biomechanical analysis for injury prevention.": "මොළ මධ්‍යස්ථාන ස්ථාන මාරුව ආරම්භයක් වුවත්, ක්‍රිකට් ක්‍රීඩාවේ විශ්ලේෂණ යනු පරිගණක සහිත කාමරයක් තිබීම ගැන නොවේ - එය පුහුණු තීරණවලට දත්ත විද්‍යාඥයින් ඇතුළත් කිරීම, නායකයාට තත්‍ය කාලීන තරග විශ්ලේෂණය, ක්‍රීඩකයින් තෝරා ගැනීම සඳහා පුරෝකථන ආකෘති නිර්මාණය සහ තුවාල වැළැක්වීම සඳහා ජෛව යාන්ත්‍රික විශ්ලේෂණය ගැන ය.",
  "Australia uses Hawk-Eye data to analyse every delivery in domestic cricket. India's BCCI partners with technology companies for player tracking. England's ECB has a formal data analytics pipeline from county cricket to international selection. Sri Lanka has a recently-relocated Brain Centre and an occasional hire of foreign consultants. The gap is structural, not incidental.": "දේශීය ක්‍රිකට් ක්‍රීඩාවේ සෑම පන්දුවක්ම විශ්ලේෂණය කිරීම සඳහා ඕස්ට්‍රේලියාව හෝක්-අයි දත්ත භාවිතා කරයි. ක්‍රීඩකයින් ලුහුබැඳීම සඳහා ඉන්දියාවේ BCCI තාක්‍ෂණ සමාගම් සමඟ හවුල් වේ. එංගලන්තයේ ECB සතුව ප්‍රාන්ත ක්‍රිකට් සිට ජාත්‍යන්තර තේරීම දක්වා විධිමත් දත්ත විශ්ලේෂණ නල මාර්ගයක් ඇත. ශ්‍රී ලංකාවේ මෑතකදී ස්ථානගත කරන ලද මොළ මධ්‍යස්ථානයක් සහ විදේශීය උපදේශකයින් ඉඳහිට බඳවා ගැනීමක් ඇත. පරතරය අහම්බයක් නොව ව්‍යුහාත්මක ය.",
  "12 — The BCCI/IPL Axis": "12 — BCCI/IPL අක්ෂය",
  "India's Gravitational Pull & The Small Nation Trap": "ඉන්දියාවේ ගුරුත්වාකර්ෂණ ඇදීම සහ කුඩා ජාතියේ උගුල",
  "SL Players in IPL 2025": "2025 IPL තරඟාවලියට සහභාගී වන ශ්‍රී ලංකා ක්‍රීඩකයින් |",
  "Key SL Players Unsold at IPL Auction": "IPL වෙන්දේසියේදී අලෙවි නොවූ ශ්‍රී ලංකා ක්‍රීඩකයින්",
  "Tests Scheduled for SL in 2026": "2026 දී ශ්‍රී ලංකාවට නියමිත ටෙස්ට් තරඟ",
  "Geographic Talent Pool Actually Accessed": "භූගෝලීය කුසලතා සංචිතයට සැබවින්ම ප්‍රවේශ විය",
  "The BCCI-ICC Power Equation": "BCCI-ICC බල සමීකරණය",
  "The BCCI's financial dominance has restructured global cricket into a heliocentric model. India generates the overwhelming majority of ICC's broadcast revenue, giving the BCCI de facto veto power over governance decisions. As a February 2026 Al Jazeera analysis noted: &quot;India is inarguably the greatest cricketing superpower there ever has been.&quot; Even during the days of the Imperial Cricket Conference, Australia and England could check each other. No such checks exist against the BCCI.": "BCCI හි මූල්‍ය ආධිපත්‍යය ගෝලීය ක්‍රිකට් ක්‍රීඩාව සූර්ය කේන්ද්‍රීය ආකෘතියකට ප්‍රතිව්‍යුහගත කර ඇත. ICC හි විකාශන ආදායමෙන් අතිමහත් බහුතරයක් ඉන්දියාව විසින් ජනනය කරනු ලබන අතර, පාලන තීරණ සම්බන්ධයෙන් BCCI හට තථ්‍ය නිෂේධ බලය ලබා දෙයි. 2026 පෙබරවාරි අල් ජසීරා විශ්ලේෂණයක් සඳහන් කළ පරිදි: \"ඉන්දියාව නිසැකවම මෙතෙක් සිටි ශ්‍රේෂ්ඨතම ක්‍රිකට් සුපිරි බලවතා වේ.\" අධිරාජ්‍ය ක්‍රිකට් සමුළුව පැවති දිනවල පවා, ඕස්ට්‍රේලියාවට සහ එංගලන්තයට එකිනෙකා පරීක්ෂා කළ හැකිය. BCCI ට එරෙහිව එවැනි පරීක්ෂාවන් නොමැත.",
  "Sri Lanka has been &quot;among the BCCI's most loyal allies&quot; at the ICC for over a decade — supporting India's positions on revenue distribution, governance structures, and tournament hosting. The 2026 T20 World Cup itself illustrates the dynamic: Sri Lanka proposed hosting the entire tournament, but the expansion to 20 teams meant co-hosting with India, where the BCCI controlled the schedule, the majority of venues (5 India, 3 Sri Lanka), and the broadcast arrangements.": "ආදායම් බෙදා හැරීම, පාලන ව්‍යුහයන් සහ තරඟාවලි සත්කාරකත්වය පිළිබඳ ඉන්දියාවේ ස්ථාවරයන්ට සහාය දක්වමින් දශකයකට වැඩි කාලයක් තිස්සේ ශ්‍රී ලංකාව ICC හි \"BCCI හි වඩාත්ම පක්ෂපාතී සහචරයින් අතර\" සිටී. 2026 T20 ලෝක කුසලානයම ගතිකත්වය විදහා දක්වයි: ශ්‍රී ලංකාව මුළු තරඟාවලියම සත්කාරකත්වය සැපයීමට යෝජනා කළ නමුත් කණ්ඩායම් 20 දක්වා ව්‍යාප්ත කිරීම යනු ඉන්දියාව සමඟ සම-සත්කාරකත්වය දැරීමයි, එහිදී BCCI කාලසටහන, බහුතර ස්ථාන (ඉන්දියාව 5, ශ්‍රී ලංකාව 3) සහ විකාශන විධිවිධාන පාලනය කළේය.",
  "The reward for this loyalty? A shrinking Test calendar, diminishing bilateral series, and no protection from the BCCI's franchise expansion.": "මේ පක්ෂපාතිත්වයට ලැබෙන විපාකය? හැකිලෙන ටෙස්ට් දින දර්ශනයක්, හීන වෙමින් පවතින ද්විපාර්ශ්වික තරඟාවලි සහ BCCI හි ඡන්ද බලය පුළුල් කිරීමෙන් ආරක්ෂාවක් නොමැතිකම.",
  "The IPL Double-Edged Sword": "IPL දෙපැත්ත කැපෙන කඩුව",
  "What IPL gives: Seven Sri Lankan players earned IPL contracts in 2025, including Wanindu Hasaranga and Matheesha Pathirana. The IPL provides world-class coaching, analytics exposure, pressure-game experience, and financial security that SLC cannot match. Players who go through IPL systems return technically improved.": "IPL ලබා දෙන දේ: වනිඳු හසරංග සහ මතීෂ පතිරණ ඇතුළු ශ්‍රී ලාංකික ක්‍රීඩකයින් හත් දෙනෙකු 2025 දී IPL කොන්ත්‍රාත්තු ලබා ගත්හ. IPL මඟින් ලෝක මට්ටමේ පුහුණු කිරීම්, විශ්ලේෂණ නිරාවරණය, පීඩන-ක්‍රීඩා අත්දැකීම් සහ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට සම කළ නොහැකි මූල්‍ය ආරක්ෂාව සපයයි. IPL පද්ධති හරහා යන ක්‍රීඩකයින් තාක්ෂණිකව දියුණු ලෙස ආපසු පැමිණේ.",
  "What IPL gives:": "IPL ලබා දෙන දේ:",
  "Seven Sri Lankan players earned IPL contracts in 2025, including Wanindu Hasaranga and Matheesha Pathirana. The IPL provides world-class coaching, analytics exposure, pressure-game experience, and financial security that SLC cannot match. Players who go through IPL systems return technically improved.": "2025 දී ශ්‍රී ලාංකික ක්‍රීඩකයින් හත් දෙනෙකු IPL කොන්ත්‍රාත්තු ලබා ගත් අතර, ඒ අතර වනිඳු හසරංග සහ මතීෂ පතිරණ ද වෙති. IPL මඟින් ලෝක මට්ටමේ පුහුණු කිරීම්, විශ්ලේෂණ නිරාවරණය, පීඩන-ක්‍රීඩා අත්දැකීම් සහ ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට සම කළ නොහැකි මූල්‍ය ආරක්ෂාව සපයයි. IPL පද්ධති හරහා යන ක්‍රීඩකයින් තාක්ෂණිකව දියුණු ලෙස ආපසු පැමිණේ.",
  "What IPL takes: Players who earn millions in franchise cricket naturally prioritise those commitments. The scheduling is brutal — Sri Lanka's recent tour ended just ONE day before the IPL and PSL commenced. There is no recovery window, no preparation time for national duty. Players arrive at international series mentally and physically spent from franchise obligations.": "IPL ගන්නා දේ: ෆ්‍රැන්චයිස් ක්‍රිකට් ක්‍රීඩාවෙන් මිලියන ගණනක් උපයන ක්‍රීඩකයින් ස්වභාවිකවම එම කැපවීම් වලට ප්‍රමුඛත්වය දෙයි. කාලසටහන කුරිරුයි - ශ්‍රී ලංකාවේ මෑත සංචාරය IPL සහ PSL ආරම්භ වීමට දිනකට පෙර අවසන් විය. සුවය ලැබීමේ කවුළුවක් නැත, ජාතික රාජකාරිය සඳහා සූදානම් වීමේ කාලයක් නොමැත. ක්‍රීඩකයින් ජාත්‍යන්තර තරඟාවලිවලට පැමිණෙන්නේ ෆ්‍රැන්චයිස් වගකීම් වලින් මානසිකව හා ශාරීරිකව වෙහෙසට පත්වය.",
  "What IPL takes:": "IPL වලට ගත හැකි දේ:",
  "Players who earn millions in franchise cricket naturally prioritise those commitments. The scheduling is brutal — Sri Lanka's recent tour ended just ONE day before the IPL and PSL commenced. There is no recovery window, no preparation time for national duty. Players arrive at international series mentally and physically spent from franchise obligations.": "ෆ්‍රැන්චයිස් ක්‍රිකට් ක්‍රීඩාවෙන් මිලියන ගණනක් උපයන ක්‍රීඩකයින් ස්වභාවිකවම එම කැපවීම් වලට ප්‍රමුඛත්වය දෙයි. කාලසටහන කුරිරුයි - ශ්‍රී ලංකාවේ මෑත සංචාරය IPL සහ PSL ආරම්භ වීමට දිනකට පෙර අවසන් විය. සුවය ලැබීමේ කවුළුවක් නැත, ජාතික රාජකාරිය සඳහා සූදානම් වීමේ කාලයක් නොමැත. ක්‍රීඩකයින් ජාත්‍යන්තර තරඟාවලිවලට පැමිණෙන්නේ ෆ්‍රැන්චයිස් වගකීම් වලින් මානසිකව හා ශාරීරිකව වෙහෙසට පත්වය.",
  "The unsold signal: Kusal Mendis, Pathum Nissanka, Charith Asalanka, Dunith Wellalage, and Dasun Shanaka — key national players — went unsold at the IPL 2025 auction. This creates a psychological divide within the squad: players with IPL contracts have financial security and confidence; those unsold carry rejection and financial anxiety into national duty.": "අලෙවි නොවූ සංඥාව: කුසල් මෙන්ඩිස්, පැතුම් නිශ්ශංක, චරිත් අසලංක, දුනිත් වෙල්ලාලගේ සහ දසුන් ශානක - ප්‍රධාන ජාතික ක්‍රීඩකයින් - IPL 2025 වෙන්දේසියේදී අලෙවි නොවීය. මෙය සංචිතය තුළ මානසික බෙදීමක් ඇති කරයි: IPL කොන්ත්‍රාත්තු ඇති ක්‍රීඩකයින්ට මූල්‍ය ආරක්ෂාව සහ විශ්වාසය ඇත; අලෙවි නොවූ අය ප්‍රතික්ෂේප කිරීම සහ මූල්‍ය කාංසාව ජාතික රාජකාරියට ගෙන යයි.",
  "The unsold signal:": "අලෙවි නොවූ සංඥාව:",
  "Kusal Mendis, Pathum Nissanka, Charith Asalanka, Dunith Wellalage, and Dasun Shanaka — key national players — went unsold at the IPL 2025 auction. This creates a psychological divide within the squad: players with IPL contracts have financial security and confidence; those unsold carry rejection and financial anxiety into national duty.": "කුසල් මෙන්ඩිස්, පැතුම් නිශ්ශංක, චරිත් අසලංක, දුනිත් වෙල්ලාලගේ සහ දසුන් ශානක - ප්‍රධාන ජාතික ක්‍රීඩකයින් - IPL 2025 වෙන්දේසියේදී අලෙවි නොවීය. මෙය සංචිතය තුළ මානසික බෙදීමක් ඇති කරයි: IPL කොන්ත්‍රාත්තු ඇති ක්‍රීඩකයින්ට මූල්‍ය ආරක්ෂාව සහ විශ්වාසය ඇත; අලෙවි නොවූ අය ප්‍රතික්ෂේප කිරීම සහ මූල්‍ය කාංසාව ජාතික රාජකාරියට ගෙන යයි.",
  "The &quot;Injury&quot; Withdrawal Problem": "\"තුවාල\" ඉවත් වීමේ ගැටලුව",
  "The pattern: IPL franchises have formally recommended a two-year ban on overseas players who make themselves unavailable after being bought at auction &quot;without legitimate cause.&quot; The problem extends beyond IPL — across franchise leagues globally, players strategically withdraw from national duty citing injuries that mysteriously heal in time for lucrative franchise commitments.": "රටාව: \"නීත්‍යානුකූල හේතුවක් නොමැතිව\" වෙන්දේසියේදී මිලදී ගැනීමෙන් පසු තමන්ව ලබා ගත නොහැකි විදේශීය ක්‍රීඩකයින්ට වසර දෙකක තහනමක් IPL ෆ්‍රැන්චයිස් විසින් විධිමත් ලෙස නිර්දේශ කර ඇත. ගැටළුව IPL වලින් ඔබ්බට විහිදේ - ගෝලීය වශයෙන් ෆ්‍රැන්චයිස් ලීග හරහා, ක්‍රීඩකයින් උපායමාර්ගිකව ජාතික රාජකාරියෙන් ඉවත් වන්නේ ලාභදායී ෆ්‍රැන්චයිස් බැඳීම් සඳහා කාලය තුළ අභිරහස් ලෙස සුව වන තුවාල උපුටා දක්වමිනි.",
  "The pattern:": "රටාව:",
  "IPL franchises have formally recommended a two-year ban on overseas players who make themselves unavailable after being bought at auction &quot;without legitimate cause.&quot; The problem extends beyond IPL — across franchise leagues globally, players strategically withdraw from national duty citing injuries that mysteriously heal in time for lucrative franchise commitments.": "\"නීත්‍යානුකූල හේතුවක් නොමැතිව\" වෙන්දේසියේදී මිලදී ගැනීමෙන් පසු තමන්ව ලබා ගත නොහැකි විදේශීය ක්‍රීඩකයින්ට වසර දෙකක තහනමක් IPL ෆ්‍රැන්චයිස් විසින් නිල වශයෙන් නිර්දේශ කර ඇත. ගැටලුව IPL වලින් ඔබ්බට විහිදේ - ගෝලීය වශයෙන් ෆ්‍රැන්චයිස් ලීග හරහා, ක්‍රීඩකයින් උපායමාර්ගිකව ජාතික රාජකාරිවලින් ඉවත් වන්නේ ලාභදායී ෆ්‍රැන්චයිස් කැපවීම් සඳහා කාලයත් සමඟ අභිරහස් ලෙස සුව වන තුවාල උපුටා දක්වමිනි.",
  "Current safeguards (weak): The ICC working group has recommended a maximum of 4 overseas players in T20 franchise XIs, a minimum of 4 local players, and a 10% release fee paid to national boards when their players participate in franchise leagues. These measures are insufficient — they address symptoms, not the structural incentive problem.": "වත්මන් ආරක්ෂණ ක්‍රම (දුර්වල): ICC ක්‍රියාකාරී කණ්ඩායම T20 ෆ්‍රැන්චයිස් XI සඳහා උපරිම විදේශීය ක්‍රීඩකයින් 4 දෙනෙකු, අවම වශයෙන් දේශීය ක්‍රීඩකයින් 4 දෙනෙකු සහ ඔවුන්ගේ ක්‍රීඩකයින් ෆ්‍රැන්චයිස් ලීගවලට සහභාගී වන විට ජාතික මණ්ඩලවලට ගෙවන 10% නිදහස් කිරීමේ ගාස්තුවක් නිර්දේශ කර ඇත. මෙම පියවර ප්‍රමාණවත් නොවේ - ඒවා ව්‍යුහාත්මක දිරිගැන්වීමේ ගැටලුව නොව රෝග ලක්ෂණ ආමන්ත්‍රණය කරයි.",
  "Current safeguards (weak):": "වත්මන් ආරක්ෂණ (දුර්වල):",
  "The ICC working group has recommended a maximum of 4 overseas players in T20 franchise XIs, a minimum of 4 local players, and a 10% release fee paid to national boards when their players participate in franchise leagues. These measures are insufficient — they address symptoms, not the structural incentive problem.": "ICC ක්‍රියාකාරී කණ්ඩායම විසින් T20 ෆ්‍රැන්චයිස් XI සඳහා උපරිම වශයෙන් විදේශීය ක්‍රීඩකයින් 4 දෙනෙකු, අවම වශයෙන් දේශීය ක්‍රීඩකයින් 4 දෙනෙකු සහ ඔවුන්ගේ ක්‍රීඩකයින් ෆ්‍රැන්චයිස් ලීගවලට සහභාගී වන විට ජාතික මණ්ඩලවලට ගෙවනු ලබන 10% නිදහස් කිරීමේ ගාස්තුවක් නිර්දේශ කර ඇත. මෙම පියවර ප්‍රමාණවත් නොවේ - ඒවා ව්‍යුහාත්මක දිරිගැන්වීමේ ගැටලුව නොව රෝග ලක්ෂණ ආමන්ත්‍රණය කරයි.",
  "The Trent Boult precedent: New Zealand's Trent Boult opted out of his central contract to pursue franchise cricket with better &quot;work-life balance.&quot; For a small nation like Sri Lanka, if even one or two key players make similar choices, the national team loses irreplaceable talent. The BCCI's policy of not allowing Indian players to play in foreign leagues while encouraging IPL owners to invest globally creates an asymmetric playing field that fundamentally disadvantages smaller boards.": "ට්‍රෙන්ට් බෝල්ට් පූර්වාදර්ශය: නවසීලන්තයේ ට්‍රෙන්ට් බෝල්ට් තම මධ්‍යම කොන්ත්‍රාත්තුවෙන් ඉවත් වූයේ වඩා හොඳ \"වැඩ-ජීවිත සමතුලිතතාවයකින්\" යුත් ෆ්‍රැන්චයිස් ක්‍රිකට් ක්‍රීඩාව කරගෙන යාම සඳහා ය. ශ්‍රී ලංකාව වැනි කුඩා ජාතියක, ප්‍රධාන ක්‍රීඩකයින් එක් අයෙකු හෝ දෙදෙනෙකු සමාන තේරීම් කළහොත්, ජාතික කණ්ඩායමට ආපසු හැරවිය නොහැකි දක්ෂතා අහිමි වේ. IPL හිමිකරුවන්ට ගෝලීය වශයෙන් ආයෝජනය කිරීමට දිරිගන්වන අතරම, ඉන්දියානු ක්‍රීඩකයින්ට විදේශීය ලීගවල ක්‍රීඩා කිරීමට ඉඩ නොදෙන BCCI ප්‍රතිපත්තිය කුඩා මණ්ඩලවලට මූලික වශයෙන් අවාසිදායක වන අසමමිතික ක්‍රීඩා පිටියක් නිර්මාණය කරයි.",
  "The Trent Boult precedent:": "ට්‍රෙන්ට් බෝල්ට් පූර්වාදර්ශය:",
  "New Zealand's Trent Boult opted out of his central contract to pursue franchise cricket with better &quot;work-life balance.&quot; For a small nation like Sri Lanka, if even one or two key players make similar choices, the national team loses irreplaceable talent. The BCCI's policy of not allowing Indian players to play in foreign leagues while encouraging IPL owners to invest globally creates an asymmetric playing field that fundamentally disadvantages smaller boards.": "නවසීලන්තයේ ට්‍රෙන්ට් බෝල්ට් තම මධ්‍යම කොන්ත්‍රාත්තුවෙන් ඉවත් වූයේ වඩා හොඳ \"වැඩ-ජීවිත සමතුලිතතාවයකින්\" යුත් ෆ්‍රැන්චයිස් ක්‍රිකට් ක්‍රීඩාව කරගෙන යාම සඳහා ය. ශ්‍රී ලංකාව වැනි කුඩා රටක, ප්‍රධාන ක්‍රීඩකයින් එක් අයෙකු හෝ දෙදෙනෙකු සමාන තේරීම් කළහොත්, ජාතික කණ්ඩායමට ආපසු හැරවිය නොහැකි දක්ෂතා අහිමි වේ. ඉන්දියානු ක්‍රීඩකයින්ට විදේශීය ලීගවල ක්‍රීඩා කිරීමට ඉඩ නොදෙන අතරම IPL හිමිකරුවන්ට ගෝලීය වශයෙන් ආයෝජනය කිරීමට දිරිගැන්වීමේ BCCI ප්‍රතිපත්තිය කුඩා මණ්ඩලවලට මූලික වශයෙන් අවාසිදායක වන අසමමිතික ක්‍රීඩා පිටියක් නිර්මාණය කරයි.",
  "The LPL paradox: Sri Lanka's own Lanka Premier League was meant to retain talent domestically and generate revenue. Instead, it was corruption-plagued (two franchises — Jaffna Kings and Colombo Strikers — were terminated for contractual failures), was postponed in 2025, and became yet another corruption vector rather than a development tool.": "LPL විරුද්ධාභාසය: ශ්‍රී ලංකාවේම ලංකා ප්‍රිමියර් ලීගය දේශීය වශයෙන් දක්ෂතා රඳවා තබා ගැනීමට සහ ආදායම් උපයා ගැනීමට අදහස් කරන ලදී. ඒ වෙනුවට, එය දූෂණයෙන් පිරී තිබුණි (ජාෆ්නා කිංග්ස් සහ කලම්බු ස්ට්‍රයිකර්ස් යන ෆ්‍රැන්චයිස් දෙක කොන්ත්‍රාත් අසාර්ථකත්වයන් හේතුවෙන් අවසන් කරන ලදී), 2025 දී කල් දමන ලද අතර සංවර්ධන මෙවලමක් වෙනුවට තවත් දූෂණ වාහකයක් බවට පත්විය.",
  "The LPL paradox:": "LPL විරුද්ධාභාසය:",
  "Sri Lanka's own Lanka Premier League was meant to retain talent domestically and generate revenue. Instead, it was corruption-plagued (two franchises — Jaffna Kings and Colombo Strikers — were terminated for contractual failures), was postponed in 2025, and became yet another corruption vector rather than a development tool.": "ශ්‍රී ලංකාවේම ලංකා ප්‍රිමියර් ලීගය දේශීය වශයෙන් දක්ෂතා රඳවා තබා ගැනීමට සහ ආදායම් උපයා ගැනීමට අදහස් කරන ලදී. ඒ වෙනුවට, එය දූෂණයෙන් පිරී තිබුණි (ජාෆ්නා කිංග්ස් සහ කලම්බු ස්ට්‍රයිකර්ස් යන ෆ්‍රැන්චයිස් දෙක කොන්ත්‍රාත් අසාර්ථකත්වයන් හේතුවෙන් අවසන් කරන ලදී), 2025 දී කල් දමන ලද අතර සංවර්ධන මෙවලමක් වෙනුවට තවත් දූෂණ වාහකයක් බවට පත්විය.",
  "The Small Nation Talent Calculus": "කුඩා ජාතියේ කුසලතා කලනය",
  "Sri Lanka draws from an effective talent pool of approximately 4-5 million (accounting for geographic, ethnic, and economic barriers to access). Australia draws from 26 million, England from 56 million, India from 1.4 billion. When you expose this tiny talent pool to the IPL's financial gravity — where even mid-tier franchise salaries exceed SLC central contracts — the incentive structure collapses. Players rationally prioritise franchise income over national duty. The solution isn't moral appeals to patriotism; it's structural reform that makes the national team financially and professionally competitive with franchise alternatives. SLC's current revenue structure, crippled by corruption, cannot achieve this.": "ශ්‍රී ලංකාව ආසන්න වශයෙන් මිලියන 4-5 ක ඵලදායී කුසලතා සංචිතයකින් (භූගෝලීය, වාර්ගික සහ ආර්ථික ප්‍රවේශ බාධක හේතුවෙන්) ඇද ගනී. ඕස්ට්‍රේලියාව මිලියන 26 කින්, එංගලන්තය මිලියන 56 කින්, ඉන්දියාව බිලියන 1.4 කින් ඇද ගනී. ඔබ මෙම කුඩා කුසලතා සංචිතය IPL හි මූල්‍ය ගුරුත්වාකර්ෂණයට නිරාවරණය කරන විට - මධ්‍යම මට්ටමේ ෆ්‍රැන්චයිස් වැටුප් පවා SLC මධ්‍යම කොන්ත්‍රාත්තු ඉක්මවා යන විට - දිරිගැන්වීමේ ව්‍යුහය බිඳ වැටේ. ක්‍රීඩකයින් ජාතික රාජකාරියට වඩා ෆ්‍රැන්චයිස් ආදායමට තාර්කිකව ප්‍රමුඛත්වය දෙයි. විසඳුම දේශප්‍රේමයට සදාචාරාත්මක ආයාචනා නොවේ; ජාතික කණ්ඩායම ෆ්‍රැන්චයිස් විකල්ප සමඟ මූල්‍යමය වශයෙන් සහ වෘත්තීයමය වශයෙන් තරඟකාරී කරන ව්‍යුහාත්මක ප්‍රතිසංස්කරණයකි. දූෂණයෙන් අඩපණ වී ඇති SLC හි වත්මන් ආදායම් ව්‍යුහයට මෙය සාක්ෂාත් කරගත නොහැක.",
  "The Franchise Expansion Map": "ෆ්‍රැන්චයිස් ව්‍යාප්ති සිතියම",
  "IPL franchise owners now control teams across multiple leagues globally: SA20 (South Africa), ILT20 (UAE), Major League Cricket (USA), and are now investing in The Hundred (England). This creates a global franchise network where the BCCI's influence extends far beyond India's borders. Pakistan players are already being informally excluded from IPL-linked leagues across multiple countries.": "IPL ෆ්‍රැන්චයිස් හිමිකරුවන් දැන් ගෝලීය වශයෙන් බහු ලීග හරහා කණ්ඩායම් පාලනය කරයි: SA20 (දකුණු අප්‍රිකාව), ILT20 (UAE), මේජර් ලීග් ක්‍රිකට් (USA), සහ දැන් The Hundred (එංගලන්තය) හි ආයෝජනය කරයි. මෙය BCCI හි බලපෑම ඉන්දියාවේ දේශසීමාවෙන් ඔබ්බට විහිදෙන ගෝලීය ෆ්‍රැන්චයිස් ජාලයක් නිර්මාණය කරයි. පකිස්ථාන ක්‍රීඩකයින් දැනටමත් බහු රටවල් හරහා IPL-සම්බන්ධිත ලීග වලින් අවිධිමත් ලෙස බැහැර කර ඇත.",
  "For Sri Lanka, this means: (a) their players who get IPL contracts become embedded in a BCCI-controlled ecosystem, (b) the LPL cannot compete with IPL-linked leagues for franchise investment or player commitment, (c) SLC has no leverage in negotiations because India's broadcast revenue underwrites the ICC, and (d) any attempt to assert independence risks the BCCI's financial displeasure. Sri Lanka is trapped in a dependency relationship where loyalty yields no protection and independence yields punishment.": "ශ්‍රී ලංකාව සම්බන්ධයෙන් ගත් කල, මෙයින් අදහස් කරන්නේ: (අ) IPL කොන්ත්‍රාත්තු ලබා ගන්නා ඔවුන්ගේ ක්‍රීඩකයින් BCCI විසින් පාලනය කරනු ලබන පරිසර පද්ධතියකට ඇතුළත් වේ, (ආ) LPL හට IPL හා සම්බන්ධ ලීග සමඟ ෆ්‍රැන්චයිස් ආයෝජනය හෝ ක්‍රීඩක කැපවීම සඳහා තරඟ කළ නොහැක, (ඇ) ඉන්දියාවේ විකාශන ආදායම ICC යටතට පත්වන බැවින් SLC හට සාකච්ඡා වලදී කිසිදු උත්තේජනයක් නොමැත, සහ (ඈ) ස්වාධීනත්වය තහවුරු කිරීමට ගන්නා ඕනෑම උත්සාහයක් BCCI හි මූල්‍ය අප්‍රසාදයට අවදානමක් ඇති කරයි. ශ්‍රී ලංකාව යැපුම් සම්බන්ධතාවයක සිරවී සිටින අතර එහිදී පක්ෂපාතිත්වය කිසිදු ආරක්ෂාවක් ලබා නොදෙන අතර ස්වාධීනත්වය දඬුවම් ලබා දෙයි.",
  "13 — The Calendar Crisis": "13 — දින දර්ශන අර්බුදය",
  "The Slow Death of Sri Lankan Test Cricket": "ශ්‍රී ලංකා ටෙස්ට් ක්‍රිකට් ක්‍රීඩාවේ මන්දගාමී මරණය",
  "Sri Lanka played as few as 4 Tests in a recent year. Australia plays 12-15 annually. This isn't a scheduling quirk — it's a structural dismantling of the format that builds the skills Sri Lanka most desperately needs.": "ශ්‍රී ලංකාව මෑත වසරකදී ක්‍රීඩා කළේ ටෙස්ට් තරග 4ක් වැනි සුළු සංඛ්‍යාවකි. ඕස්ට්‍රේලියාව වාර්ෂිකව තරග 12-15ක් ක්‍රීඩා කරයි. මෙය කාලසටහන්ගත කිරීමේ අමුතු දෙයක් නොවේ - එය ශ්‍රී ලංකාවට වඩාත්ම අවශ්‍ය කුසලතා ගොඩනඟන ආකෘතියේ ව්‍යුහාත්මක බිඳවැටීමකි.",
  "The Calendar Squeeze": "දින දර්ශන මිරිකීම",
  "The ICC does not control the international cricket calendar the way FIFA controls football's calendar. It has &quot;satisfied itself with carving out a slot for its annual events&quot; while leaving bilateral scheduling to the boards. The result: the Big Three (India, England, Australia) play packed schedules of lucrative bilateral series against each other, while smaller nations scramble for whatever is left.": "FIFA පාපන්දු දින දර්ශනය පාලනය කරන ආකාරයට ICC ය ජාත්‍යන්තර ක්‍රිකට් දින දර්ශනය පාලනය නොකරයි. එය \"තම වාර්ෂික සිදුවීම් සඳහා ස්ථානයක් වෙන් කිරීමෙන් සෑහීමකට පත්වේ\", නමුත් ද්විපාර්ශ්වික කාලසටහන් මණ්ඩලවලට භාර දී ඇත. ප්‍රතිඵලය: මහා ත්‍රිත්වය (ඉන්දියාව, එංගලන්තය, ඕස්ට්‍රේලියාව) එකිනෙකාට එරෙහිව ලාභදායී ද්විපාර්ශ්වික තරඟාවලිවල ඇසුරුම් කළ කාලසටහන් ක්‍රීඩා කරන අතර කුඩා ජාතීන් ඉතිරිව ඇති දේ සඳහා පොරබදති.",
  "Sri Lanka's Test schedule has been steadily shrinking. In 2026, only 6 Tests are scheduled. For comparison, India and England regularly play 4-5 Test series against each other alone. The World Test Championship requires all Full Members to play each other at least twice over 10 years — but &quot;two&quot; is the minimum, and for smaller boards, two is usually all they get.": "ශ්‍රී ලංකාවේ ටෙස්ට් කාලසටහන ක්‍රමයෙන් හැකිලෙමින් පවතී. 2026 දී, ටෙස්ට් තරඟ 6 ක් පමණක් පැවැත්වීමට නියමිතයි. සංසන්දනය කිරීම සඳහා, ඉන්දියාව සහ එංගලන්තය නිතිපතා එකිනෙකාට එරෙහිව තනිවම ටෙස්ට් තරඟාවලි 4-5 ක් ක්‍රීඩා කරයි. ලෝක ටෙස්ට් ශූරතාවලියට සියලුම පූර්ණ සාමාජිකයින් වසර 10 ක් තුළ අවම වශයෙන් දෙවරක්වත් එකිනෙකා සමඟ ක්‍රීඩා කළ යුතුය - නමුත් \"දෙකක්\" යනු අවම වන අතර කුඩා මණ්ඩල සඳහා, සාමාන්‍යයෙන් ඔවුන්ට ලැබෙන්නේ දෙකක් පමණි.",
  "The T20 World Cup and Champions Trophy now absorb 26% of the available calendar. Add the IPL window (April-June), other franchise leagues, and mandatory rest periods, and the space for bilateral Test cricket between smaller nations shrinks to almost nothing. South Africa — who just became World Test Champions — aren't scheduled to host a home Test until October 2026.": "T20 ලෝක කුසලානය සහ චැම්පියන්ස් කුසලානය දැන් පවතින දින දර්ශනයෙන් 26% ක් අවශෝෂණය කරයි. IPL කවුළුව (අප්‍රේල්-ජූනි), අනෙකුත් ෆ්‍රැන්චයිස් ලීග සහ අනිවාර්ය විවේක කාලයන් එකතු කළ විට, කුඩා ජාතීන් අතර ද්විපාර්ශ්වික ටෙස්ට් ක්‍රිකට් සඳහා ඇති ඉඩ ප්‍රමාණය මුළුමනින්ම අඩු වේ. ලෝක ටෙස්ට් ශූරයන් බවට පත් වූ දකුණු අප්‍රිකාව 2026 ඔක්තෝබර් වන තෙක් ගෘහස්ථ ටෙස්ට් තරගයක් පැවැත්වීමට නියමිත නැත.",
  "Why This Kills Sri Lanka Specifically": "මෙය ශ්‍රී ලංකාව විශේෂයෙන් මරා දමන්නේ ඇයි?",
  "Test cricket builds the skills SL needs most. The patience, game management, spin bowling depth, batting technique, and strategic thinking that Sri Lanka's golden era was built on — these are all Test cricket skills. Sangakkara, Jayawardene, and Muralitharan were forged in 5-day cricket. T20-first development produces explosive but brittle cricketers who can't construct an innings or bowl through a long spell.": "ටෙස්ට් ක්‍රිකට් ක්‍රීඩාව ශ්‍රී ලංකාවට වඩාත්ම අවශ්‍ය කුසලතා ගොඩනඟයි. ශ්‍රී ලංකාවේ ස්වර්ණමය යුගය ගොඩනැගුණු ඉවසීම, ක්‍රීඩා කළමනාකරණය, දඟ පන්දු යැවීමේ ගැඹුර, පිතිකරණ තාක්ෂණය සහ උපායමාර්ගික චින්තනය - මේ සියල්ල ටෙස්ට් ක්‍රිකට් කුසලතා වේ. සංගක්කාර, ජයවර්ධන සහ මුරලිදරන් දින 5 ක්‍රිකට් ක්‍රීඩාවෙන් බිහි විය. විස්සයි20 පළමු සංවර්ධනය පුපුරන සුලු නමුත් බිඳෙනසුලු ක්‍රිකට් ක්‍රීඩකයින් බිහි කරයි, ඔවුන්ට ඉනිමක් ගොඩනඟා ගැනීමට හෝ දිගු කාලයක් පන්දු යැවීමට නොහැකිය.",
  "Test cricket builds the skills SL needs most.": "ශ්‍රී ලංකාවට වඩාත්ම අවශ්‍ය කුසලතා ටෙස්ට් ක්‍රිකට් මගින් ගොඩනැගේ.",
  "The patience, game management, spin bowling depth, batting technique, and strategic thinking that Sri Lanka's golden era was built on — these are all Test cricket skills. Sangakkara, Jayawardene, and Muralitharan were forged in 5-day cricket. T20-first development produces explosive but brittle cricketers who can't construct an innings or bowl through a long spell.": "ශ්‍රී ලංකාවේ ස්වර්ණමය යුගය ගොඩනැගුණු ඉවසීම, ක්‍රීඩා කළමනාකරණය, දඟ පන්දු යැවීමේ ගැඹුර, පිතිකරණ තාක්ෂණය සහ උපායමාර්ගික චින්තනය - මේ සියල්ල ටෙස්ට් ක්‍රිකට් කුසලතාවන් ය. සංගක්කාර, ජයවර්ධන සහ මුරලිදරන් දින 5 ක්‍රිකට් ක්‍රීඩාවෙන් බිහි විය. T20-පළමු සංවර්ධනය පුපුරන සුලු නමුත් බිඳෙනසුලු ක්‍රිකට් ක්‍රීඩකයින් බිහි කරයි, ඔවුන්ට ඉනිමක් ගොඩනඟා ගැනීමට හෝ දිගු කාලයක් පන්දු යැවීමට නොහැකිය.",
  "Home Tests generate development. When Sri Lanka hosts Tests, it exposes domestic players to international-quality cricket through practice games, ground preparation, and media coverage. Fewer home Tests means less exposure, less interest, and less development pressure on the domestic system.": "දේශීය ටෙස්ට් තරඟ සංවර්ධනය ජනනය කරයි. ශ්‍රී ලංකාව ටෙස්ට් තරඟ පවත්වන විට, පුහුණු තරඟ, ක්‍රීඩාංගණ සකස් කිරීම සහ මාධ්‍ය ආවරණය හරහා දේශීය ක්‍රීඩකයින් ජාත්‍යන්තර ගුණාත්මක ක්‍රිකට් තරඟ සඳහා නිරාවරණය කරයි. ගෘහස්ථ ටෙස්ට් තරඟ අඩු වීම යනු දේශීය පද්ධතියට අඩු නිරාවරණයක්, අඩු උනන්දුවක් සහ අඩු සංවර්ධන පීඩනයකි.",
  "Home Tests generate development.": "නිවාස පරීක්ෂණ මගින් සංවර්ධනය ඇති වේ.",
  "When Sri Lanka hosts Tests, it exposes domestic players to international-quality cricket through practice games, ground preparation, and media coverage. Fewer home Tests means less exposure, less interest, and less development pressure on the domestic system.": "ශ්‍රී ලංකාව ටෙස්ට් තරඟ පවත්වන විට, පුහුණු තරඟ, ක්‍රීඩාංගණ සකස් කිරීම සහ මාධ්‍ය ආවරණය හරහා දේශීය ක්‍රීඩකයින් ජාත්‍යන්තර ගුණාත්මක ක්‍රිකට් ක්‍රීඩාවට නිරාවරණය කරයි. ගෘහස්ථ ටෙස්ට් තරඟ අඩු වීම යනු දේශීය පද්ධතියට අඩු නිරාවරණයක්, අඩු උනන්දුවක් සහ අඩු සංවර්ධන පීඩනයක් ඇති කිරීමයි.",
  "The revenue spiral. Fewer Tests = less broadcast revenue = less investment in development = weaker teams = even fewer broadcasters willing to pay for Sri Lanka Tests = even fewer Tests. This is a self-reinforcing decline that cannot be reversed without external intervention.": "ආදායම් සර්පිලාකාරය. අඩු පරීක්ෂණ = අඩු විකාශන ආදායම = සංවර්ධනය සඳහා අඩු ආයෝජන = දුර්වල කණ්ඩායම් = ශ්‍රී ලංකා ටෙස්ට් සඳහා ගෙවීමට කැමති විකාශකයින් ඊටත් වඩා අඩු වීම = ඊටත් වඩා අඩු පරීක්ෂණ. මෙය බාහිර මැදිහත්වීමකින් තොරව ආපසු හැරවිය නොහැකි ස්වයං-ශක්තිමත් කිරීමේ පරිහානියකි.",
  "The revenue spiral.": "ආදායම් සර්පිලාකාරය.",
  "Fewer Tests = less broadcast revenue = less investment in development = weaker teams = even fewer broadcasters willing to pay for Sri Lanka Tests = even fewer Tests. This is a self-reinforcing decline that cannot be reversed without external intervention.": "අඩු පරීක්ෂණ = අඩු විකාශන ආදායම = සංවර්ධනය සඳහා අඩු ආයෝජන = දුර්වල කණ්ඩායම් = ශ්‍රී ලංකා ටෙස්ට් සඳහා ගෙවීමට කැමති විකාශකයින් පවා අඩු වීම = ඊටත් වඩා අඩු පරීක්ෂණ. මෙය බාහිර මැදිහත්වීමකින් තොරව ආපසු හැරවිය නොහැකි ස්වයං-ශක්තිමත් කිරීමේ පරිහානියකි.",
  "The Two-Tier Debate": "ද්වි-මට්ටමේ විවාදය",
  "ICC chair Jay Shah is reportedly discussing a two-tier Test system: a top flight of 7 nations (England, Australia, India, South Africa, Pakistan, Sri Lanka, New Zealand) with the rest in Division 2. Sri Lanka would likely be in Tier 1 based on historical standing, but their current form puts that position at risk.": "ICC සභාපති ජේ ෂා ද්වි-ස්ථර ටෙස්ට් ක්‍රමයක් ගැන සාකච්ඡා කරමින් සිටින බව වාර්තා වේ: රටවල් 7 ක (එංගලන්තය, ඕස්ට්‍රේලියාව, ඉන්දියාව, දකුණු අප්‍රිකාව, පකිස්ථානය, ශ්‍රී ලංකාව, නවසීලන්තය) ඉහළම ශ්‍රේණිගත කිරීමක් සහ ඉතිරිය 2 වන කොටසේ. ඓතිහාසික තත්ත්වය අනුව ශ්‍රී ලංකාව 1 වන ස්ථරයේ සිටීමට ඉඩ ඇත, නමුත් ඔවුන්ගේ වර්තමාන ස්වරූපය එම ස්ථානය අවදානමට ලක් කරයි.",
  "The danger: If Sri Lanka falls to Tier 2, it triggers a catastrophic decline — fewer marquee opponents, less broadcast value, reduced ICC funding, and a talent exodus as players choose franchise cricket over second-tier international duty. It would be, in effect, the end of Sri Lanka as a competitive Test nation.": "අනතුර: ශ්‍රී ලංකාව දෙවන ස්ථරයට වැටුණහොත්, එය විනාශකාරී පරිහානියකට තුඩු දෙයි - අඩු මාකිව් ප්‍රතිවාදීන්, අඩු විකාශන වටිනාකම, අඩු ICC අරමුදල් සහ ක්‍රීඩකයින් දෙවන ස්ථරයේ ජාත්‍යන්තර රාජකාරියට වඩා ෆ්‍රැන්චයිස් ක්‍රිකට් තෝරා ගන්නා විට දක්ෂතා නික්ම යාම. ඇත්ත වශයෙන්ම, එය තරඟකාරී ටෙස්ට් ජාතියක් ලෙස ශ්‍රී ලංකාවේ අවසානය වනු ඇත.",
  "The danger:": "අනතුර:",
  "If Sri Lanka falls to Tier 2, it triggers a catastrophic decline — fewer marquee opponents, less broadcast value, reduced ICC funding, and a talent exodus as players choose franchise cricket over second-tier international duty. It would be, in effect, the end of Sri Lanka as a competitive Test nation.": "ශ්‍රී ලංකාව දෙවන ස්ථරයට වැටුණහොත්, එය විනාශකාරී පරිහානියකට තුඩු දෙනු ඇත - අඩු මාකිව් ප්‍රතිවාදීන්, අඩු විකාශන වටිනාකම, අඩු ICC අරමුදල් සහ ක්‍රීඩකයින් දෙවන ස්ථරයේ ජාත්‍යන්තර රාජකාරියට වඩා ෆ්‍රැන්චයිස් ක්‍රිකට් තෝරා ගන්නා විට දක්ෂතා නික්ම යාම. ඇත්ත වශයෙන්ම, එය තරඟකාරී ටෙස්ට් ජාතියක් ලෙස ශ්‍රී ලංකාවේ අවසානය වනු ඇත.",
  "The opportunity: If properly structured, two tiers with promotion/relegation could give Sri Lanka guaranteed fixtures against top opposition and a clear competitive framework. But this requires the Big Three to accept reduced bilateral flexibility — something they have historically resisted.": "අවස්ථාව: නිසි ලෙස ව්‍යුහගත කර ඇත්නම්, උසස්වීම්/පහරදීම් සහිත ස්ථර දෙකක් මඟින් ශ්‍රී ලංකාවට ඉහළ ප්‍රතිවාදීන්ට එරෙහිව සහතික කළ තරඟ සහ පැහැදිලි තරඟකාරී රාමුවක් ලබා දිය හැකිය. නමුත් මේ සඳහා මහා කණ්ඩායම් තුනට අඩු ද්විපාර්ශ්වික නම්‍යශීලීභාවය පිළිගැනීමට අවශ්‍ය වේ - ඔවුන් ඓතිහාසිකව විරුද්ධ වූ දෙයක්.",
  "The opportunity:": "අවස්ථාව:",
  "If properly structured, two tiers with promotion/relegation could give Sri Lanka guaranteed fixtures against top opposition and a clear competitive framework. But this requires the Big Three to accept reduced bilateral flexibility — something they have historically resisted.": "නිසි ලෙස ව්‍යුහගත කර ඇත්නම්, උසස්වීම්/පහරදීම් සහිත ස්ථර දෙකක් මඟින් ශ්‍රී ලංකාවට ඉහළ ප්‍රතිවාදීන්ට එරෙහිව සහතික කළ තරඟ සහ පැහැදිලි තරඟකාරී රාමුවක් ලබා දිය හැකිය. නමුත් මේ සඳහා මහා කණ්ඩායම් තුනට අඩු ද්විපාර්ශ්වික නම්‍යශීලීභාවය පිළිගැනීමට අවශ්‍ය වේ - ඔවුන් ඓතිහාසිකව විරුද්ධ වූ දෙයක්.",
  "Four-day Tests: The ICC is also considering four-day Tests in the WTC to make Test cricket &quot;more attainable for lower-ranked boards.&quot; While pragmatic, this further dilutes the format's unique demands — the very demands that develop complete cricketers. It's a band-aid on a structural wound.": "දින හතරේ ටෙස්ට්: ටෙස්ට් ක්‍රිකට් \"පහළ ශ්‍රේණිගත මණ්ඩල සඳහා වඩාත් ළඟා කර ගත හැකි\" කිරීම සඳහා WTC හි දින හතරේ ටෙස්ට් තරඟ පැවැත්වීමට ICC ද සලකා බලයි. ප්‍රායෝගික වුවත්, මෙය ආකෘතියේ අද්විතීය ඉල්ලීම් - සම්පූර්ණ ක්‍රිකට් ක්‍රීඩකයින් වර්ධනය කරන ඉල්ලීම් - තවදුරටත් දියාරු කරයි. එය ව්‍යුහාත්මක තුවාලයකට වෙළුම් පටියක් දැමීමකි.",
  "Four-day Tests:": "සිව්දින ටෙස්ට් තරග:",
  "The ICC is also considering four-day Tests in the WTC to make Test cricket &quot;more attainable for lower-ranked boards.&quot; While pragmatic, this further dilutes the format's unique demands — the very demands that develop complete cricketers. It's a band-aid on a structural wound.": "\"පහළ ශ්‍රේණිගත මණ්ඩල සඳහා ටෙස්ට් ක්‍රිකට් වඩාත් පහසුවෙන් ලබා ගත හැකි\" කිරීම සඳහා WTC හි දින හතරක ටෙස්ට් තරඟ පැවැත්වීමට ICC ද සලකා බලයි. ප්‍රායෝගික වුවත්, මෙය ආකෘතියේ අද්විතීය ඉල්ලීම් - සම්පූර්ණ ක්‍රිකට් ක්‍රීඩකයින් වර්ධනය කරන ඉල්ලීම් - තවදුරටත් දියාරු කරයි. එය ව්‍යුහාත්මක තුවාලයකට වෙළුම් පටියක් දැමීමකි.",
  "The Former ICC Chair's Admission": "හිටපු ICC සභාපතිවරයාගේ ඇතුළත් කිරීම",
  "Former ICC chair Greg Barclay admitted in 2024 that &quot;cricket is ungovernable.&quot; The ICC is &quot;a members' club in the name of a governing body, and the self-interest of members will always trump the wider welfare of the game.&quot; The finances are &quot;unhealthily dependent on viewership from one country&quot; — giving the BCCI &quot;enormous sway over global decision-making.&quot; For Sri Lanka, this means reform must come not from the ICC (which is structurally captured) but from internal restructuring that maximises the value of whatever international cricket Sri Lanka does get to play.": "2024 දී හිටපු ICC සභාපති ග්‍රෙග් බාර්ක්ලේ පිළිගත්තේ \"ක්‍රිකට් පාලනය කළ නොහැකි\" බවයි. ICC යනු \"පාලක මණ්ඩලයක නාමයෙන් සාමාජිකයින්ගේ සමාජයක්\" වන අතර සාමාජිකයින්ගේ ආත්මාර්ථකාමිත්වය සැමවිටම ක්‍රීඩාවේ පුළුල් සුභසාධනයට වඩා ඉහළින් පවතිනු ඇත. \"මූල්‍ය කටයුතු\" එක් රටක නරඹන්නන් මත අහිතකර ලෙස රඳා පවතී - එමඟින් BCCI හට \"ගෝලීය තීරණ ගැනීම කෙරෙහි දැවැන්ත ආධිපත්‍යයක්\" ලබා දෙයි. ශ්‍රී ලංකාව සඳහා, මෙයින් අදහස් කරන්නේ ප්‍රතිසංස්කරණ සිදුවිය යුත්තේ ICC යෙන් නොව (එය ව්‍යුහාත්මකව අල්ලාගෙන ඇත) නමුත් ශ්‍රී ලංකාව ක්‍රීඩා කරන ඕනෑම ජාත්‍යන්තර ක්‍රිකට් ක්‍රීඩාවක වටිනාකම උපරිම කරන අභ්‍යන්තර ප්‍රතිව්‍යුහගත කිරීමෙනි.",
  "14 — The Undiscussed": "14 — සාකච්ඡා නොකළ",
  "Insights Nobody Talks About": "කිසිවෙකු කතා නොකරන තීක්ෂ්ණ බුද්ධිය",
  "The conversations that don't make it into mainstream cricket analysis — the structural, cultural, and geopolitical factors that shape Sri Lanka's cricket crisis.": "ප්‍රධාන ධාරාවේ ක්‍රිකට් විශ්ලේෂණයට ඇතුළත් නොවන සංවාද - ශ්‍රී ලංකාවේ ක්‍රිකට් අර්බුදය හැඩගස්වන ව්‍යුහාත්මක, සංස්කෘතික සහ භූ දේශපාලනික සාධක.",
  "🔍 The Rarely Discussed Dimensions": "🔍 කලාතුරකින් සාකච්ඡා කරන ලද මානයන්",
  "1. The Jayasuriya Paradox": "1. ජයසූරිය විරුද්ධාභාසය",
  "Sri Lanka's current head coach, Sanath Jayasuriya, was banned by the ICC in 2019 for refusing to cooperate with an anti-corruption investigation. He is now the head coach of the team the ICC's own anti-corruption unit monitors most closely. This isn't just ironic — it sends a signal to players about the organisation's relationship with integrity. If the coach has unresolved corruption questions, how credible is the institutional message about playing clean? No mainstream analysis connects Jayasuriya's appointment to the ongoing corruption culture.": "ශ්‍රී ලංකාවේ වත්මන් ප්‍රධාන පුහුණුකරු සනත් ජයසූරිය මහතා 2019 දී දූෂණ විරෝධී පරීක්ෂණයකට සහයෝගය දැක්වීම ප්‍රතික්ෂේප කිරීම හේතුවෙන් ICC විසින් තහනම් කරන ලදී. ඔහු දැන් ICC හි දූෂණ විරෝධී ඒකකය විසින් වඩාත් සමීපව නිරීක්ෂණය කරන කණ්ඩායමේ ප්‍රධාන පුහුණුකරු වේ. මෙය හුදෙක් උත්ප්‍රාසාත්මක දෙයක් නොවේ - එය ක්‍රීඩකයින්ට සංවිධානයේ අඛණ්ඩතාව සමඟ ඇති සම්බන්ධතාවය පිළිබඳ සංඥාවක් යවයි. පුහුණුකරුට නොවිසඳුණු දූෂණ ප්‍රශ්න තිබේ නම්, පිරිසිදුව ක්‍රීඩා කිරීම පිළිබඳ ආයතනික පණිවිඩය කෙතරම් විශ්වාසදායකද? ජයසූරියගේ පත්වීම අඛණ්ඩ දූෂණ සංස්කෘතියට සම්බන්ධ කරන ප්‍රධාන ධාරාවේ විශ්ලේෂණයක් නොමැත.",
  "2. The Economic Crisis as a Cricketing Crisis": "2. ක්‍රිකට් අර්බුදයක් ලෙස ආර්ථික අර්බුදය",
  "Sri Lanka's 2022 economic collapse didn't just affect fans emotionally — it materially degraded cricket infrastructure. Ground maintenance budgets were cut. Domestic tournament funding dried up. Coaches left for better-paying positions abroad. The nutritional and fitness baselines for emerging players declined because training facility standards dropped. The economic crisis hollowed out the cricket system in ways that won't be visible for another 3-5 years as the affected generation reaches international level.": "ශ්‍රී ලංකාවේ 2022 ආර්ථික බිඳවැටීම රසිකයින්ට චිත්තවේගීය වශයෙන් පමණක් බලපෑවේ නැත - එය ක්‍රිකට් යටිතල පහසුකම් ද්‍රව්‍යමය වශයෙන් පිරිහීමට ලක් කළේය. ක්‍රීඩාංගණ නඩත්තු අයවැය කපා හරින ලදී. දේශීය තරඟාවලි අරමුදල් වියළී ගියේය. පුහුණුකරුවන් විදේශයන්හි වඩා හොඳ වැටුප් සහිත තනතුරු සඳහා පිටත් විය. පුහුණු පහසුකම් ප්‍රමිතීන් පහත වැටීම නිසා නැගී එන ක්‍රීඩකයින් සඳහා පෝෂණ හා යෝග්‍යතා මූලික කරුණු පහත වැටුණි. බලපෑමට ලක් වූ පරම්පරාව ජාත්‍යන්තර මට්ටමට ළඟා වන විට තවත් වසර 3-5ක් යන තෙක් නොපෙනෙන ආකාරයෙන් ආර්ථික අර්බුදය ක්‍රිකට් පද්ධතිය හිස් කළේය.",
  "3. The Tamil & Muslim Talent Blackout": "3. දෙමළ සහ මුස්ලිම් දක්ෂතා අවහිර කිරීම",
  "Sri Lanka's Northern and Eastern provinces — majority Tamil and Muslim populations — have been systematically underinvested in cricket development since the civil war ended in 2009. Despite 17 years of &quot;peace,&quot; there is no meaningful provincial cricket infrastructure in Jaffna, Batticaloa, or Trincomalee. In a country of 22 million, excluding ~30% of the population from the talent pipeline is mathematically devastating. India draws from 1.4 billion across all regions; Sri Lanka effectively draws from 15 million in the Sinhalese south and west.": "2009 දී සිවිල් යුද්ධය අවසන් වූ දා සිට ශ්‍රී ලංකාවේ උතුරු සහ නැගෙනහිර පළාත් - බහුතර දෙමළ සහ මුස්ලිම් ජනගහනය - ක්‍රිකට් සංවර්ධනය සඳහා ක්‍රමානුකූලව අඩු ආයෝජනයක් කර ඇත. \"සාමය\" වසර 17 ක් පැවතුනද, යාපනය, මඩකලපුව හෝ ත්‍රිකුණාමලය යන ප්‍රදේශවල අර්ථවත් පළාත් ක්‍රිකට් යටිතල පහසුකම් නොමැත. මිලියන 22 ක් සිටින රටක, කුසලතා නල මාර්ගයෙන් ජනගහනයෙන් ~30% ක් බැහැර කිරීම ගණිතමය වශයෙන් විනාශකාරී ය. ඉන්දියාව සියලුම කලාපවලින් බිලියන 1.4 කින් ආකර්ෂණය කරයි; ශ්‍රී ලංකාව සිංහල දකුණේ සහ බටහිරින් මිලියන 15 කින් ආකර්ෂණය කරයි.",
  "4. The &quot;Assistant Coach&quot; Brain Drain": "4. \"සහකාර පුහුණුකරු\" මොළයේ ගලනය",
  "Sri Lanka's best coaching minds — the mid-level assistant coaches and analysts who actually develop players — are being hired away by richer cricket boards and franchise leagues. Pakistan, Afghanistan, and even lower-ranked nations offer better salaries for coaching talent than SLC. This creates a paradox: Sri Lankan coaching expertise improves cricket everywhere in the world except Sri Lanka. The Brain Centre upgrade means nothing if you can't retain the brains.": "ශ්‍රී ලංකාවේ හොඳම පුහුණු මනස - ක්‍රීඩකයින් සැබවින්ම සංවර්ධනය කරන මධ්‍යම මට්ටමේ සහකාර පුහුණුකරුවන් සහ විශ්ලේෂකයින් - පොහොසත් ක්‍රිකට් මණ්ඩල සහ ෆ්‍රැන්චයිස් ලීග මගින් කුලියට ගනු ලැබේ. පකිස්ථානය, ඇෆ්ගනිස්ථානය සහ පහළ ශ්‍රේණිගත කිරීම්වල සිටින රටවල් පවා ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට වඩා පුහුණු කුසලතා සඳහා හොඳ වැටුප් ලබා දෙයි. මෙය විරුද්ධාභාසයක් ඇති කරයි: ශ්‍රී ලංකා පුහුණු විශේෂඥතාව ශ්‍රී ලංකාව හැර ලෝකයේ සෑම තැනකම ක්‍රිකට් වැඩි දියුණු කරයි. මොළය රඳවා ගැනීමට නොහැකි නම් බ්‍රේන් සෙන්ටර් උත්ශ්‍රේණි කිරීම කිසිවක් අදහස් නොකරයි.",
  "5. The LPL as a Corruption Multiplier": "5. දූෂණ ගුණකයක් ලෙස LPL",
  "The Lanka Premier League was meant to be SLC's IPL — a revenue generator and development tool. Instead, it has become another vector for corruption. Praveen Jayawickrama was charged for failing to report fixing approaches during the LPL. The league has been postponed (2025 LPL was delayed), franchise owners have faced allegations of financial irregularities, and the competition has become a liability rather than an asset. Rather than developing talent, it has created more corruption exposure for young players.": "ලංකා ප්‍රිමියර් ලීගය ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ IPL වීමට නියමිතව තිබුණි - එය ආදායම් උත්පාදක සහ සංවර්ධන මෙවලමකි. ඒ වෙනුවට, එය දූෂණය සඳහා තවත් වාහකයක් බවට පත්ව ඇත. LPL අතරතුර පාවාදීමේ ප්‍රවේශයන් වාර්තා කිරීමට අපොහොසත් වීම සම්බන්ධයෙන් ප්‍රවීන් ජයවික්‍රමට චෝදනා එල්ල විය. ලීගය කල් දමා ඇත (2025 LPL ප්‍රමාද විය), ෆ්‍රැන්චයිස් හිමිකරුවන්ට මූල්‍ය අක්‍රමිකතා පිළිබඳ චෝදනා එල්ල වී ඇති අතර, තරඟය වත්කමක් නොව වගකීමක් බවට පත්ව ඇත. දක්ෂතා වර්ධනය කිරීමට වඩා, එය තරුණ ක්‍රීඩකයින් සඳහා වැඩි දූෂණ නිරාවරණයක් නිර්මාණය කර ඇත.",
  "6. The Geopolitics of Cricket Influence": "6. ක්‍රිකට් බලපෑමේ භූ දේශපාලනය",
  "Shammi Silva's dual role as SLC President and ACC President gives the Sri Lankan &quot;mafia&quot; regional influence that makes them harder to dislodge. Any ICC action against SLC now risks destabilising the ACC power structure. The corrupt leadership has effectively created a mutual protection pact at the regional governance level — a sophisticated move that insulates them from reform pressure both domestically and internationally.": "ශ්‍රී ලංකා ක්‍රිකට් සභාපති සහ ACC සභාපති ලෙස ෂම්මි සිල්වාගේ ද්විත්ව භූමිකාව ශ්‍රී ලංකා \"මාෆියා\" කලාපීය බලපෑමට හේතු වන අතර එමඟින් ඔවුන් ඉවත් කිරීම දුෂ්කර වේ. ශ්‍රී ලංකා ක්‍රිකට් ආයතනයට එරෙහි ඕනෑම ICC ක්‍රියාමාර්ගයක් දැන් ACC බල ව්‍යුහය අස්ථාවර කිරීමේ අවදානමක් ඇත. දූෂිත නායකත්වය කලාපීය පාලන මට්ටමින් අන්‍යෝන්‍ය ආරක්ෂණ ගිවිසුමක් ඵලදායී ලෙස නිර්මාණය කර ඇත - දේශීය හා ජාත්‍යන්තර වශයෙන් ප්‍රතිසංස්කරණ පීඩනයෙන් ඔවුන්ව හුදකලා කරන නවීන පියවරකි.",
  "7. Cricket as Emotional Infrastructure in a Fragile State": "7. බිඳෙනසුලු රාජ්‍යයක චිත්තවේගීය යටිතල පහසුකම් ලෙස ක්‍රිකට්",
  "During the 2022 economic crisis, Al Jazeera reported that cricket served as &quot;mental healing&quot; for Sri Lankans — a unifying force in a country torn by racial, religious, and political divisions. When the cricket team fails, it doesn't just disappoint sports fans — it removes one of the few remaining sources of collective positive national identity. The stakes of cricket reform in Sri Lanka are not merely sporting; they are psychosocial. A failing cricket team in a fragile post-crisis society amplifies hopelessness in ways that are difficult to quantify but real in their impact.": "2022 ආර්ථික අර්බුදය අතරතුර, වාර්ගික, ආගමික සහ දේශපාලනික බෙදීම්වලින් ඉරා දැමූ රටක එක්සත් බලවේගයක් වන ශ්‍රී ලාංකිකයින්ට ක්‍රිකට් \"මානසික සුවයක්\" ලෙස සේවය කළ බව අල් ජසීරා වාර්තා කළේය. ක්‍රිකට් කණ්ඩායම අසාර්ථක වූ විට, එය ක්‍රීඩා ලෝලීන් කලකිරීමට පත් කරනවා පමණක් නොව - සාමූහික ධනාත්මක ජාතික අනන්‍යතාවයේ ඉතිරිව ඇති ප්‍රභවයන්ගෙන් එකක් ඉවත් කරයි. ශ්‍රී ලංකාවේ ක්‍රිකට් ප්‍රතිසංස්කරණයේ කොටස් හුදෙක් ක්‍රීඩාව නොවේ; ඒවා මනෝ සමාජීය ය. බිඳෙනසුලු පශ්චාත්-අර්බුද සමාජයක අසාර්ථක ක්‍රිකට් කණ්ඩායමක් බලාපොරොත්තු සුන්වීම ප්‍රමාණනය කිරීමට අපහසු නමුත් ඒවායේ බලපෑමෙන් සැබෑ ආකාරවලින් වැඩි කරයි.",
  "8. The IPL &quot;Caste System&quot; Within the Squad": "8. සංචිතය තුළ IPL \"කුල ක්‍රමය\"",
  "The IPL auction creates an invisible hierarchy within the Sri Lankan squad that nobody discusses publicly. Players with IPL contracts (Hasaranga, Pathirana) carry financial security, international prestige, and confidence into the dressing room. Players who went unsold (Mendis, Nissanka, Asalanka, Shanaka, Wellalage) carry rejection and financial anxiety. This split isn't just psychological — it affects team dynamics. IPL-contracted players have exposure to world-class analytics, coaching, and preparation; the unsold players return to SLC's comparatively primitive setup. The squad effectively operates at two different professional standards simultaneously, and the captain must manage both groups.": "IPL වෙන්දේසිය ශ්‍රී ලංකා සංචිතය තුළ නොපෙනෙන ධූරාවලියක් නිර්මාණය කරන අතර ඒ පිළිබඳව කිසිවෙකු ප්‍රසිද්ධියේ සාකච්ඡා නොකරයි. IPL කොන්ත්‍රාත්තු ඇති ක්‍රීඩකයින් (හසරංග, පතිරණ) ඇඳුම් පැළඳුම් කාමරයට මූල්‍ය ආරක්ෂාව, ජාත්‍යන්තර කීර්තිය සහ විශ්වාසය රැගෙන යයි. අලෙවි නොවූ ක්‍රීඩකයින් (මෙන්ඩිස්, නිශ්ශංක, අසලංක, ශානක, වෙල්ලාලගේ) ප්‍රතික්ෂේප කිරීම සහ මූල්‍ය කාංසාව රැගෙන යයි. මෙම බෙදීම මානසික පමණක් නොවේ - එය කණ්ඩායම් ගතිකත්වයට බලපායි. IPL-කොන්ත්‍රාත් ක්‍රීඩකයින්ට ලෝක මට්ටමේ විශ්ලේෂණ, පුහුණු කිරීම් සහ සූදානමට නිරාවරණය වේ; අලෙවි නොවූ ක්‍රීඩකයින් SLC හි සාපේක්ෂව ප්‍රාථමික සැකසුම වෙත නැවත පැමිණේ. සංචිතය එකවර වෙනස් වෘත්තීය ප්‍රමිතීන් දෙකකින් ඵලදායී ලෙස ක්‍රියාත්මක වන අතර නායකයා කණ්ඩායම් දෙකම කළමනාකරණය කළ යුතුය.",
  "9. The BCCI's Soft Colonialism of Asian Cricket": "9. ආසියානු ක්‍රිකට් ක්‍රීඩාවේ BCCI හි මෘදු යටත්විජිතවාදය",
  "Shammi Silva's dual role as SLC and ACC President appears to serve BCCI interests more than Sri Lankan ones. India's influence over the ACC means that Asian cricket's governance structures — from tournament hosting to revenue distribution to Future Tour Programme scheduling — are oriented around India's priorities. Sri Lanka's &quot;alliance&quot; with the BCCI has yielded co-hosting rights (on India's terms) but no meaningful structural benefits. This is what political scientists call &quot;soft hegemony&quot; — the appearance of partnership masking an asymmetric power relationship where one party sets all the terms.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ සහ ACC ආයතනයේ සභාපති ලෙස ෂම්මි සිල්වාගේ ද්විත්ව භූමිකාව ශ්‍රී ලාංකිකයන්ගේ අවශ්‍යතාවලට වඩා BCCI අවශ්‍යතා සඳහා සේවය කරන බව පෙනේ. ACC ආයතනය කෙරෙහි ඉන්දියාවේ බලපෑම නිසා ආසියානු ක්‍රිකට් පාලන ව්‍යුහයන් - තරඟාවලි සත්කාරකත්වයේ සිට ආදායම් බෙදා හැරීම දක්වා සහ අනාගත සංචාර වැඩසටහන් කාලසටහන්ගත කිරීම දක්වා - ඉන්දියාවේ ප්‍රමුඛතා වටා නැඹුරු වී ඇත. BCCI සමඟ ශ්‍රී ලංකාවේ \"සන්ධානය\" (ඉන්දියාවේ කොන්දේසි මත) සම-සත්කාරක අයිතිවාසිකම් ලබා දී ඇත, නමුත් අර්ථවත් ව්‍යුහාත්මක ප්‍රතිලාභ නොමැත. දේශපාලන විද්‍යාඥයින් මෙය \"මෘදු ආධිපත්‍යය\" ලෙස හඳුන්වන්නේ - එක් පාර්ශවයක් සියලු නියමයන් සකසන අසමමිතික බල සම්බන්ධතාවයක් ආවරණය කරන හවුල්කාරිත්වයක පෙනුමයි.",
  "10. The Selection Committee as Political Instrument": "10. දේශපාලන මෙවලමක් ලෙස තේරීම් කමිටුව",
  "Selection committees in SLC are not independent meritocratic bodies — they are appointed by the SLC board and, by extension, aligned with the board's political interests. Player selection becomes a tool for rewarding loyalty, punishing dissent, and maintaining the patronage network. Players who speak out against SLC governance find themselves mysteriously &quot;rested.&quot; Players aligned with the right power brokers get longer ropes. This is impossible to prove with direct evidence but is widely understood within the cricket community — and it creates a culture of silence among players who know that their careers depend on not challenging the system.": "ශ්‍රී ලංකා ක්‍රිකට් ආයතනයේ තේරීම් කමිටු ස්වාධීන කුසලතා ආයතන නොවේ - ඒවා පත් කරනු ලබන්නේ ශ්‍රී ලංකා ක්‍රිකට් මණ්ඩලය විසින් වන අතර, දිගුවකින්, මණ්ඩලයේ දේශපාලන අවශ්‍යතා සමඟ පෙළ ගැසී ඇත. ක්‍රීඩක තේරීම පක්ෂපාතිත්වයට ප්‍රතිලාභ ලබා දීම, විසම්මුතියට දඬුවම් කිරීම සහ අනුග්‍රාහක ජාලය පවත්වා ගැනීම සඳහා මෙවලමක් බවට පත්වේ. ශ්‍රී ලංකා ක්‍රිකට් පාලනයට එරෙහිව කතා කරන ක්‍රීඩකයින් අභිරහස් ලෙස \"විවේක\" ලබා ගනී. නිවැරදි බල තැරැව්කරුවන් සමඟ පෙලගැසී සිටින ක්‍රීඩකයින්ට දිගු ලණු ලැබේ. මෙය සෘජු සාක්ෂි සමඟ ඔප්පු කළ නොහැකි නමුත් ක්‍රිකට් ප්‍රජාව තුළ පුළුල් ලෙස වටහාගෙන ඇත - සහ එය ඔවුන්ගේ වෘත්තීය පද්ධතියට අභියෝග නොකිරීම මත රඳා පවතින බව දන්නා ක්‍රීඩකයින් අතර නිහඬ සංස්කෘතියක් නිර්මාණය කරයි.",
  "Community Comments": "ප්‍රජා අදහස්",
  "Anonymous · IP Logged · Bot Protected": "නිර්නාමික · IP ලොග් කර ඇත · බොට් ආරක්ෂිතයි",
  "No comments yet. Be the first.": "තවම අදහස් නැත. පළමුවැන්නා වන්න.",
  "Anonymous · Your IP is logged for legal protection only.": "නිර්නාමික · ඔබගේ IP ලිපිනය නීතිමය ආරක්ෂාව සඳහා පමණක් ලොග් කර ඇත.",
  "Post": "තැපැල්",
  "Political Research Dossier — The Death of Sri Lankan Cricket": "දේශපාලන පර්යේෂණ ලේඛනය - ශ්‍රී ලංකා ක්‍රිකට් ක්‍රීඩාවේ මරණය",
  "Analysis prepared February 2026 | Sources include ESPNcricinfo, Al Jazeera, Daily Mirror LK, Daily FT, DSK Decode, ICC, Island Cricket, The Morning, CricExec": "විශ්ලේෂණය 2026 පෙබරවාරි මාසයේදී සකස් කරන ලදී | මූලාශ්‍ර අතර ESPNcricinfo, Al Jazeera, Daily Mirror LK, Daily FT, DSK Decode, ICC, Island Cricket, The Morning, CricExec ඇතුළත් වේ."
}